[{"Name":"Hidden Spot - South San Francisco","Rating":4.7,"Address":"303 Grand Ave, South San Francisco, CA 94080","Categories":"Sandwiches, Burgers, Sports Bars","Latitude":37.65509,"Longitude":-122.41039,"Price":"$$","Reviews":"I was driving around looking for this place and then realized it's a kitchen spot inside the Hometown Hero's bar. These are without a doubt the best wings...\nLocated inside Hometown Heroes (sports bar). Parking is pretty easy! You order at their counter inside the bar, and are able to sit at a table or at the bar...\nI decided to give this place another try because I wanted to know if my last experience was just an \"off\" day. \nIt was not.\nI brought my brother, and he..."},{"Name":"Rockoto Peruvian cuisine","Rating":4.5,"Address":"207 Linden Ave, South San Francisco, CA 94080","Categories":"Peruvian","Latitude":37.6545022,"Longitude":-122.410557,"Price":"$$","Reviews":"Ceviche Costeno this along with the taro chips is delicious. Chicken Empanadas are light crispy and delicious as well.  The light green sauce served...\nThis strip of restaurants has some of the tastiest food I've had here in South San Francisco. Rockoto was no different. We came here on cold Tuesday night...\nFairly new place in SSF to enjoy some\nPisco sours and ceviche. We enjoyed the original and maracuyá sours, both were perfectly frothy. We  shared the..."},{"Name":"Mazra","Rating":4.7,"Address":"504 San Bruno Ave W, San Bruno, CA 94066","Categories":"Mediterranean, Barbeque, Tapas\/Small Plates","Latitude":37.62957,"Longitude":-122.41554,"Price":"$$","Reviews":"I showed up Sunday afternoon and the place is packed with limited parking. I was excited. Food must be amazing for this kind of crowd.... It was mid at...\nMazra is my #1 favorite Mediterranean place in the bay! Came during non-peak time and I felt like my food portions were bigger and juicer than last time....\nHow can I describe in a few words. \n\"Fun, Fun, Fun, a must to come to\"\nFamily friendly, bring a date and even a business meeting as well as big groups..."},{"Name":"Hula Hoops","Rating":4.2,"Address":"2278 Westborough Blvd, Ste 203, South San Francisco, CA 94080","Categories":"Tiki Bars, Asian Fusion, Venues & Event Spaces","Latitude":37.644909,"Longitude":-122.452615,"Price":"$$","Reviews":"Family Style Fun\nHad my husband's birthday dinner here for 27 people and Hula Hoops did an excellent job! From my initial request up to my event, Hula...\nThe food was very delicious and the drinks were amazing. The service provided by the staff was excellent.\nWonderful food & great service in a very busy restaurant. Beautiful presentation & delicious!"},{"Name":"Brothers Cafe","Rating":4.3,"Address":"382 Grand Ave, South San Francisco, CA 94080","Categories":"New American, Cafes, Breakfast & Brunch","Latitude":37.6556733955,"Longitude":-122.4119172565,"Price":"$$","Reviews":"Yelp came through for me once again. The food and service were great. \nI was amazed at how fast our food came out. Will definitely be back.\nI placed a phone order for pickup, but there seemed to be an issue with their phone system. The employee had difficulty hearing me and even got my name...\nHad breakfast here this past Sunday.\nFood was good with a large menu and friendly service.  Casual atmosphere.\nOrder and pay at counter and food delivered..."},{"Name":"Shabu Shack","Rating":4.5,"Address":"200 Grand Ave, South San Francisco, CA 94080","Categories":"Japanese, Hot Pot","Latitude":37.6550767748,"Longitude":-122.4086362329,"Price":"$$","Reviews":"Came for AYCE on a Monday night because there was no time like the present! AYCE is $44 and only offered Monday through Thursday. \nThe American wagyu, lamb...\nCame here for dinner last night with my bf after seeing this pop up on our radar a while ago. My sister also said she tried this spot and liked it so we...\nFood is good but I think it's a bit overpriced. +$2 if you want your entrée to come with udon and $7 for a side of 6 fish ball with roe is crazy. \nUnless..."},{"Name":"Minari","Rating":4.4,"Address":"449 San Mateo Ave, San Bruno, CA 94066","Categories":"Korean","Latitude":37.6229,"Longitude":-122.41156,"Price":"$$","Reviews":"Came here on a Wednesday for dinner and was craving some good Korean food! \nGood: \n- Fast service - our army stews came out in less than 10 min \n- Really...\nCame here on a Thursday evening at 6:30 with a couple of good friends. The place was full of patrons enjoying their food. Shortly after we were seated a...\nMinari is a welcomed addition to San Bruno. It provides the perfect bookend to K Grill and Tofu House who has been a long classic on San Mateo Ave.\nWe..."},{"Name":"A One Kitchen & Bar","Rating":4.4,"Address":"677 San Mateo Ave, San Bruno, CA 94066","Categories":"Bars, Seafood, Asian Fusion","Latitude":37.627862,"Longitude":-122.411562,"Price":"$$","Reviews":"The noodle soups are delicious! \nI saw other reviews recommending their thai\/malaysian food, so I followed their advice and it paid off. They have some...\nMaking a reservation in advance through Yelp was a seamless process, setting the stage for a culinary journey that exceeded expectations.\nFrom the Thai...\nYou need to check out this amazing restaurant. Been here three times so far and the food and service have been consistently great. Tried the garlic crab..."},{"Name":"Mom’s Tofu","Rating":4.5,"Address":"415 Grand Ave, South San Francisco, CA 94080","Categories":"Korean, Barbeque, Soup","Latitude":37.6556710726,"Longitude":-122.4131455022,"Price":"$$","Reviews":"A restaurant in the downstairs of a building, it's easy to miss but definitely come by because this is some of the best food in the area. \n*Their signature...\nThe service is a little slow. You definitely need to ring the little bell on your table if you need anything at all because they're not coming to your table...\nWas craving korean food and decided to try this and ended up being impressed! We ordered bibimbap, seafood pancake, and chicken soup. \nBibimbap and the..."},{"Name":"Cochinita","Rating":4.5,"Address":"334 Grand Ave, South San Francisco, CA 94080","Categories":"Mexican","Latitude":37.6555364175,"Longitude":-122.4108673706,"Price":"$$","Reviews":"Loved the vibes, service was great, and the food was chef's kiss! I can't wait to come back! I also had a mocktail, \"un domingo en merida\", it was...\nWe first had Cochinita at their food truck in SF, loved it and then a few weeks later, saw they were opening up on Grand Ave! The food has ALWAYS been...\nMy friend treated to dinner as a birthday gift!  The food was delicious!!!!!\nThe service was fantastic they made us feel at home, they surprised me with a..."},{"Name":"Sky Cafe","Rating":4.6,"Address":"223 Grand Ave, South San Francisco, CA 94134","Categories":"Vegan, New American, Asian Fusion","Latitude":37.6548187,"Longitude":-122.4092408,"Price":"$$","Reviews":"Immaculate vibes in here. Cutest French terrier named Jack greeted us along with the server. The food was mainly comfort style with great flavors. \nThe...\nI came here to meet up with my husband and his colleagues for a late lunch. The first thing I noticed when I walked in was the tables of empty plates that...\nI've ordered food from Sky Cafe twice now and both times I have been pleasantly surprised with how much I like the food.  The concept is certainly unique...."},{"Name":"Dumpling and Cajun Seafood","Rating":3.9,"Address":"320 Grand Ave, South San Francisco, CA 94080","Categories":"Cajun\/Creole, Seafood, Chinese","Latitude":37.65559,"Longitude":-122.41057,"Price":"$$","Reviews":"How many cajun - chinese places have you been to? I havent been to many, hence this review.\nCame here about an hour before closing.\nAmbience and...\nSo I have tried this restaurant about four times and won't go back anymore. \nWe did lunch buffet and ordered 7dishes but 4 of them are same dishes and one...\nWe usually go to the Chinese restaurant across the street, but decided to look at other options.  While looking at the menu from outside, the lady from..."},{"Name":"Sofra Grill","Rating":4.8,"Address":"132 Hazelwood Dr, South San Francisco, CA 94080","Categories":"Turkish, Middle Eastern, Barbeque","Latitude":37.64226,"Longitude":-122.42648,"Price":"$$","Reviews":"Perfection. Everything we had was delicious. That lamb shank! Just the best. I guess I need more words to post. Great experience.\nVery delicious, well prepared, fresh food! Great presentation \nWill definitely be back\nThe pomegranate sesame glazed chicken wings are bomb! It's a must order if you are here!\nCame here on a Tuesday night for dinner. The place was empty when..."},{"Name":"The Anecdote","Rating":4.3,"Address":"348 Oyster Point Blvd, South San Francisco, CA 94080","Categories":"New American","Latitude":37.6619327788,"Longitude":-122.3842532896,"Price":"$$","Reviews":"Food was abundant and delicious \nHad the chicken sausage, eggs,potatoes and pancakes \nCoffee was exempliary\nNice environment and pleasant service team. \nWait for food was longer than expected. \nLobster bisque was watery and didn't have much flavor and serving size...\nIt's a bit confusing finding this restaurant. \nGo to the end of Oyster Point and turn right into garage. Park on P3 West spaces take elevator to 1st floor..."},{"Name":"Local Kitchens","Rating":3.8,"Address":"851 Cherry Ave, Ste 2, San Bruno, CA 94066","Categories":"Food Court","Latitude":37.6268136112,"Longitude":-122.425534,"Price":"$$","Reviews":"Came by twice now, for dinner takeout.\nWas excited that a local kitchens opened up.\nParked in the parking lot. \nstaff is friendly.\nInside looks...\nSo stoked this place is finally open! \nHad the pleasure of first trying Local Kitchens for a Yelp Event in January of 2021. We loved the idea of one...\nLocal Kitchens is a gift to the San Bruno community!\nMy family and I went to their Grand Opening party on February 3 and loved it, however, I stopped..."},{"Name":"Amoura Restaurant","Rating":4.4,"Address":"713 Linden Ave, South San Francisco, CA 94080","Categories":"Mediterranean, Middle Eastern, Salad","Latitude":37.659551,"Longitude":-122.4089618411,"Price":"$$","Reviews":"Oh gosh. I was in the mood for an elevated dining experience and we found it 5 minutes from our hotel.\nWe had the roasted carrot\/avocado\/cuke veg, the...\nThis is definitely a more upscale restaurant, and the food is excellent! \nMezze platter - loved everything on here. Falafel had a great crunch, hummus was...\nI was recently in SF on business and we went to Amoura for dinner after a looong meeting.  Service was pleasant as we arrived, everyone ordering drinks at..."},{"Name":"White Elephant Restaurant","Rating":3.8,"Address":"146 Hazelwood Dr, South San Francisco, CA 94080","Categories":"Thai, Noodles, Vegetarian","Latitude":37.6420863,"Longitude":-122.4266505,"Price":"$$","Reviews":"Five Star Service!\nIn the era where tips is expected despite of sub par to no intention to do a good job, White Elephant Restaurant staffs were above and...\nWe enjoyed everything we ordered! Definitely going to get more spicy on the curry.\nService was good. Our order came before 7 when we ordered around 6:15....\nAll tables full on a Sunday evening so we knew it was going to be good. But it was better than we even expected!\nPerfect flavors on the creamy chicken red..."},{"Name":"Naan Point","Rating":4.7,"Address":"851 Cherry Ave, Ste 6, San Bruno, CA 94066","Categories":"Indian","Latitude":37.62575,"Longitude":-122.426,"Price":"$$","Reviews":"Best Indian food in san bruno!!!!! (We have tried other Indian places around SB but this is the best!) We always order to-go from Naan Point but never had a...\nThe food was amazing as well as portions. You can't go wrong with the free Chai either. This place was perfectly balanced not too spicy and the flavor was...\nExcellent food and service. Large menu items including vegetarian and vegan options. Yum!"},{"Name":"Ben Tre Vietnamese Homestyle Cuisine","Rating":3.9,"Address":"398 Grand Ave, South San Francisco, CA 94080","Categories":"Vietnamese, Noodles, Soup","Latitude":37.6557878294,"Longitude":-122.4122281373,"Price":"$$","Reviews":"Everything about this place is perfect. You walk in and it's slammed and loud like it should be! And you're instantly ushered to a nice booth with hot tea....\nHello everyone I just wanted to say How good this restaurant is from the sops on a cold day to their shakkin beef to die for with garlic noodles O M G...\nTHEY HAVE THE BEST BUN RIEU IVE HAD IN THE BAY. \nI ate other things here like the Garlic Noodles, 5- Spice Chicken, Bun Bo Hue but i think i fell in love..."},{"Name":"Cafe De Casa","Rating":4.4,"Address":"1165 Airport Blvd, South San Francisco, CA 94080","Categories":"Brazilian, Acai Bowls, Cafes","Latitude":37.6640655,"Longitude":-122.3998725,"Price":"$$","Reviews":"The employees here are so sweet.  Especially the girl with the red hair on the register today.  She was super patient with me and very sweet.   There is...\nI was looking forward to eating here specially because of the vegan options advertisement. So first thing is that I parked kind of in a not so perfect spot...\nThe pastries here are amazing!  Light and fluffy.  I can't believe they have gluten free items.  So delicious. \nVery friendly staff helped me pick out the..."},{"Name":"Hip Hop Bbq Shack","Rating":4.6,"Address":"223 El Camino Real, San Bruno, CA 94066","Categories":"Barbeque, Desserts, Soul Food","Latitude":37.618473,"Longitude":-122.409758,"Price":"$$","Reviews":"Had a catering order from here for my son's birthday party! Setting up the order was easy and convenient and the food was outstanding!.\nWe got the baby...\nSo this place gets 5 just on the strength of the chef who is present, personable, and just a sweet lady. Lovely big smile, anytime you see something like in...\nThis place used to be Rib Shack but now it's called Hip Hop Bbq Shack. The big sign above still has the old name and the owner, May doesn't intend to change..."},{"Name":"Keith's Chicken N Waffles","Rating":4.3,"Address":"665 El Camino Real, South San Francisco, CA 94080","Categories":"Southern, Soul Food, Chicken Wings","Latitude":37.6495716604,"Longitude":-122.4304779,"Price":"$$","Reviews":"Keith's Chicken and Waffle is the BOMB.COM!!! The chicken is favorable and incredibly delicious. The sides are also good. The yams aren't too sweet, and the...\nYum! My boyfriend and I come here whenever we crave chicken and waffles. This was our first time at the SSF location since we usually go to the Daly City...\nI was so excited to see that they opened a location in SSF. This location has seafood on the menu. My husband and I shared an order of catfish and grits and..."},{"Name":"The Night Market","Rating":3.4,"Address":"230B S Spruce Ave, South San Francisco, CA 94080","Categories":"Hong Kong Style Cafe, Dim Sum","Latitude":37.647744,"Longitude":-122.420514,"Price":"$$","Reviews":"Place is a lot smaller than expected for its namesake. A large menu showcases a plethora of Cantonese fare that you order at the kiosk that is then...\nThis place was my go-to for duck meat. Now, they have removed it in the menu.... I'm quite sad and disappointed. I really hope that they can bring duck...\nI'm surprised at the other reviews, this place is a great casual spot!\nDon't let the name fool you. This spot in indoors but decorated to look like a night..."},{"Name":"Taqueria San Bruno","Rating":4.5,"Address":"1045 San Mateo Ave, San Bruno, CA 94066","Categories":"Mexican","Latitude":37.63532,"Longitude":-122.41174,"Price":"$$","Reviews":"Went here last Saturday and back tonight. Burritos, tacos, guacamole, salsas were excellent both times. When I was sitting in the chairs by the counter,...\nSolid super burrito. It's been challenging to find good Mexican joints around our area, so I was excited to try Taqueria San Bruno, thanks to our lovely...\nTaqueria San Bruno is HANDS DOWN the best taqueria I have ever been to. Many locals will say the best taquerias are in the city, but this place is the..."},{"Name":"Han Sang","Rating":4.3,"Address":"420 Broadway, Millbrae, CA 94030","Categories":"Korean","Latitude":37.602032,"Longitude":-122.392738,"Price":"$$$","Reviews":"Came here for lunch with 5 other friends who recommended the place. We ordered the Gal Bi Jjim Combo and if you like cheese, be sure to add the cheese...\nHan Sang is one of those restaurants where I'm not sure if I like it or not because it's different from when I came during their grand opening in some ways....\nI am in love with this place! Their food is super authentic and like a warm hug to your insides on a chilly day. If you had a Korean mom or grandma, this is..."},{"Name":"Saap Thai Kitchen","Rating":4.2,"Address":"427 Linden Ave, South San Francisco, CA 94080","Categories":"Thai, Noodles, Vegetarian","Latitude":37.656856,"Longitude":-122.409723,"Price":"$$","Reviews":"I meet my girlfriend here for lunch and it is a cosy place with super sweet staff. I ordered the mixed vegetables and was given complementary portion of...\nLoved the decorations, it was very cute inside! It was small, but it wasn't busy. I will say, the service was a bit slow and lacking. The server was so nice...\nGreat time at a new restaurant. We were in the mood for Thai and decided on this restaurant. The space was a bit tight, BUT there was room for us since we..."},{"Name":"Cajun Bowl - San Bruno","Rating":4.2,"Address":"1230 El Camino Real, D, San Bruno, CA 94066","Categories":"Seafood, Cajun\/Creole, Juice Bars & Smoothies","Latitude":37.639357,"Longitude":-122.420921,"Price":"$$","Reviews":"===TL;DR===\n- Build my own: \n    - 1 lbs shrimp (head on), 1 lbs clam, sausage and potato, the ultimate sauce, medium\n    - 3 lbs shrimp (head on), 1 lbs...\nNot bad, but not the best! \nService: very nice and attentive \nCleanliness: hmm, I saw a medium size bug on the floor. \nFood: average \nGrilled Oysters:...\nThis place gets the job done when you don't want to travel all the way to San Jose for Boiling Crab. I've done both dine-in and takeout from here multiple..."},{"Name":"New England Lobster Market & Eatery","Rating":4.4,"Address":"824 Cowan Rd, Burlingame, CA 94010","Categories":"Seafood Markets, Seafood, Tapas\/Small Plates","Latitude":37.602687,"Longitude":-122.374733,"Price":"$$","Reviews":"This place is fantastic. In addition to lobster they have dungeoness crab when it's in season. Fresh from half moon Bay. $19.99 steamed and cracked....\nThe New England Lobster Market was the perfect place for my wife and I to get some seafood for dinner.  They are located in Burlingame by Marriott hotel,...\nThe naked lobster rolls ( with drawn butter) are delicious  ( a treat for me). My adult kids also order the shrimp bucket and oysters ( many choices and..."},{"Name":"Ichika Sushi House","Rating":4.4,"Address":"118 Old County Rd, Brisbane, CA 94005","Categories":"Japanese, Sushi Bars, Seafood","Latitude":37.6859172384,"Longitude":-122.399517133,"Price":"$$","Reviews":"Ichika is a true gem in the area. The presentation, quality and overall service is 5 stars. Not to mention that the prices are rather reasonable!\nThings...\n10\/10 - Soft shell crab ramen: For $19, the ramen was delicious with plenty of crab. I definitely recommend it! \n9\/10 - Shrimp tempura roll: Loved that...\nCame here with a friend of mine on a cold day. Ordered a chicken katsu curry for myself. My friend ordered some sashimi and a steak entree.\nThey offered..."},{"Name":"JC Bruno Restaurant","Rating":4.1,"Address":"741 San Mateo Ave, San Bruno, CA 94066","Categories":"New American, Pizza, Seafood","Latitude":37.62928,"Longitude":-122.4115768519,"Price":"$$","Reviews":"Treated myself to a delicious tasty dinner at JC Bruno! \nChef JC always deliver amazing tasty delicious food! \nJazzy classy modern ambiance! \nHidden gem...\nNice and clean place, decent but a little hasty service. The quality of the dishes and ingredients is typical of all-you-can-eat. Pricier but nothing...\nThis place is definitely a hidden gem! Honestly driving by it, you wouldn't know it's a restaurant from the outside. It's such a cute place inside,..."},{"Name":"Chico Marx","Rating":4.3,"Address":"2 Tower Pl, South San Francisco, CA 94080","Categories":"Latin American, Tapas\/Small Plates, Cocktail Bars","Latitude":37.6667949,"Longitude":-122.3972332213,"Price":"$$","Reviews":"I was in this restaurant with my parents,  we really liked everything, the atmosphere was super, the music was pleasant and not loud.  We got there in the...\nOverall 5\/5: this place is a hidden gem. I went on a Thursday around 6 and was dead. Not sure why, because this place slaps!! Do not go to the hotel...\nThis place is fairly new, it's been open for 6 months. The interior is super nice. Clean and chic. \nWhen I arrived I was greeted my Cortney, who is..."},{"Name":"Andiamo In Banca","Rating":4.2,"Address":"301 Linden Ave, South San Francisco, CA 94080","Categories":"Italian, Desserts","Latitude":37.6553519692,"Longitude":-122.41020705,"Price":"$$$","Reviews":"It doesn't look like much from the outside (well, it looks like a bank), but this restaurant has a lot to offer. It was easy to make a reservation online...\nFirst, although it doesn't look like much from outside,  the restaurant is beautiful on the inside. The tables are nicely spaced out and comfortable...\n2 mins from closing time, some lights were turned off YET the gentleman opened the door when I requested to be let in with my friend for a late night gelato..."},{"Name":"Flavas Jamaican Grill","Rating":4.2,"Address":"314 Linden Ave, South San Francisco, CA 94080","Categories":"Caribbean","Latitude":37.6557135964,"Longitude":-122.4097828136,"Price":"$$","Reviews":"I love the flavors here, everything is good.  Have had it catered for work and have had it dine-in. \nThe pork, chicken are great but defiantly try the...\nA very small place with huge flavor!  I love Caribbean Jerk and love whole fried fish which is very hard to find done dry without breading. \nI started with...\nI've passed by this place a handful of times without even realizing, but Flavas is serving some phenomenal Jamaican food that should not be passed by. \nI..."},{"Name":"Ristorante Buon Gusto","Rating":4.1,"Address":"224 Grand Ave, South San Francisco, CA 94080","Categories":"Italian, Bars","Latitude":37.655244,"Longitude":-122.409062,"Price":"$$","Reviews":"Went here for my boyfriend's parents' anniversary and we had an awesome experience! \nFood: authentic Italian food. The pasta was swimming in seafood. The...\nNice ambiance - it wasn't too loud either. Plentiful menu! Nice service.\nHouse Bread\nTheir house bread is delicious and so fresh!!\nLinguine Tutto Mare...\nHappy. Holidays \nI had the pleasure to have Dinner at Buon. Gusto and we had a GREAT DINNER \nThe place has been remodel and it looks very appealing with a..."},{"Name":"Tiny Sushi - Oh Baby","Rating":4.8,"Address":"32 Park Plaza Dr, Daly City, CA 94015","Categories":"Sushi Bars, Japanese, Vegetarian","Latitude":37.7012836,"Longitude":-122.4820049822,"Price":"$$","Reviews":"Probably the best quality sushi in Daly City. Cozy environment with very friendly staff. Would highly recommend coming here\nNice place, delicious food and kind staffs. Very small restaurant, but big on the flavor! Everything tasted amazing. Parking is on the street, as I'm not...\nOH BABY! Tiny Sushi has become a neighborhood staple and a go-to restaurant for us. We usually order on DoorDash, then pick up the food after grocery..."},{"Name":"Traverse","Rating":4.1,"Address":"800 Gateway Blvd, South San Francisco, CA 94080","Categories":"Bars, Coffee & Tea, New American","Latitude":37.660914839,"Longitude":-122.3944986251,"Price":"$$","Reviews":"In the corporate SSF land where many think of a corporate lunch as \"Foundry & Lux\" comes your best replacement option - Traverse! \nCame here on a work team...\nFor food being served as a workplace cafeteria, I give this 3.5 stars. I visited Traverse as park of an interview so my meal was comped. But, I would be...\nHidden gem in corporate america!\nIt feels like being in the office but way less crowded. Pretty empty on a Wed lunch. Most people get it to-go. Tons of..."},{"Name":"The Lighthouse","Rating":4.1,"Address":"685 Gateway Blvd, South San Francisco, CA 94080","Categories":"Breakfast & Brunch, New American, Coffee & Tea","Latitude":37.6583166,"Longitude":-122.3983421,"Price":"$$","Reviews":"The Lighthouse is one of the best study cafes I've been to!\nSEATING - very easy to find a good seat. I went on a Thursday afternoon from 2-5pm and there...\nParking is very limited, arrived around 11 am and the lot was already filled so I parked in one of the other lots across the street (not sure if that's...\nThe Lighthouse in South San Francisco offers a charming atmosphere that caters perfectly to both productivity and relaxation. Upon stepping in, I was..."},{"Name":"Kuma Nori","Rating":3.9,"Address":"1861 El Camino Real, Burlingame, CA 94010","Categories":"Japanese, Hawaiian, Tapas\/Small Plates","Latitude":37.59516,"Longitude":-122.385993,"Price":"$$","Reviews":"I've been seeing so many reels about this place and begged my friends + husband to come here, but to no avail. Thankfully my work bestie wanted to try too...\nFirst and foremost the flavors are good! We ordered the stupid tuna roll, crab pasta, hamburger steak, Katsudon and wagyu. \nWe waited an hour and half to...\nWas super excited to try this place since it's a couple blocks from our place, is from the same owners as Diamond Head General Store, and have seen multiple..."},{"Name":"E Plus Restaurant","Rating":3.8,"Address":"490 A S Airport Blvd, Ste A, South San Francisco, CA 94080","Categories":"Hong Kong Style Cafe, Asian Fusion, Chinese","Latitude":37.6401150461,"Longitude":-122.4023185,"Price":"$$","Reviews":"The price is worth the food here，and taste really good. i will keep ordering food togo from here.\nOrdered food but no food.\nPlaced my online order with confirmation. When I arrived, the door was locked with a sign indicating no dine-in but call for order...\nThis is the first time I've ordered from them and it's a great experience. \nI ordered the baked pork chop with rice. The pork chop is very soft and tender,..."},{"Name":"K. Grill & Tofu House","Rating":4.1,"Address":"617 San Mateo Ave, San Bruno, CA 94066","Categories":"Korean","Latitude":37.62681,"Longitude":-122.41148,"Price":"$$","Reviews":"K Grill and Tofu House in San Bruno truly delivered an exceptional dining experience. My recent takeout order of bibimbap exceeded expectations, not just...\nThis place feels like home. Both my husband and I live far away from our families. Whenever we want home food, we come here. Whenever we have something to...\nThis place is one of my spots for delicious bibimbap and soondubu! The soondubu hits the spot on a cold winter's night and warms your soul. However, my..."},{"Name":"Dumpling Empire","Rating":3.8,"Address":"216 Cypress Ave, South San Francisco, CA 94080","Categories":"Chinese","Latitude":37.65451,"Longitude":-122.4085747,"Price":"$$","Reviews":"Such a hidden gem. You know the food is going to be good when they serve you with take out boxes and lids. \n\nCame here countless times last year. My default...\nI can't believe I have not rated or reviewed this place yet! As my absolute regular go to whether it's for a hot meal or frozen dumplings to go, Dumpling...\nThis place is amazing ! The dumplings are incredibly delicious and diverse.\n\nA huge surprise is their fried rice and chow mein for those wanting something..."},{"Name":"7 Mile House","Rating":4.2,"Address":"2800 Bayshore Blvd, Brisbane, CA 94005","Categories":"Sports Bars, American, Filipino","Latitude":37.704305,"Longitude":-122.407456,"Price":"$$","Reviews":"Fantastic burgers filipino dishes sports bar great service to go foods lots of parking\n7 Mile House has traditional Filipino dishes. On Sundays, they serve brunch items. It's a great place for Bay Area sports lovers since they have a spacious...\nHell yah I love this spot! I enjoy eating here when I come by. It's usually after a friend hits me up or a team dinner. Love the Filipino food, the drinks..."},{"Name":"Viet Time","Rating":3.9,"Address":"1212 El Camino Real, Unit F, San Bruno, CA 94066","Categories":"Vietnamese, Noodles, Sandwiches","Latitude":37.63891,"Longitude":-122.420733,"Price":"$$","Reviews":"Came by on a Saturday afternoon for a snack! Cute indoor space, not a ton of seating but cozy. Super nice staff. \n\n+ grilled pork bahn mi: opted for...\nNew place across from Tanforan-nice clean and friendly service! I loved how it doesn't smell like dirty dish rags! Tried the cold cuts and chicken banh mi,...\nFairly new place, 3-months open, Vietnamese eatery in the mall by Lowe's in San Bruno. Clean, modern, bright spacious welcoming interior with a nicely..."},{"Name":"Pho de Nguyen","Rating":4.3,"Address":"586-A San Mateo Ave, San Bruno, CA 94066","Categories":"Vietnamese","Latitude":37.6261563,"Longitude":-122.4111054,"Price":"$$","Reviews":"The best pho in the Peninsula. The portions are huge and the broth is so tasteful, and not too salty. The menu is extensive. The service is great. Everyone...\nFrom my very first encounter with Pho de Nguyen's catering at a workplace lunch, I knew I had stumbled upon something special. Chef Phong, the heart and...\nI came in on a Saturday night, and luckily there was no wait. The waiter directed us to a table in the front, but it was dirty. The previous diner's chili..."},{"Name":"Boiling BeiJing","Rating":4.1,"Address":"649 San Mateo Ave, San Bruno, CA 94066","Categories":"Chinese, Hot Pot","Latitude":37.627416,"Longitude":-122.411551,"Price":"$$","Reviews":"I am so glad to have finally tried their famous Peking duck, as it was definitely the best Peking duck I have ever tasted.  I never liked Peking duck skin...\nI ALWAYS come here for peking duck. Birthdays, chinese new year, anniversary, you call it. I'm surprised I haven't left reviewed yet! \nBeing here so many...\nYou must scan the QR code on the table to see the menu.  (There is no hard copy menu - If you don't have a phone to scan the code or unable to scan and see..."},{"Name":"Burma Silver Star","Rating":4.6,"Address":"6318 Mission St, Daly City, CA 94014","Categories":"Burmese","Latitude":37.7057503551,"Longitude":-122.4621623105,"Price":"$$","Reviews":"Wow, I've been to a lot of Burmese restaurants in the bay area already (including some with the most numbers of reviews in the area), but this turned out to...\nI found this restaurant on yelp.  Thank you, Yelp!  I would never have gone here but I happened to be near Westlake and needed some food.  The service was...\nOk went back Sunday to get my curry chicken with potatoes. This time was perfect tasted better than most Burmese restaurants I go to. Was greeted with the..."},{"Name":"Ichika Izakaya","Rating":4.4,"Address":"851 Cherry Ave, Ste 34, San Bruno , CA 94066","Categories":"Sushi Bars, Izakaya","Latitude":37.6256980611,"Longitude":-122.4265950021,"Price":"$$$","Reviews":"Two omakase dinners in 2 weeks...  Lucky me!  We were originally planning to mix skewer orders with sushi\/sashimi, but with my son visiting for the...\nGreat service and quality food!\n\nI appreciate that there's plenty of parking. Highly recommend, our new favorite spot.\nWe just found this place and wished we had known about it sooner. This is the best Izakaya in the area hands down. We stopped in for a quick meal during a..."},{"Name":"Love Burn","Rating":4.3,"Address":"130 Northwood Dr, Hometown Bowl, South San Francisco, CA 94080","Categories":"Chicken Shop, Sandwiches","Latitude":37.643,"Longitude":-122.426178,"Price":"$$","Reviews":"Got the hot chicken sandwich at a spice level of zero. Absolutely delicious. First impression was that the chicken was massive; it stuck so far out of the...\nI got the hot chicken quarters with seasoned fries and my dining partner got the hot chicken sandwich. \n\nWhat a great place! The feeling is really casual...\nOrdered food from Love Burn wow bowling with some friends. Love Burn is located inside Hometown Bowl And can be ordered a couple different different ways,..."},{"Name":"Foundry & Lux","Rating":3.7,"Address":"151 Oyster Point Blvd, South San Francisco, CA 94080","Categories":"New American, Lounges, Venues & Event Spaces","Latitude":37.6636533571,"Longitude":-122.3944006611,"Price":"$$","Reviews":"Fun venue with exceptional food, attentive staff, and abundant free parking at The Cove's parking structure, all while being centrally located to...\nWe ordered a few items from the Happy Hour menu! I can't wait to go back and try the pizza!! The service was amazing and the atmosphere was esthetically...\nObsessed with the cafe's almond croissant! That's all I really wanted to write about lol. The ambiance of the cafe is also very cozy and relaxing. The food..."},{"Name":"Cocina Milonga","Rating":4.8,"Address":"308 Alida Way, South San Francisco, CA 94080","Categories":"Argentine, Food Stands, Empanadas","Latitude":37.6431947,"Longitude":-122.4264521,"Price":"$","Reviews":"This cafe is a fantastic spot to grab a meal. \n\nThe cashier provides excellent service, the place is spotless, and the food is delicious. If you're in the...\nThe empanadas way too good\nService it's really great they treat you like family and always give good tips about the best empanadas \nI enjoy goin there  to...\nBest chicken empanadas to bring home! Love to buy them frozen. They make  great last minute dinner or lunch, just pop them in the oven with an egg wash, and..."},{"Name":"Sisterita","Rating":4.7,"Address":"669 Commercial St, San Francisco, CA 94111","Categories":"Breakfast & Brunch, New American, Thai","Latitude":37.793966,"Longitude":-122.404206,"Price":"$$","Reviews":"Food was wonderful and service was amazing. Definitely unsuspecting from the outside but the ambiance and decor were so pleasing. The Alcatraz escape was...\nMy favorite brunch spot in the city! My choice of menu items, #1 being my favorite\n1. The alcatraz escape is a unique blend of cohesive flavors that is so...\nWhile I enjoy frequent dining out in The City, either solo, or with hubby and\/or friends, it's been some time since I've been moved to write a..."},{"Name":"Chong Qing Xiao Mian","Rating":4.1,"Address":"915 Kearny St, San Francisco, CA 94133","Categories":"Noodles, Szechuan","Latitude":37.796386,"Longitude":-122.4053411,"Price":"$$","Reviews":"Chong Qing Xiao Mian is the ultimate place for some savory, mouth-watering, comfort noodles and comfort soup. \nThat spicy beef noodle soup hits just right....\nDelicious, affordable, no frills option for Chinese noodles - would definitely recommend. We ordered the chicken w\/ explosive chili noodle soup ($13.95) and...\nI thought the food was tasty but nothing particularly impressive, though portions are very generous for the price.\nWe tried:\n- sweet and sour spare ribs:..."},{"Name":"Sam Wo Restaurant","Rating":3.8,"Address":"713 Clay St, San Francisco, CA 94108","Categories":"Chinese","Latitude":37.794254303,"Longitude":-122.4051132202,"Price":"$$","Reviews":"Visiting San Fran for the first time. Very good restaurant, good portions as well. Definitely \nRecommend\nWe had to go to this iconic establishment at least once. My husband had an event in the city during APEC and the streets were very blocked and a lot of...\nA group of friends and I were looking for a lunch spot in Chinatown and had heard of this place through the good reviews, so we decided to check it out. The..."},{"Name":"G&Y Bakery Restaurant","Rating":4.3,"Address":"881 Clay St, San Francisco, CA 94108","Categories":"Coffee & Tea, Chinese","Latitude":37.7939394806,"Longitude":-122.4076073617,"Price":"$$","Reviews":"Hong Kong specialty cafe here! Bitter melon with pork ribs clay pot is a specialty that one can't find a lot in other places! It was so homely! Their baked...\nI came across G&Y while I was searching for nearby Chinese restaurants that were open late on a Sunday evening. This elimated a lot of the Chinese...\nFood: 3\/5\nFor someone who has quite deep Cantonese roots, this food was honestly meh. In the 21st century terms.... the food was honestly mid. While I had..."},{"Name":"Good Mong Kok Bakery","Rating":4.1,"Address":"1039 Stockton St, San Francisco, CA 94108","Categories":"Bakeries, Dim Sum, Cantonese","Latitude":37.795458484,"Longitude":-122.408358365,"Price":"$","Reviews":"If you love dim sum and you're in Chinatown, you have to check out Good Mong Kok Bakery. The three best words to describe this place: Cheap, delicious, and...\nYou probably won't get friendly service at Good Mong Kok Bakery, but you will get damn good dim sum (if it's even in stock).\nI visited the classic Chinese...\nThis place had a long line outside around 11:30am on a Thursday morning.  About 20 min of waiting, we were able to order but no more baked chai sui buns! We..."},{"Name":"Hong Kong Clay Pot Restaurant","Rating":3.8,"Address":"960 Grant Ave, San Francisco, CA 94108","Categories":"Cantonese, Seafood, Hong Kong Style Cafe","Latitude":37.79588,"Longitude":-122.40649,"Price":"$$","Reviews":"Drove from Fairfield to San Francisco to look for a good time and something decent to eat. Last time we were in town we had a terrible experience. But this...\nA casual Chinese and authentic spot. This place won't blow you away, but it makes food that will satisfy your Guangdong cravings. \nI'm not the biggest fan...\nFound this goldmine through Yelp reviews. So hopefully mine will help you find it too. Not easy to find. I walked past it twice. Look for stairs going up,..."},{"Name":"Hon's Wun-Tun House","Rating":4.0,"Address":"733 Washington St, San Francisco, CA 94108","Categories":"Cantonese, Noodles","Latitude":37.7951258981,"Longitude":-122.4060465638,"Price":"$$","Reviews":"The wonton is even better now! \nI dunno what happened but their ingredients and quality went up by a mile since I made it last month. The wonton stuff has...\nMore of the restaurant and sit down with variety style compared to the original Hon Wun Tun's shop down the block!  There are more dishes offered here. \nI...\nAfter trying many different spots, this is the best place in SF for wonton soup.\nWe started with the green onion pancake.  Its fluffy and tasty.\nThen we..."},{"Name":"Delicious Dim Sum","Rating":4.0,"Address":"752 Jackson St, San Francisco, CA 94133","Categories":"Dim Sum, Cantonese","Latitude":37.796051,"Longitude":-122.4076004,"Price":"$","Reviews":"The best place so far, is really good, my favorite place in chinatown the Shangai it is my favorite\nOne of the many placed you van get authentic dim sum!\nHere, you'll find basically a hole in the wall. They have always said that hole-in-the-wall...\nA wonderful and beautiful day in SF.  We stopped by to pick up some food for the crabbing trip\nWe got char shu steamed baos, chive dumplings, and a variety..."},{"Name":"Hinodeya Downtown","Rating":4.3,"Address":"680 Clay St, San Francisco, CA 94111","Categories":"Ramen, Japanese Curry","Latitude":37.794597,"Longitude":-122.404432,"Price":"$$","Reviews":"The food and ambience were good. We ordered Hinodeya Ramen( which was great) and vegan ramen with the non creamy broth. I would have preferred if the tofu...\nThe superior Hinodeya location in my opinion- quick service, welcoming interior, convenient location and of course, delicious food. \nI ordered the ultimate...\nThe service here is good but the ramen and mochi waffles were horrendous.\nI got the house ramen and the broth was very bland and the meat wasn't tender...."},{"Name":"Sohunan","Rating":4.7,"Address":"674 Sacramento St, San Francisco, CA 94111","Categories":"Chinese","Latitude":37.793767,"Longitude":-122.404158,"Price":"$$","Reviews":"Tasty AF Mongolian beef \nSee photo!!\nSpicy. Savory proper temperature taste and texture \nHungry hangry at 2:30pm\nTotally hit the spot!\njYW recommends\nI recently had an unforgettable dining experience at Sohunan, an authentic Chinese restaurant family-owned for generations. I savored their delectable...\nA new restaurant that only opened for 9 months. \nOffer very reasonably priced lunch (over rice) for people who work in Downtown and Chinatown. \nMy friend..."},{"Name":"Ar Har Ya","Rating":4.9,"Address":"357 Kearny St, San Francisco, CA 94108","Categories":"Burmese","Latitude":37.7914771504,"Longitude":-122.4043955574,"Price":"$$","Reviews":"I decided to have a sit down dinner here and the food was delicious yet quick. Perfect place for takeout and dine in. I met the owner and her husband and...\nDelicious food, quick\/friendly service, and the perfect spice level for the fish curry.\nFood is delicious and the service was very friendly. I had the moo hing nga, and would have it again any day."},{"Name":"Nomu Skewers","Rating":4.3,"Address":"580 Bush St, Ste 101, San Francisco, CA 94108","Categories":"Izakaya, Sushi Bars","Latitude":37.79061,"Longitude":-122.40672,"Price":"$$","Reviews":"Thank you so much for taking care of us and giving good service . They also provided us with such a great dish which they were about to put it on the menu ,...\nSuper delicious!!!  We were so very pleasantly surprised to have found this place so close to where we were staying (literally next door). Everything was...\nI had my delicious Japanese food there. \nTruly like the location and atmosphere\nClean and beautiful great staff, and of course my favorite wine was there"},{"Name":"Sotto Mare","Rating":4.3,"Address":"552 Green St, San Francisco, CA 94133","Categories":"Seafood, Italian, Bars","Latitude":37.79979,"Longitude":-122.40834,"Price":"$$","Reviews":"My favorite seafood place\nOysters, cioppino, \nGreat brunch, lunch\nMy belly is happy\nBest damn cioppino in town \nComing here for over 20 years\nHappy valentines\nCame here about a month ago when it was raining.\nLet me just start off by saying order a ride share because just like the rest of San Francisco forget...\nWe have been on a hunt for that \"perfectly\" seasoned steam mussels ever since our favorite spot at Little Italy in San Diego removed it from their menu, and..."},{"Name":"High Horse","Rating":4.4,"Address":"582 Washington St, San Francisco, CA 94111","Categories":"New American, Cocktail Bars","Latitude":37.79573,"Longitude":-122.40284,"Price":"$$","Reviews":"We came here after our dinner just for a few drinks. The bar was so historical that used to be a seawall way back 1960's I think?? \nOur bartender David was...\nBeautiful interior and pretty good liquor selection for you whiskey nuts, i believe I saw a bottle of old fitz up there. \nWe had the C team bartender...\nA great place for drinks  and to mingle with friends .\nIt's a great place for meeting up after work and sitting at the bar and having a snack."},{"Name":"New Fortune Restaurant","Rating":4.2,"Address":"815 Stockton St, San Francisco, CA 94108","Categories":"Chinese","Latitude":37.79335,"Longitude":-122.40801,"Price":"$","Reviews":"I get delivery from here all the time. It's my favorite Chinese spot. The food is delicious, cheap and well portioned. It's well seasoned and flavorful, not...\n===TL;DR===\n- Curry pigskin fish ball \n- Shredded pork w\/ salted vegetables soup - rice noodles\n- Dry vegetable with salty pork ribs porridge...\nAnother no frills Chinatown restaurant that more than makes up for it with amazing food. We were wrapping up our day and heading back to the airport but..."},{"Name":"Bocconcino","Rating":4.8,"Address":"516 Green St, San Francisco, CA 94133","Categories":"Italian","Latitude":37.79982,"Longitude":-122.40783,"Price":"$$","Reviews":"This is an absolutely amazing restaurant.   Every dish was prepared exquisitely.  Great staff and ambiance.   I very very highly recommend this restaurant....\nWith the New Year upon us, it was time to try something new so this was the setting for my midweek lunch.  Entering, I found the dining room empty and there...\nNote there is no website for this place, so no official menu, you need to look at menu photos on Yelp - come on, it's 2024, you don't have a nephew that can..."},{"Name":"Begoni Bistro","Rating":3.9,"Address":"615 Jackson St, San Francisco, CA 94133","Categories":"Dim Sum, Cantonese, Wine Bars","Latitude":37.7960017591,"Longitude":-122.4055494368,"Price":"$$","Reviews":"i love dim sum and wanted to try a new spot. this place didn't disappoint. selected this place bc a lot of people\nwere eating here when we walked by. i was...\nOur experience at Begoni Bistro was a mix of hits and misses. After a brief 15-minute wait, we were seated at the bar, which turned out to be a cool and...\nFirst things first - the wait! They recommend you get there around 30 min - 1 hour ahead of time to put your name down on the clipboard. We waited maybe..."},{"Name":"Fusion Dumpling","Rating":4.1,"Address":"650 Jackson St, San Francisco, CA 94133","Categories":"Dim Sum, Noodles, Hot Pot","Latitude":37.79636,"Longitude":-122.40611,"Price":"$$","Reviews":"Christmas Eve- Reservations needed! \ngreat selection of dumplings, baos and squid ink octopus; olong tea, vegetarian spring rolls, Peking duck ... so many...\nHidden gem alert!!\nThere is a garage parking two blocks away on pacific and grant in case you need to find parking. \nSeating was plentiful and the staffs...\n3.5 stars.\nIt was good! For the price point, I don't think I would come again.\nStar: the duck was great! juicy and crispy. highly recommend if you're here..."},{"Name":"Trestle","Rating":4.4,"Address":"531 Jackson St, San Francisco, CA 94133","Categories":"New American, Desserts","Latitude":37.7961956701,"Longitude":-122.4045415706,"Price":"$$$","Reviews":"Really digging the overall vibe of this place. It's very much a hopping neighborhood kind of joint, was packed full at every table during our dinner....\nEh... very nice place in terms of decor and service. Our server, Matthew was beyond excellent. He knew the menu. Well, he was very helpful, attentive, and...\nI've posted pictures with my review but ignore those because this places menu is always changing! Constantly they are updating a different part of their..."},{"Name":"Z & Y Restaurant","Rating":3.6,"Address":"655 Jackson St, San Francisco, CA 94133","Categories":"Chinese, Seafood, Soup","Latitude":37.796,"Longitude":-122.406,"Price":"$$","Reviews":"Great food, excellent service. Extremely fast and attentive waitresses. For CNY, they accommodated our group of 14 which exceed their max capacity and I...\nCame here for dinner right after the Super Bowl and it was relatively busy! Ordering was quick and all the dishes came out really fast too. A few of the...\nHaving been listed on the Michelin guide every year since 2012 and also visited by President Obama, this place has been pretty hyped up as one of the best..."},{"Name":"Golden Star Vietnamese Restaurant","Rating":3.8,"Address":"11 Walter U Lum Pl, San Francisco, CA 94108","Categories":"Vietnamese, Noodles, Soup","Latitude":37.7945505828,"Longitude":-122.4057425559,"Price":"$$","Reviews":"This place has been around for years. It's located on a side street across the park in Chinatown. Every time I've been here, there's a short line outside or...\nYou can't ask for better food at a great price .  Fresh ingredients daily, you'll get your food within 5 minutes of ordering. .       35 years in business...\nThis is a no frills straight to the point Vietnamese Restaurant. We went there for lunch and the place was packed. \nIt's a bit loud and you may have to..."},{"Name":"City View Restaurant","Rating":3.8,"Address":"33 Walter U Lum Pl, San Francisco, CA 94108","Categories":"Dim Sum, Cantonese","Latitude":37.79485,"Longitude":-122.40585,"Price":"$$","Reviews":"Shrimp Dumplings: These delicate dumplings burst with flavor, and the shrimp filling is perfectly tender.\nShanghai Siu Lung Bao: The soup-filled dumplings...\nBeen enjoying them since I moved to SF in 2001.  Went to the new location 2 weeks ago and frankly I think the food was even better than at the old location....\nSuch a city tourist dim sum restaurant. However, since the restaurant is in a prime location, the view of the city was very pretty. The interior is very..."},{"Name":"Betty Lou's Seafood and Grill","Rating":4.5,"Address":"318 Columbus Ave, San Francisco, CA 94133","Categories":"Seafood, Steakhouses, Bars","Latitude":37.79825,"Longitude":-122.407014,"Price":"$$","Reviews":"Really awesome meal today at Betty Lou's! I had my second cioppino ever, and this one far exceeded the first. There was so much good seafood in here,...\nThe waiter asked me: \"How's the food?\"\nI said: \"First I want to let you know that your service is good, I have no complains about it. But the food was...\nDuring the Thanksgiving season this year (2023) I chose to work. I worked so much that I had decided that since it would only be my father and ... I decided..."},{"Name":"New Lun Ting Cafe","Rating":4.0,"Address":"670 Jackson St, San Francisco, CA 94133","Categories":"Chinese, American, Asian Fusion","Latitude":37.7961166251,"Longitude":-122.4062607067,"Price":"$$","Reviews":"Food was really good and super worth the price given the taste, quality, and serving proportion! The cooking style was authentic, simple, yet so good!!!!!!...\nOld Chinatown legacy business serving American style meals to the local Chinatown residents. \nBeen coming here since a kid.  Total comfort food!\nIf some influencer got you checking out this place, it's going to leave you disappointed.\nNew Lun Ting has been around forever. Ownership and cook are not..."},{"Name":"Taishan Cuisine","Rating":4.0,"Address":"781 Broadway, San Francisco, CA 94133","Categories":"Noodles, Hot Pot, Cantonese","Latitude":37.7973103413,"Longitude":-122.4098765105,"Price":"$$","Reviews":"I had never gone into this spot before, but I was very pleasantly surprised! The inside is very cozy and enjoyable vibes, and the food was flavorful. Plus...\nA complete hole in the wall, mom pop sort of place. It seems the people here come knowing exactly what to order. We didn't but still enjoyed our time!\nThe...\nHad the fried beef fried noodle. The meat was extremely tender and flavorful. The sauce was perfectly seasoned in the noodles. The only weakness is the..."},{"Name":"Spork Restaurant","Rating":4.7,"Address":"631 Broadway, San Francisco, CA 94133","Categories":"Asian Fusion, Breakfast & Brunch","Latitude":37.79752,"Longitude":-122.40748,"Price":"$$","Reviews":"After our brunch plans fell through because the place we made a res at was now permanently closed, I searched for something nearby and this place came up!...\nThis score is more around a 3.5. We walked to this place around 10am on a Sunday and it was not super full, maybe 4-5 other parties and plenty of room for...\nCame for brunch on a Saturday around 12 pm. It wasn't too busy because it was raining so we were seated right away. Service was great - staff were super..."},{"Name":"Hotpot Champ","Rating":3.9,"Address":"801 Kearny St, San Francisco, CA 94108","Categories":"Hot Pot","Latitude":37.795449,"Longitude":-122.405172,"Price":"$$","Reviews":"The food quality of this restaurant is so great. For me, I'd like to say that this is the best tomato soup base I've ever had in SF. The ambiance and...\nThe environment is very comfortable, the service is excellent, and the staff are knowledgeable about the menu, always willing to offer recommendations. Both...\nIt's actually WHEELY good here, and I'm not saying this cuz of the ship nor the ferris wheel of meats. Service and food quality on point. \n.:: FOOD ::...."},{"Name":"Hing Lung Company aka Go Duck Yourself","Rating":4.5,"Address":"1261 Stockton St, San Francisco, CA 94133","Categories":"Barbeque, Cantonese","Latitude":37.7974102199,"Longitude":-122.4087096112,"Price":"$$","Reviews":"Hing Lung Company aka Go Duck Yourself is an absolute gem in the world of Cantonese cuisine! From the moment I stepped in, the atmosphere was warm and...\nThe food, even when delivered, looks EXACTLY like it does in the pictures, and wrapped in an extra layer to maintain warmth.\nCrispy skin lovers, unite!...\nTLDR: delicious roast duck and bbq pork, and they accept credit cards!\n--\nFor lazy days when I don't want to cook dinner and craving some delicious roast..."},{"Name":"Il Casaro Pizzeria & Mozzarella Bar - North Beach","Rating":4.3,"Address":"348 Columbus Ave, San Francisco, CA 94133","Categories":"Italian, Pizza","Latitude":37.79852,"Longitude":-122.40739,"Price":"$$","Reviews":"This spot has great variety of pizzas! Been here recently and I happy to leave a review with a good experience that I had. The pastas was so creamy and...\nMy kind of pizza! (My kind of pizza ALWAYS baked in a wood fired oven). \nWhat is the mark of a properly made Neapolitan pizza crust? \nThe best Neapolitan...\nSuch a good lunch spot! We were in a literal rush to grab food and just randomly picked this place based off reviews and GPS there! \nCame in on a Tuesday..."},{"Name":"Wayfare Tavern","Rating":3.9,"Address":"558 Sacramento St, San Francisco, CA 94111","Categories":"American","Latitude":37.794169,"Longitude":-122.402359,"Price":"$$$","Reviews":"ORDERS: Butter Lettuce Salad | Gnocchi & Butternut Squash | Cioppino Special \nI still adore the Wayfare Tavern!!! We had such a great time & really great...\nThis resturant is 3 levels. It had quite the charm with adorning animal head pieces around the walls. The service was kind of unusual because they would not...\nI know I'm late to the party when it comes to reviewing Wayfare Tavern.\nI mean, what else is there to say that hasn't already been said?\nBut I felt I had to..."},{"Name":"Kingbob","Rating":4.7,"Address":"645 Clay St, San Francisco, CA 94111","Categories":"Korean","Latitude":37.79442,"Longitude":-122.40386,"Price":"$","Reviews":"Authentic Korean food! The staffs are nice and friendly. Also, this is deaf friendly well. Highly recommended you to try this!\nMy first time trying kimbap and it did not disappoint. The bulgogi kimbap and the ganjang korean fried chicken are my favorite. Clean place and fast service...\nBest Korean fast food in the area! Very authentic and good service. My personal favorite is the kimchi fried rice and garlic soy fried chicken. By far a..."},{"Name":"Osmanthus Dim Sum Lounge","Rating":4.4,"Address":"504 Broadway, San Francisco, CA 94133","Categories":"Cocktail Bars, Dim Sum","Latitude":37.79815,"Longitude":-122.405662,"Price":"$$","Reviews":"i came here with my team (8 people) on a wednesday around 12:30 pm and we were seated immediately. we sat at a long table instead of a circular table with a...\nThis is a reliable and convenient restaurant for those of you who likes dim sum with modern decor and some non traditional items.\nA pretty upscale dim sum...\nWe have been here twice, both times the food was yummy.  We never got the same thing, either.  \nParking was easy, though navigating there can be an issue..."},{"Name":"The Spicy Shrimp","Rating":3.5,"Address":"150 Waverly Pl, San Francisco, CA 94108","Categories":"Seafood, Cantonese","Latitude":37.7948376395,"Longitude":-122.4068194906,"Price":"$$","Reviews":"This is a good spot to eat at since they open at 8am and most restaurants don't open until 10-11. They offer their whole menu not just certain items from...\nI was lured in when I saw a video of these rice noodles on Instagram. \nThis spot was packed with locals during weekday lunch. I will say it could be a...\nParking: The restaurant is located at the heart of Chinatown SF, so parking is basically nonexistent. Do yourself a favor and park at the under ground..."},{"Name":"The Third Floor","Rating":4.1,"Address":"433 Clay St, San Francisco, CA 94111","Categories":"New American, Cocktail Bars, Breakfast & Brunch","Latitude":37.7947,"Longitude":-122.40067,"Price":"$$","Reviews":"The weekend before the Lenten season is one of indulgence.  All the way up to Fat Tuesday if one can make it that long.  I can't make it that long.  After...\nLocated in a hotel, more of a lounge vibe than an actual restaurant. Valet is available at your own cost, $25 an hour. Friendly and welcoming staff....\nSuch a cute restaurant\/bar lounge in downtown San Francisco. We made reservations for dinner and had the option to sit in the lobby or back. The back was..."},{"Name":"Maison Nico","Rating":4.4,"Address":"710 Montgomery St, San Francisco, CA 94111","Categories":"Bakeries, Coffee & Tea, French","Latitude":37.79579,"Longitude":-122.40328,"Price":"$$","Reviews":"My favorite croissants in SF! They are light and flaky and I love the different seasonal flavors!! The chestnut was subtle but delicious but my all time...\nBeautifully presented pastries with unique flavors and textures. The croissants are flakey and light & the coffee is incredibly smooth. \nI've had the lemon...\nMaison Nico is like stepping into a cozy French haven. The place feels like a dreamy Parisian café with its pastries, decor, and soft pink seats and tables...."},{"Name":"Mister Jiu's","Rating":3.7,"Address":"28 Waverly Pl, San Francisco, CA 94108","Categories":"Chinese","Latitude":37.7937724,"Longitude":-122.4067594,"Price":"$$$$","Reviews":"Honestly, I thought the hype was well worth this restaurant. While we had two servers which made service awkward at times, we enjoyed the lively environment...\nHigh end Chinese restaurant in SF Chinatown that has a New York interior and music vibe. Our server Claire provided an excellent service! We celebrated our...\nHaving lived in San Francisco for well over a decade and having had many chef friends including one who worked at Mister Jiu's (long before I could ever..."},{"Name":"The Italian Homemade Company","Rating":4.3,"Address":"716 Columbus Ave, San Francisco, CA 94133","Categories":"Italian, Pasta Shops, International Grocery","Latitude":37.801752,"Longitude":-122.411851,"Price":"$$","Reviews":"The place is cute, very nice personal and the food was pretty good!! 10\/10 you need try lasagna!\nA small no-nonsense, no-frills Italian restaurant where you pick your pasta, your sauce, and that's about it, you get your meal served on a paper plate and...\nVery cute and small handmade pasta place! \nOrdered the veggie ravioli with marinara sauce and the oven baked tomato salad. The pasta serving was on the..."},{"Name":"Dim Sum Bistro","Rating":4.4,"Address":"675 Bdwy, San Francisco, CA 94133","Categories":"Dim Sum, Cantonese","Latitude":37.7975739215,"Longitude":-122.4081650199,"Price":"$$","Reviews":"My husband and I love a good dim sum spot and Dim Sum Bistro is definitely one of our favorites in Chinatown. Whenever the craving kicks in, this is usually...\nTl;dr - take-out dim sum spot that rivals GMKB, maybe even outshines it. Personal favs = char siu bao, har gow, shrimp rice rolls, and turnip cake. Be...\nI've been visiting Dim Sum Bistro for a light snack the past two days and I am seriously impressed.\nFirst, I tried the 69. Scallion Pan Cake (~6 pieces for..."},{"Name":"Caffe Macaroni","Rating":4.4,"Address":"59 Columbus Ave, San Francisco, CA 94133","Categories":"Italian","Latitude":37.7961197,"Longitude":-122.4043732,"Price":"$$","Reviews":"This place is great. Felt like an Italian grandma was cooking for me (which isn't far from the truth!)\nSquid ink seafood pasta (5\/5)\nPanna cotta...\nWe were out for an overdue date night and decided to have dinner here after having tried it over 10 years ago. We remembered it being quaint and...\nWhat an awesome place - tiny as all get out so get there right at open or sit outside!\nFood was amazing and the owner waits the tables .\nI had the Ceasers..."},{"Name":"Jinshan Cafe","Rating":4.5,"Address":"781 Sacramento St, San Francisco, CA 94108","Categories":"Cafes, Coffee & Tea","Latitude":37.7933503295,"Longitude":-122.4058499,"Price":"$$","Reviews":"Nice spontaneous find! Black sesame cream latte was super yummy. Full of flavor. The matcha was made the traditional way with a whisk before going into the...\n4.5 stars! This is a new addition to the boba scene in SF's Chinatown. They serve several drinks with ingredients like osmanthus, ube, matcha, taro, black..."},{"Name":"Dol Ho Restaurant","Rating":3.9,"Address":"808 Pacific Ave, San Francisco, CA 94133","Categories":"Dim Sum, Cantonese","Latitude":37.79675,"Longitude":-122.40879,"Price":"$","Reviews":"Still our favorite to go spot for beef balls and black bean spare ribs. When you're tight on time, their to-go is items with rice is a solid choice. Me and...\nNot the best, but the cheapest and you get what you pay for. If you want a filling okay lunch this is the place. Quality has definitely dropped in the past...\nI wanted to go somewhere that has a sit down. Us East coast ppl usually likes to go early. Sadly San Fran opens up at 11am which falls in line for brunch...."},{"Name":"Lucky Creation Vegetarian Restaurant","Rating":3.9,"Address":"854 Washington St, San Francisco, CA 94108","Categories":"Vegetarian, Chinese, Vegan","Latitude":37.7951059659,"Longitude":-122.4073785969,"Price":"$$","Reviews":"Great genuinely friendly attentive service and wait staff. Three words best describe this food: FAB U LOUS. who needs garlic and onions in every dish? I...\nAs a meat eater, I usually would not go for an all vegetarian restaurant as my first choice but I was taken aback by how yummy everything was. \nI had gone...\nI always appreciate a fully vegan restaurant. This place has a lot of really interesting and unique mock meats (goose!) and lots of tofu options. \nI got..."},{"Name":"Nob Hill Cafe","Rating":4.0,"Address":"1152 Taylor St, San Francisco, CA 94108","Categories":"Italian, Pizza","Latitude":37.7932599,"Longitude":-122.41262,"Price":"$$","Reviews":"Amazing! Happened to be staying a couple blocks away on a business trip and decided to come check this place out. Was worried that I wasn't going to get a...\nA cozy and romantic little cafe in the beautiful neighbourhood of Nob Hill. The dining room is very small, but they also offer a patio space. It's a popular...\n-linguine allá vongole (good but lower on the flavor side, good with a white wine)\n- penne bettola (so much flavor, I preferred this one)\n- good place to..."},{"Name":"Tín on Kearny","Rating":4.7,"Address":"356 Kearny St, San Francisco, CA 94108","Categories":"Vietnamese, Sandwiches, Noodles","Latitude":37.79151,"Longitude":-122.40395,"Price":"$$","Reviews":"What a lucky find for me in FiDi. I initially was in disbelief that a decent banh mi would be available outside of the Tenderloin or Little Saigon in the...\nI just had their 5 spice Chicken Bahn Mi, and it hit the spot.\n\nThe portions are generous, the chicken was crispy and still juicy, very well seasoned. The...\nTwo thing to praise about Tin:\n\n1. the menu is smart, the food is delicious. it features different types of protein that can be made in a banh mi, noodle..."},{"Name":"Hunan House","Rating":3.5,"Address":"826 Washington St, San Francisco, CA 94108","Categories":"Chinese","Latitude":37.79527,"Longitude":-122.40701,"Price":"$$","Reviews":"I'm so glad I found Hunan's House lunch specials. For $9.50 plus tax you get a huge entrée with rice, soup, hot milk tea or iced lemon tea. You can not beat...\nAbsolutely unbeatable week day lunch specials. You get a delicious entree with rice, lemon tea, AND soup... for less than $10! I hope Hunan House stays open...\nI'm always looking for good eats. Today, I decided to try Hunan House located in the heart of SF Chinatown on Washington and Grant.  \n\nI wasn't expecting..."},{"Name":"Spicy King","Rating":3.6,"Address":"65 Waverly Pl, San Francisco, CA 94108","Categories":"Szechuan, Hot Pot, Noodles","Latitude":37.7939858,"Longitude":-122.4068603,"Price":"$$","Reviews":"Best won ton soup. Sent my taste buds on a carousel of well-seasoned, aromatic bliss. Now the iced tea? WOOOOO 6 stars if it were possible\nA small hidden sichuan food spot in china town, my friends discovered this gem in in summer of 2021. The food is authentic, flavourful and what I love about...\nI've been coming here for years but haven't been here recently so when my other favorite Chinatown restaurant is closed I decided to come here for lunch...."},{"Name":"Z & Y Peking Duck","Rating":3.9,"Address":"606 Jackson St, San Francisco, CA 94133","Categories":"Chinese, Wine Bars, Asian Fusion","Latitude":37.796364,"Longitude":-122.405502,"Price":"$$","Reviews":"Came during Chinese New Year week, so there was a bit of a wait. By that I mean we had to wait an hour and a half despite having a reservation. They still...\nWe love the other Z&Y and so we were really excited to try out their sister Peking Duck restaurant! With a smaller variety on the menu than Z&Y - we found...\nFabulous Beijing Duck, maybe the best in Bay Area. \n\nOther dishes are same level with Z &Y, the most famous Sichuan restaurant in US, yet less waiting time,..."},{"Name":"Rural Ramen Bar","Rating":4.5,"Address":"1059 Powell St, San Francisco, CA 94108","Categories":"Ramen, Noodles, Asian Fusion","Latitude":37.7946448599,"Longitude":-122.4099663,"Price":"$$","Reviews":"Delish ramen!! Would recommend to all my friends coming by for a visit. Out of my party of 6, 5 of us got the tonkotsu haha and we all loved it. \n\nDecor is...\nSmall ramen shop with fast service and passable fare. A quick, affordable option for those who want ramen now.\n\nSince I was going to a show at the Masonic,...\nVery flavorful thick broth. But also a rich taste. I asked for their homemade spicy sauce and it was delicious with my ramen. \n\nThe noodles were very chewy..."},{"Name":"J&M A-1 Cafe Restaurant","Rating":4.1,"Address":"779 Clay St, San Francisco, CA 94108","Categories":"Chinese","Latitude":37.7941615015,"Longitude":-122.4059651792,"Price":"$$","Reviews":"Authentic and delicious!!!! Our party of 6 ordered quite a bit, but the Shanghainese steamed dumplings and the Hong Kong style wonton soup was my absolute...\nMy husband and I were in SF for an event and hadn't eaten. We took to Yelp to find some good dumplings and this spot popped up close by.\n\nFirst off- make...\nThe service here was phenomenal - we came and I believe they were closing up early due to lack of customers. The owner saw us and opened up just for us. We..."},{"Name":"New Golden Daisy","Rating":4.0,"Address":"1041 Stockton St, San Francisco, CA 94108","Categories":"Delis, Chinese, Chicken Wings","Latitude":37.79554,"Longitude":-122.40848,"Price":"$$","Reviews":"This place has been around for decades and is popular for their little fried chicken drumsticks (drumettes). They have a great blend of spices and flavor to...\nYou gotta be kidding me. This is what people are raving about?? $7.99\/lb fried chicken wings -- Safeway wings taste better than these! There is no flavor to...\nNew Golden Daisy is my favorite place in Chinatown for chow mein $5 and fried chicken $8 by the pound. I've been coming here since I was in elementary..."},{"Name":"Fog Harbor Fish House","Rating":4.3,"Address":"39 Pier, Ste 202A, San Francisco, CA 94133","Categories":"Seafood, Wine Bars, Cocktail Bars","Latitude":37.80889,"Longitude":-122.41025,"Price":"$$","Reviews":"Bongjovi was an excellent server! He made us feel welcomed and appreciated his customer service!\nOur server Bong Jovi was great. Food was great and service was quick. The calamari was fresh and prepared to perfection\nFood was amazing! Crabs & Spinach dip, Cioppino and Surf & Turf were all so delicious! Luis was our server and did a great job."},{"Name":"Surisan","Rating":4.3,"Address":"505 Beach St, San Francisco, CA 94133","Categories":"Korean, New American, Breakfast & Brunch","Latitude":37.80678,"Longitude":-122.41756,"Price":"$$","Reviews":"TLDR: Good Korean Food- nothing groundbreaking but nonetheless satisfying.\nOur meal started with a poke mango salad. Considering mango is not currently in...\nIt's definitely a go-to brunch spot. Will not disappoint. Little on the pricier side. Do not skip on the french toast.\nSurisan knows how to BRUNCH! Located near Ghirardelli Square, my friends and I celebrated her first half marathon at Surisan. Joining the waitlist on Yelp..."},{"Name":"Pier Market Seafood Restaurant","Rating":4.0,"Address":"39 Pier, San Francisco, CA 94133","Categories":"Seafood, Bars, Sandwiches","Latitude":37.8099623234,"Longitude":-122.4105802922,"Price":"$$","Reviews":"Walking down the Pier 39 in a cold and rainy winter night, longing for something hot to keep myself warm. Stopped by the Pier Market and ordered Cioppino...\nWe take our goldendoodle puppy everywhere and were looking for a romantic outdoor setting for us as well. Well it just so happens that Pier Market offers...\nReally great seafood restaurant option on the pier! Went with my family during lunchtime while they were visiting SF. We got clam chowder in a sourdough..."},{"Name":"The Codmother Fish & Chips","Rating":4.4,"Address":"496 Beach St, San Francisco, CA 94133","Categories":"British, Fish & Chips, Seafood","Latitude":37.8072702557,"Longitude":-122.4170937718,"Price":"$$","Reviews":"Oh. My. Goodness. \nSeriously best thing we ate the whole trip. It's a MUST. Husband wasn't sure about it at first but man, good prices, nice people, a...\nI remember coming here when my eldest son was a baby and being greeted by The Codmother herself! \nWe arrived at a good time as the lunch rush was just...\nI ordered the fish\/shrimp combo with fries. It was a large serving & simply delicious.\nThe batter on the cod was light, the shrimp were juicy & fried to..."},{"Name":"Scoma's Restaurant","Rating":4.1,"Address":"1965 Al Scoma Way, San Francisco, CA 94133","Categories":"Seafood, Bars","Latitude":37.808952,"Longitude":-122.418487,"Price":"$$$","Reviews":"Our dining experience is so great we went back two days later! Food is as fresh as you can get from the pier to your plate, indeed! Valet is free and...\nClassic spot in San Francisco's fisherman's Wharf. Touristy area but you can't deny the food and service. Both impeccable. Started with their version of...\nI love seafood, but never get to cook it because my hubby hates the smell. Soooooo, when given the chance, I will find a seafood restaurant that will have..."},{"Name":"ABACÁ","Rating":4.0,"Address":"2700 Jones St, San Francisco, CA 94133","Categories":"Filipino","Latitude":37.8067372018,"Longitude":-122.416937374,"Price":"$$$","Reviews":"Filipino fusion to the core.  Abaca was recommended and I came for dinner to give it a try.  The service was good.  The server was hospitable and helpful in...\nAs a Filipina-American, I was actually impressed by the food because it brought me back to what I would eat at family parties. However, for my friend,...\nfinally got to try abaca, which is the stunning contemporary filipino-californian restaurant blending together traditional filipino recipes a with seasonal..."},{"Name":"Crab House at Pier 39","Rating":3.9,"Address":"203 C Pier 39, San Francisco, CA 94133","Categories":"Seafood","Latitude":37.80916161,"Longitude":-122.41040192,"Price":"$$","Reviews":"Loved the crab chowder, and the service was excellent. The restaurant is very clean&tidy.\nOmg! After our reservation fell through at another location and driving in from Stockton California. We decided to head over here. I am so glad our initial...\nWell, it is indeed an unforgettable dining experience.\n1.Excellent and well trained staff. Gino, our waitor, is the one who knows something.\n2. Fresh and..."},{"Name":"The Socialite Crafthouse & Kitchen - Fisherman’s Wharf","Rating":3.9,"Address":"77 Jefferson St, San Francisco, CA 94133","Categories":"Seafood, American, Desserts","Latitude":37.8083653,"Longitude":-122.4134995,"Price":"$$","Reviews":"I know this review is going to feel like it's coming out of left field, but hear me out. The Socialite has a small section by the entrance that sells boba...\nLast time I stayed in this area, this place was closed.  I'm glad to see it open again.  Cocktails were good and the ambience is casual.  You can sit on the...\nCame here to check out what they had inside. \nSaw a few pizza boxes and a bar. The bartender was very feiendly and nice. Offered us if we wanted a drink...."},{"Name":"Franciscan Crab Restaurant","Rating":3.5,"Address":"Pier 43 1\/2 Fisherman's Wharf, Fisherman's Wharf, San Francisco, CA 94133","Categories":"Seafood, American","Latitude":37.8092604518,"Longitude":-122.4146435876,"Price":"$$","Reviews":"During Fleet Week at Fisherman's Wharf in SF, it is very crowded, but we were seated immediately & had a great view of the air show!\nOur server was very...\nI wanted some good crab and thought while in San Francisco, I'd be in luck. My wife and I stopped here on a rainy Wednesday for lunch while walking around...\nSadly disappointed and dissatisfied.\nAfter walking past Franciscan several times over the years we decided to give it a try! \nWe came on a Sunday night..."},{"Name":"The Italian Homemade Company","Rating":4.3,"Address":"716 Columbus Ave, San Francisco, CA 94133","Categories":"Italian, Pasta Shops, International Grocery","Latitude":37.801752,"Longitude":-122.411851,"Price":"$$","Reviews":"The place is cute, very nice personal and the food was pretty good!! 10\/10 you need try lasagna!\nA small no-nonsense, no-frills Italian restaurant where you pick your pasta, your sauce, and that's about it, you get your meal served on a paper plate and...\nVery cute and small handmade pasta place! \nOrdered the veggie ravioli with marinara sauce and the oven baked tomato salad. The pasta serving was on the..."},{"Name":"Hollywood Cafe","Rating":4.3,"Address":"530 North Point St, San Francisco, CA 94133","Categories":"Breakfast & Brunch, Cafes","Latitude":37.8065799,"Longitude":-122.41584,"Price":"$$","Reviews":"Hollywood Cafe was a cute hole in the wall diner within walking distance of Fisherman's Wharf. While it was decorated with pictures of classic Hollywood...\nUsually, I review places if they have great service or the food is amazing this place had both.\nSmall place but mighty very homey vibe. \nServers checked up...\nAfter checking in at the Marriott Pulse Vacation Club, my family decided to walk a short distance and try the Hollywood Cafe.  The positives are that the..."},{"Name":"Piccolo Forno","Rating":4.6,"Address":"725 Columbus Ave, San Francisco, CA 94133","Categories":"Pizza, Italian","Latitude":37.8013699309,"Longitude":-122.4119810387,"Price":"$$","Reviews":"It was really fantastic dinner. The service was really kind and great. I ate lasagna and Ravioli di Aragosta. the dishes was satisfying so much. The lasagna...\nImmediately friendly, welcoming shoebox of a place-\nLots of wild colors, and they kindly reserved a table for us when we were about15 minutes out. The blank...\nThis place is amazing. The staff are all extremely friendly, the welcome you with an Amazing reassurance of welcome. The location is amazing and heart to..."},{"Name":"Boudin","Rating":4.1,"Address":"160 Jefferson St, San Francisco, CA 94133","Categories":"Bakeries, Salad, Sandwiches","Latitude":37.808507,"Longitude":-122.4149153,"Price":"$$","Reviews":"Touristy for sure, but sometimes even as a local you crave clam chowder in a bread bowl. Drive down here and got a free street parking spot on a sunday...\nHad a day date in SF and of course -- clam chowder is something one should not pass up while in the city.  We stopped in on a weekday afternoon and it...\nI've visited San Francisco many times and have dined at Boudin before.  Visiting the location at Fisherman Wharf with my husband for the first time was..."},{"Name":"Cafe de Casa","Rating":4.6,"Address":"2701 Leavenworth St, San Francisco, CA 94133","Categories":"Coffee & Tea, Brazilian, Gluten-Free","Latitude":37.8061562545,"Longitude":-122.4189129,"Price":"$$","Reviews":"I was born and raised in Brasil. Café de Casa is the place for great ambience (specially the one at Castro) Servers are always welcoming and bilingual. The...\nCame here because they had gluten free options on their menu and I have Celiac disease and must eat gluten free. \nHusband ordered:\n- Pour over coffee....\nTaking away one of the best products for in store consumption or pick up (large cheese bread) because they can charge more if they sell them with toppings...."},{"Name":"Eight AM","Rating":4.5,"Address":"1323 Columbus Ave, San Francisco, CA 94133","Categories":"New American, Breakfast & Brunch","Latitude":37.80626,"Longitude":-122.419245,"Price":"$$","Reviews":"Very good breakfast place that is non-touristy in a very touristy area.  \nThe food and quantity of food was excellent.\nA decent sized breakfast place very very close to all the touristy spots that imo is style over substance. It's also a little pricey but most sit down food...\nI suppose the idea is to get you to eat, then GTFO. \nBecause the food is delicious, and the service is friendly. \nBut the chairs are low level torture...."},{"Name":"New Thai Elephant","Rating":4.4,"Address":"393 Bay St, San Francisco, CA 94133","Categories":"Thai","Latitude":37.80564667,"Longitude":-122.4135075,"Price":"$$","Reviews":"On our family staycation, we decided to try the New Thai Elephant restaurant in San Francisco for an early birthday dinner celebration for my mom.  Our...\nI don't know. It was pretty good, but was a little sad that our server is not fully present. She brought us to Thai iced teas and we only ordered one. I...\nFor the prices and quantity of food, this restaurant can't be beat. Unassuming at first, all the dishes are around $15 and taste incredible. Only a few..."},{"Name":"Supreme Crab Seafood Buffet","Rating":3.4,"Address":"245 Jefferson St, Fl 2, San Francisco, CA 94133","Categories":"Cajun\/Creole, Seafood, Buffets","Latitude":37.807856,"Longitude":-122.416456,"Price":"$$","Reviews":"This place has a semi hidden entrance near the fisherman's warf. It has some pretty cool decorations once you enter. We ordered our food ahead and picked up...\nI went to this place in hopes of having a good lunch but it was just the opposite.  They serve blue crab, loaded with seasoning and it was cold.  The garlic...\nSeafood boils in a bag are one of my go to meals. It's extremely surprising I hadn't tried this place by now, but a birthday dinner brought me there. The..."},{"Name":"Sotto Mare","Rating":4.3,"Address":"552 Green St, San Francisco, CA 94133","Categories":"Seafood, Italian, Bars","Latitude":37.79979,"Longitude":-122.40834,"Price":"$$","Reviews":"My favorite seafood place\nOysters, cioppino, \nGreat brunch, lunch\nMy belly is happy\nBest damn cioppino in town \nComing here for over 20 years\nHappy valentines\nCame here about a month ago when it was raining.\nLet me just start off by saying order a ride share because just like the rest of San Francisco forget...\nWe have been on a hunt for that \"perfectly\" seasoned steam mussels ever since our favorite spot at Little Italy in San Diego removed it from their menu, and..."},{"Name":"Bodega","Rating":4.5,"Address":"700 Columbus Ave, San Francisco, CA 94133","Categories":"Wine Bars, Beer Bar, New American","Latitude":37.80135,"Longitude":-122.41129,"Price":"$$","Reviews":"Excellent breakfast burrito! We popped in on a Saturday at 11:30 and it was busy with fun loud music! Our favorite was the short rib burrito!! Will come back\nbodega is a super cute spot for wine, both indoors and outdoors. We went on a sunny day and sat outside at one of the mini wooden tables. Beer was around $8...\nThe best vibes ever. The service is great and the servers are cool haha. My sis lived in NYC and said it reminds her of a bar in East Village. \nScribe rose..."},{"Name":"Brick & Beam","Rating":3.6,"Address":"555 N Point St, Fisherman's Wharf, San Francisco, CA 94133","Categories":"Bars, New American","Latitude":37.8061635337,"Longitude":-122.416376,"Price":"$$","Reviews":"Came here since it was right across the street from our hotel.  We each ordered the tomato soup. It was the best I've ever had. We also shared a salad and...\nThis restaurant is attached to the Hyatt Centric, located in Fisherman Wharf, it is a pretty nice place to hang out at.\nThe name Brick & Beam is just what...\nFood came out fast, hot and tasty, can't ask for much more! We were staying at a nearby hotel which made this restaurant very convenient. I just got your..."},{"Name":"Boudin","Rating":3.8,"Address":"160 Jefferson St, Bistro Boudin, San Francisco, CA 94133","Categories":"Bakeries, Salad, Sandwiches","Latitude":37.808507,"Longitude":-122.4149153,"Price":"$$","Reviews":"Who doesn't love getting things at Boudin?  I got the turtle at Boudin to make a sandwich the next day!\nService was smooth. I wouldn't say they were the...\nI can't believe how much changes in a year. I used to dislike sourdough and now I'm sourdough's biggest fan. In fact, I'm going to learn how to start making...\nMy first review of the year goes to Boudin in San Francisco. My fiancé and I got a couple gift cards for Christmas and decided to check this place out..."},{"Name":"Cioppino's","Rating":3.7,"Address":"400 Jefferson St, San Francisco, CA 94109","Categories":"Italian, Seafood, Bars","Latitude":37.8079387691,"Longitude":-122.4192710399,"Price":"$$","Reviews":"Another tourist trap on the wharf, but if you are doing tourist stuff on the wharf than you really have no choice.  The got us seated right away.  The...\nFirst time and not too impressed.\nThe food was good but not for the price. \nFlavor was consistent but it wasn't anything better than Alfredo made at home....\nWhere is the FISH? \nCame as black thin steak looking something\nthe wiater\/waitress claimed they are popular for seasoning ! WTF!!\nwhere is the FISH? \nWorst..."},{"Name":"Bocconcino","Rating":4.8,"Address":"516 Green St, San Francisco, CA 94133","Categories":"Italian","Latitude":37.79982,"Longitude":-122.40783,"Price":"$$","Reviews":"This is an absolutely amazing restaurant.   Every dish was prepared exquisitely.  Great staff and ambiance.   I very very highly recommend this restaurant....\nWith the New Year upon us, it was time to try something new so this was the setting for my midweek lunch.  Entering, I found the dining room empty and there...\nNote there is no website for this place, so no official menu, you need to look at menu photos on Yelp - come on, it's 2024, you don't have a nephew that can..."},{"Name":"Eagle Cafe","Rating":4.1,"Address":"The Embarcadero, Bldg A, Level 2, San Francisco, CA 94133","Categories":"New American, Seafood","Latitude":37.80819046,"Longitude":-122.40913786,"Price":"$$","Reviews":"Great food, great view and excellent service.  We ate outside and had the crab Benedict.  Also had the Bloody Mary, which was delicious - spicy on its own...\n11\/21\/2023 (9am-ish)\nAfter a one mile walk from the hotel Hubby was hungry. He found this place right upstairs from the Biscoff Coffee Corner. We were...\nThis was my first time being here and San Francisco. We were seated right away however we waited 10 minutes before anyone came to serve us. No apology for..."},{"Name":"The Buena Vista","Rating":4.1,"Address":"2765 Hyde St, San Francisco, CA 94109","Categories":"Bars, Cafes, Breakfast & Brunch","Latitude":37.8065625294,"Longitude":-122.4206860084,"Price":"$$","Reviews":"It was a very crowded early Sunday afternoon when we stopped in to grab a quick bite and so I could try the \"world famous\" Buena Vista Irish Coffee. When we...\nStill awesome, if you haven't come, just come...\nWe ordered drinks and lunch:\nLobstah Roll (5 stars). Buttered soft roll lightly grilled, plenty of lobster...\nSo i was in SF for work.  I needed to kill sometime before my flight.  I recalled a segment on the travel channel (is the travel channel still a thing?)..."},{"Name":"Tanguito","Rating":4.3,"Address":"2850 Jones St, San Francisco, CA 94133","Categories":"Argentine, Burgers, Empanadas","Latitude":37.807614,"Longitude":-122.417203,"Price":"$$","Reviews":"This place is a hidden gem at the pier, offering a delightful departure from the ordinary. My first venture into the world of Argentinian empanadas was...\nSuper late service and pricey. It was unusually a hot day so maybe thats why but the person who takes our order was unfriendly. Had to wait for about...\nThank You, Yelpers, you lead me to Tanguito Argentinean Grill (... and this is why I use Yelp, for recommendations like this.) It's in Fisherman's Wharf,..."},{"Name":"Hillstone","Rating":4.0,"Address":"1800 Montgomery St, San Francisco, CA 94111","Categories":"New American, Wine Bars","Latitude":37.8057125956,"Longitude":-122.4052805454,"Price":"$$$","Reviews":"Overall, the environment and service at Hillstone are very good, the decoration style is very American, the ingredients used in the dishes are good, but the...\nHad an amazing dinner at Hillstone last night! From the moment you walk in, the vibe is great, the hostesses were welcoming and everything pointed to signs...\nI've lived in SF for quite some time and have never been to this place. Decided that I would take my gf here for a Friday night dinner date. Not the biggest..."},{"Name":"Fiddle Fig Cafe & Coffee","Rating":4.6,"Address":"790 Lombard St, San Francisco, CA 94133","Categories":"Cafes","Latitude":37.80289,"Longitude":-122.41433,"Price":"$$","Reviews":"Very cute cafe, great food, very quick and awesome service. 12\/10 \nHas wifi so can either be a good work or date spot\nI'm not sure how I found this hidden gem - but, I'm glad I did.  We will definitely be back when in the city and looking for a low key breakfast or just a...\nDon't come BEFORE they close because they'll be closed.\nAsking for someone's order then saying you're not going to make is a waste is a time. \nThank..."},{"Name":"Curry Leaf","Rating":4.4,"Address":"943 Columbus Ave, San Francisco, CA 94133","Categories":"Indian, Halal, Pakistani","Latitude":37.80308,"Longitude":-122.41452,"Price":"$$","Reviews":"What would I do without Yelp!!!??  ;P\nAfter spending a few days in SF's Fisherman's Wharf area and enjoying meal after meal of seafood, fish n chip and clam...\nThe Chicken Tikka Masala was an explosion of flavors, with tender, succulent pieces of chicken swimming in a creamy, perfectly spiced tomato-based sauce....\nWe ordered takeout food from this place tonight to try out a new place. The food was OK. I don't understand why everybody is raving about the chicken tikka..."},{"Name":"Fior d'Italia","Rating":4.0,"Address":"2237 Mason St, San Francisco, CA 94133","Categories":"Italian, Wine Bars, Venues & Event Spaces","Latitude":37.80427,"Longitude":-122.4136,"Price":"$$$","Reviews":"One of the oldest Italian restaurants in SF, celebrating 136 years. They know how to do Italian food. Six of us went here for NYE. The service was really...\nI've been looking far and wide for a good veal chop in San Francisco, and finally found one at Fior! It was cooked to perfection and had a good sauce. \nThe...\nFior d'Italia is such an old-school, classic Italian restaurant. Its main draw is definitely being the oldest Italian restaurant in the US, but I think the..."},{"Name":"Gary Danko","Rating":4.5,"Address":"800 N Point St, San Francisco, CA 94109","Categories":"New American, French, Wine Bars","Latitude":37.8058234828,"Longitude":-122.4206056446,"Price":"$$$$","Reviews":"I recommend it if you want something special for your last day. The atmosphere is especially romantic. The portions are huge so 3 courses are enough. The...\nNot all pictured\nFirst time : tasting menu, boyfriend's birthday\nSecond time : 4 course meal, my birthday\nThe best espresso martini I've had, they're my...\nThis is a great restaurant by most standards, however, only 4 stars because I was disappointed from a Michelin star perspective. The staff was extremely..."},{"Name":"Ollei","Rating":4.5,"Address":"2127 Polk St, San Francisco, CA 94109","Categories":"Korean, Comfort Food, Asian Fusion","Latitude":37.796378,"Longitude":-122.422173,"Price":"$$","Reviews":"Mmm tasty yummy mmm a pristine establishment with ideal cocktails. Thank you ollei, thank you ollei\nI like this pleasant, low frills place. One of the most flavorful Korean vegetarian tofu soup options in the city and relatively inexpensive. Maybe...\nWent in on a Friday early evening. Greeted and seated quickly. We were the only ones there. \nOrdered sake and beers. Pretty tasty. \nThe pot stickers were..."},{"Name":"Barrio Ghirardelli Square","Rating":3.9,"Address":"900 North Point, San Francisco, CA 94109","Categories":"Mexican, Cocktail Bars","Latitude":37.8059862568,"Longitude":-122.4229477219,"Price":"$$","Reviews":"Ocean views, great food, and an amazing service! This place is literally the perfect date night spot. I truly enjoyed the experience and vibe of this place....\nIn a touristy part of the city but definitely such a nice restaurant. The view of the bay is lovely and the service is quick and friendly. Drinks here are...\nI visited Barrio on the last night of my trip for dinner, and after a busy day. I was dressed VERY casual, and they welcomed me with open arms. I sat in the..."},{"Name":"Fisherman's Wharf  Chowder and Crab Sidewalk Stands","Rating":3.7,"Address":"200 Jefferson St, San Francisco, CA 94133","Categories":"Food Stands, Seafood, Soup","Latitude":37.80813,"Longitude":-122.41566,"Price":"$$","Reviews":"Stopped by here back on the Fourth of July. I was looking forward to some delicious calamari, which Fisherman's Wharf is famous for. The ordering was nice...\nFreshest Applebee's I've ever been to. The restaurant was gorgeous and it was cool to see the bay while eating. Service was quick and server was a sweetheart!\nGrease. And lots of it. Same selection of chowders, fish & chips, and fried \"things\" at all the stands here across from the Fishermans wharf sign. It can..."},{"Name":"Queen's Louisiana Po-Boy Cafe","Rating":3.8,"Address":"33 The Embarcadero, Ste 100, San Francisco, CA 94133","Categories":"Cajun\/Creole, Southern, Seafood","Latitude":37.806957,"Longitude":-122.40576,"Price":"$$","Reviews":"I'm a sucker for good Gumbo! I was in the area with a friend and we stopped by for lunch and a drink. I knew I was going to get the gumbo but I honestly...\nCame here with a friend after walking from pier 3 to the goal of walking to pier 39.  Midways we passed through this restaurant and decided to give it a try...\nI was recommended this place with high praise for their Gumbo and I am definitely following the hype!\nAn order of Gumbo comes with a tiny pile of rice and..."},{"Name":"Pier Market Stand","Rating":4.0,"Address":"39 Pier, San Francisco, CA 94133","Categories":"Seafood, Burgers, Sandwiches","Latitude":37.8099358635,"Longitude":-122.4105776856,"Price":"$$","Reviews":"The fish and calamari were fine but I didn't care much for the fries. The sauce carried the fries. I can't give a completely accurate review of the taste...\nThis place was clean, service was fast and food was tasty. I would recommend it plus the view was a plus! I left satisfied and content.\nI had clam chowder and a hamburger. I wonder if this review counts. Well, I was a pier 39 employee having a discounted break snack. Good for that."},{"Name":"Grandehos Kamekyo","Rating":4.1,"Address":"2721 Hyde St, San Francisco, CA 94109","Categories":"Sushi Bars, Japanese, Korean","Latitude":37.80612,"Longitude":-122.42069,"Price":"$$","Reviews":"We came as a family last night to dinner and this was such a welcoming yummy place. Refreshing amidst a lot of touristy places around. Everything was...\nThe service here? Amazing! The food? Wasn't as impressive :(\nWe came here after Fleet Week since it was close to Ghiradelli Square where we were watching....\nThis neighborhood icon is a go to place here in the Wharf. Great food and service and ample portions of food. If I lived nearby I would hop over daily for..."},{"Name":"Darren's Cafe","Rating":4.2,"Address":"2731 Taylor St, San Francisco, CA 94133","Categories":"Vietnamese, Breakfast & Brunch, Cafes","Latitude":37.80753,"Longitude":-122.41587,"Price":"$$","Reviews":"We went into Darren's to try out the breakfast. Our breakfast sandwich and crab omelette were delicious. The breakfast potatoes were the best I have ever...\nBecause I decided to grab a lobster roll and some clam chowder on Pier 39, my wife and son decided to come to Darren's Cafe for lunch since they don't like...\nIf you find yourself looking for a breakfast\/brunch spot, come here!\nMy dad has been coming here for awhile and I was in town visiting him so we we went to..."},{"Name":"Pescatore Trattoria","Rating":3.5,"Address":"2455 Mason St, San Francisco, CA 94133","Categories":"Italian, Seafood","Latitude":37.806413,"Longitude":-122.413949,"Price":"$$","Reviews":"Nice place inside of Hotel Zoe. We were staying at the hotel and found out we got $20 off every night we stayed. Our waiter was great, food was delicious....\nIf you prefer a snack to a meal, this place is OK.\nThe food is very good; the service is very nice, the portions are so tiny it's the reason we won't go...\nGenerally, the experience here was great, but there is room for improvement.\nAmbiance: (4\/5) I liked the booth style seating and options for tables as..."},{"Name":"Taco Cantina","Rating":4.1,"Address":"Beach Street & The Embarcadero, Ste 255, San Francisco, CA 94133","Categories":"Mexican, New American, Cocktail Bars","Latitude":37.8099178365,"Longitude":-122.4102041307,"Price":"$$","Reviews":"Convenient, Friendly and Delicious are three words I'd use to describe this restaurant. The restaurant is located on pier 39, which has a perfect view of...\nI don't normally seek out Mexican food especially somewhere as touristy as Pier 39, but then I saw actual plant-based options at more affordable pricing, I...\nStopped here on a Sunday afternoon because it was one of the few places that didn't have a wait. I loved that you were able to order at the register, pay..."},{"Name":"Mama's On Washington Square","Rating":4.1,"Address":"1701 Stockton St, San Francisco, CA 94133","Categories":"Breakfast & Brunch","Latitude":37.8015476448,"Longitude":-122.4095828316,"Price":"$$","Reviews":"Food was delicious. They fill the plate. Fruit and as fresh.Service was great. Definitely recommend this place.\nIt was good food, pancakes were on point as well as the Crab Benedict's very nice staff\nThe perfect quick brunch option on a sunny day. You order inside at the front counter, and then can sit at one of their nice outdoor tables. Service was..."},{"Name":"Bistro Boudin","Rating":3.5,"Address":"160 Jefferson St, Fl 2, San Francisco, CA 94133","Categories":"Bakeries, Beer, Wine & Spirits, Seafood","Latitude":37.8084276,"Longitude":-122.415144,"Price":"$$","Reviews":"Only stopped for the bread.\nSmells of bread were delicious and options were endless.\nDidn't spend much time here but felt comfortable and welcomed by the...\nWhile visiting San Francisco we popped into Boudin to shop and decided to get dinner at the Bistro upstairs. \nThe decor is very beautiful with colorful...\nBistro Boudin is located in the upper level of the massive Boudin Factory Building at Pier 39.  We had lunch downstairs earlier today and enjoyed our meal..."},{"Name":"Pat's Cafe","Rating":4.0,"Address":"2330 Taylor St, San Francisco, CA 94133","Categories":"Breakfast & Brunch, American","Latitude":37.8040101,"Longitude":-122.4148227307,"Price":"$$","Reviews":"Outstanding breakfast  experience. Joe's special is truly a delicious combination and filling and the French toast at Pat's is A MUST!!! I still daydream...\nCame to Pat's Cafe because it was close to the hotel. The vibe is cute diner, pretty small. There were a mix of locals and tourists, but it wasn't very...\nsoooo yummy. no one's posted the burrito so i waited until i tackled mine ig to take the photo, i was so hungry. i had to eat before the camera did this..."},{"Name":"Bubba Gump Shrimp","Rating":3.0,"Address":"Pier 39, San Francisco, CA 94133","Categories":"Seafood, Southern","Latitude":37.8111256938,"Longitude":-122.4103593081,"Price":"$$","Reviews":"1. If you really want the best dish on the menu, avoid the various seafood dishes and feast on the baby back ribs. I'm saying this as someone who has been...\nMixed review here.\nShrimp Ceviche - Odd, unexpected flavor. Not citrusy like it should be. Too much tomato flavor. Not a fan! \nClam chowder - Wonderful!...\nMaker's Mark Salmon: The best flavor salmon I ever had. I believe the side sauce is the same thing that's coated in the salmon. It's sweet and tangy,..."},{"Name":"Seven Hills","Rating":4.5,"Address":"1896 Hyde St, San Francisco, CA 94109","Categories":"Italian, Wine Bars","Latitude":37.7981712,"Longitude":-122.4186984,"Price":"$$$","Reviews":"Food was great ,I recommended ,.I can wait to go back again..\nThe service excellent \nWine selection\nHaven't written a review in so long but oh my lord this place gave me inspiration....\n\nThe food service and ambiance were impeccable, and I normally am not...\nIt's a great restaurant where the food is very tasty. It gets a din because of the price and quantity you get. \n\nService is very friendly and the mood is..."},{"Name":"Freddie's Sandwiches","Rating":4.5,"Address":"300 Francisco St, San Francisco, CA 94133","Categories":"Sandwiches","Latitude":37.8052368164,"Longitude":-122.4103164673,"Price":"$$","Reviews":"Man for as long as this place has been here, there should be more reviews.\nThe chicken salad sandwich was so good I rushed to write this review and give it...\nGrew up in San Francisco and today is the first time ever going.. impressed with the customer service and I really did enjoy my sandwich..  really a hidden gem\nGreat sandwiches, homemade bread. We got the Italian Combo with Sourdough and loved it!"},{"Name":"Cilantro SF Taqueria","Rating":3.9,"Address":"2257 Mason St, San Francisco, CA 94133","Categories":"Mexican","Latitude":37.8045418276,"Longitude":-122.4135912293,"Price":"$$","Reviews":"I stopped by Cilantro SF Taqueria for lunch a while ago. The canteen style felt very laid back and relaxed. In terms of food, I tried the Chile Verde....\nThe food is not good overall. I'm not sure why it's highly rated. \n\nI had a horrible digestive reaction to their ceviche special. It was not fresh.\n\nThe...\nWho doesn't love a good neighborhood Taqueria? \n\nAs they didn't have a taco plate available, I wanted to be able to try different types of meat. I got 4..."},{"Name":"Frankie's Pier 43","Rating":3.5,"Address":"Pier 43 1\/2, Fl 1, San Francisco, CA 94133","Categories":"Seafood, Cafes, Beer Bar","Latitude":37.80911,"Longitude":-122.41465,"Price":"$$","Reviews":"As I was wandering around Fisherman's Wharf on my first visit to SF I was looking for somewhere to have lunch. Luckily I stumbled across this place and had...\nWe were walking around the pier and came across this place. We had to try the clam chowder because we're in San Francisco! The food was good and came out...\nSimple and tasty menu... they do have some of the best fish and chips. not a particular fan of a thinned out clam chowder.. I prefer it thick and creamy but..."},{"Name":"Krispy Krunchy Chicken","Rating":4.0,"Address":"2660 Mason St, San Francisco, CA 94133","Categories":"Chicken Wings, Cajun\/Creole, Fast Food","Latitude":37.808241,"Longitude":-122.413969,"Price":"$$","Reviews":"As a pregnant woman my smell is 10x stronger but it didn't even need to be stronger to get the smell of this delicious chicken and biscuits from the RIU...\nTaking a visitor from Hawaii who insisted that I must also taking her to see the people surfing and windsurfing by the Golden Gate Bridge (and stopping by...\nNow you know how much I love Krispy Krunchy Chicken. I happened to be going to Pier 39 the other day and low answer behold I see Krispy Krunchy Chicken on..."},{"Name":"il Cilentano","Rating":4.4,"Address":"579 Columbus Ave, San Francisco, CA 94133","Categories":"Italian, Bars","Latitude":37.8,"Longitude":-122.41012,"Price":"$$","Reviews":"This review is long overdue. il Cilentano is hands down my favorite restaurant in the city. I am an SF local and have probably eaten here 10 or 15 times the...\nGet the gnocchi!!! \nThe truffle mushroom one is SO GOOD!\nTried this place for the first time and we ordered the carbonara and the truffle gnocchi - we liked...\nAfter flying in late at night, we found this place on Yelp and decided to try. I ended up getting the Gnocchi Pesto and it was SOOO good. The pasta was so..."},{"Name":"Hinodeya Japantown","Rating":4.2,"Address":"1737 Buchanan St, San Francisco, CA 94115","Categories":"Ramen","Latitude":37.786225741,"Longitude":-122.4301213192,"Price":"$$","Reviews":"Best vegan ramen I've ever had the servers were really nice and our order was ready so quick\nThis place was great. We took my spouse here for a ramen birthday lunch. They have two different kinds of vegetarian ramen broth (regular and creamy with...\nService 5\/5\nAmbiance 5\/5\nFood 4\/5\nI was really excited to try the ramen here, especially the infamous vegan ramen that I kept hearing about. Most ramen..."},{"Name":"Daeho Kalbijjim & Beef Soup","Rating":4.5,"Address":"1620 Post St, San Francisco, CA 94115","Categories":"Korean, Soup, Noodles","Latitude":37.78601,"Longitude":-122.42858,"Price":"$$$","Reviews":"Second time here!! Came in at around 30 min after they opened, so we didn't have to wait at all! \nOrdered the kalbijjim (braised beef rib) and added...\nI used to frequent Daeho quite a bit. Everything about this place is great! The food, the service and the ambiance! But i will say the price has gotten out...\nAlways a great spot to go with a group! The signature kalbijjim is a must get with different spice levels for everyone, would recommend adding glass noodles..."},{"Name":"Marufuku Ramen","Rating":4.5,"Address":"1581 Webster St, Ste 235, San Francisco, CA 94115","Categories":"Ramen","Latitude":37.78522,"Longitude":-122.43157,"Price":"$$","Reviews":"I went to have lunch with my brother and it was our first time here and I couldn't recommend this place enough. The service was amazing everyone was so nice...\nRamen was very well balanced and tasty. Staff are doing a great job taking care of the tables. It definitely worth the relatively short wait time. Will come...\nGreat ramen, but on the weekends the wait is long. One used to be able to sign into the wait list on yelp prior to arriving but no longer. You need to be..."},{"Name":"Matsuyama Shabu House","Rating":4.4,"Address":"1726 Buchanan St, San Francisco, CA 94115","Categories":"Hot Pot, Japanese","Latitude":37.78606,"Longitude":-122.42968,"Price":"$$","Reviews":"Delicious and quick. Super fair price for A5 wagyu, the omakase is definitely recommended. We had the spicy and chicken broth. The chicken broth was...\nSAVE THIS for your next Date Night!! Don't be scared of the price, because the quality of each course is sooo worth it! That Glazed Mackerel app was one I...\nI was excited to try this spot since it just opened and I love shabu shabu. I enjoyed that they had bar seating since I'm used to sitting so far away across..."},{"Name":"Yakitori Edomasa","Rating":4.0,"Address":"1581 Webster St, Ste 270, San Francisco, CA 94115","Categories":"Japanese","Latitude":37.78522,"Longitude":-122.43157,"Price":"$$$","Reviews":"Absolutely the best chicken I had in my life, and I'm super picky and generally do not even like chicken that much. The soups was absolutely out of this...\nAn absolute gem of a restaurant. I truly love going to Yakitori Edomasa because every single item there is DELICIOUS. I've been a couple of times during...\nThis place was hyped up quite a bit, but I finally caved and decided to try it out one night when I was craving yakitori. From what I heard, this place is..."},{"Name":"NONO","Rating":4.4,"Address":"1730 Fillmore St, San Francisco, CA 94115","Categories":"Izakaya","Latitude":37.78569,"Longitude":-122.43294,"Price":"$$","Reviews":"At NONO restaurant, the Chicken Skewers are a culinary masterpiece. Tender, succulent chunks of chicken, expertly marinated in a blend of herbs and spices,...\nHighly recommend coming here!  It's a small izakaya right next to Japan town, and super convenient to park next to the garage and walk over. \n We tried:...\nWe walked by this place on our way to Copra one night and we instantly thought \"wow it's so cute, we need to try it.\" And we finally did! We came here at..."},{"Name":"Hoshinoya","Rating":4.2,"Address":"1740 Buchanan St, San Francisco, CA 94115","Categories":"Japanese, Noodles, Soup","Latitude":37.78618,"Longitude":-122.42971,"Price":"$$","Reviews":"I didn't know where to have dinner and stumbled up Hoshinoya after walking around Japan Town for a bit. I came around 6 pm so the restaurant wasn't too busy...\nPassed by this restaurant and decided to give it a try and i'm so glad I did !! the food was so great, I tried the hoshi bun, kakuni bowl, and shared the...\nVisited with friends before going through the Japantown mall. I opted for the bento, going with takoyaki and chicken teriyaki. My friend got the Katsu..."},{"Name":"Yuji","Rating":4.8,"Address":"1700 post st, Unit K, San Francisco, CA 94115","Categories":"Japanese","Latitude":37.7857557,"Longitude":-122.4301162,"Price":"$$","Reviews":"The nine-seater restaurant immerses you in a Japanese ambiance. The service was wonderful, with attentive staff constantly refilling our drinks. The dinner...\nTerrible morning followed by a delicious & thoughtful dinner with great friends laughing for about two hours straight. \nYuji's opened in 2022. Chef's...\nWe went for my birthday dinner and I have been spreading the word about Yuji nonstop when anyone asks about omakase experiences. I believe chef Yuji has set..."},{"Name":"Fermentation Lab","Rating":4.6,"Address":"1700A Post St, San Francisco, CA 94115","Categories":"Cocktail Bars, Seafood, New American","Latitude":37.78575,"Longitude":-122.4301,"Price":"$$","Reviews":"Accidentally made a reservation online for the wrong day & I called in and they were able to fix it for me! Our table was available right when we arrived....\nLocated in the plaza on post across from the main Japan town mall. Not sure what this was before, but it looks newly remodeled inside and had plenty...\nWhat caught my interest about this place was the mocktails as a non drinker. Plus the fact that i had this place saved on ig only to have a friend send me..."},{"Name":"Copra","Rating":4.0,"Address":"1700 Fillmore St, San Francisco, CA 94115","Categories":"Indian","Latitude":37.7853835284,"Longitude":-122.4327894,"Price":"$$$","Reviews":"Black Cod Polichatthu - 7\/5\nThayir Vadai Chaat - 7\/5\nOysters - 6\/7\nMarrow - 6\/5\nDuck - 4\/5\nCrab - 4\/5\nFried Chicken - 4\/5\nDesserts:\nGod's own coconut -...\n4.5 - very impressed! \nFood: everything we got was delicious. we ordered the pooris, truffle appam, fried chicken (this was a winner!), dosa, black cod...\nSo, I just had the most incredible dining experience at Copra on Fillmore! This Indian restaurant is a true gem, offering a unique twist on traditional..."},{"Name":"Waraku","Rating":3.8,"Address":"1638 Post St, San Francisco, CA 94115","Categories":"Ramen, Noodles, Izakaya","Latitude":37.7859021995,"Longitude":-122.4287742,"Price":"$$","Reviews":"When in Japantown, might as well enjoy some ramen.  They have a very focused menu, signaling that they specialize in doing a few items really well.  The...\nVery short wait time for us on a weekend but the restaurant was still pretty busy! The food was great, very satisfying and flavorful. \nI forgot what ramen...\nMust-try: their black garlic tonkatsu \nWhy? this is my favorite ramen in Japantown, especially if you're a garlic lover!\nProtip: great vibes inside and kind..."},{"Name":"Kui Shin Bo","Rating":3.8,"Address":"22 Peace Plz, Fl 2, San Francisco, CA 94115","Categories":"Japanese, Sushi Bars","Latitude":37.785367,"Longitude":-122.429465,"Price":"$$","Reviews":"During my recent visit to the Japanese restaurant, I had the opportunity to explore a variety of dishes that offered a mix of delightful surprises and a few...\nIf you're looking for great Japanese cuisine in Japantown, I unfortunately cannot recommend Kuishinbo. \nIn a place that should be known for its Japanese...\nThe broth for the ramen was flavorful and rich.\nMackerel was nicely cooked.\nTeriyaki chicken was good but lacked some flavor. \nMiso soup was very hearty!..."},{"Name":"Udon Mugizo","Rating":4.1,"Address":"1581 Webster St, Ste 217, San Francisco, CA 94115","Categories":"Japanese, Noodles","Latitude":37.78501,"Longitude":-122.431741,"Price":"$$","Reviews":"My favorite Udon in the world other than in Japan!! Must try and the service is amazing...\nCame here on a Sunday morning and had to wait about 15 minutes for a table. Didnt mind the wait because there is lots to do in this mall. \nOrdered the...\nMY FAVORITE RESTAURANT IN SAN FRANCISCO.\nThe handmade noodles at Udon Mugizo have the perfect texture and the service is always tremendously quick. My..."},{"Name":"Yakiniq","Rating":3.3,"Address":"1640 Post St, Fl 2, San Francisco, CA 94115","Categories":"Korean, Barbeque","Latitude":37.7859352307,"Longitude":-122.4288742,"Price":"$$$","Reviews":"This is one of the best Korean bbq places I've been to, and I've been to a lot! The meat was seasoned\/marinated so well. The kimchi and ssamjang were...\nHow have I not reviewed YakiniQ after coming here AT LEAST yearly for the last 10 years?! I'll fight anyone who doesn't agree with this being the best AYCE...\nThe wait was pretty long considering we made a reservation and had to wait an additional 45 minutes, but thankfully you can roam around japantown while..."},{"Name":"7 Adams","Rating":4.2,"Address":"1963 Sutter St, San Francisco, CA 94115","Categories":"American, Wine Bars","Latitude":37.785957,"Longitude":-122.432615,"Price":"$$$$","Reviews":"As a former Marlena fan, I was hoping this place would be good and I was not disappointed! The overall vibe felt very much like Marlena, as did the menu....\nVery lovely dinner at 7 Adams ... every dish is so creative and tasty, flavor are unexpected and yet in harmony ... seared black cod was cooked perfectly...\nSad to see there were bad experiences with service below. We arrived 10 min early for our 730 reservation and were seated immediately. They were super..."},{"Name":"Bansang","Rating":4.2,"Address":"1560 Fillmore St, San Francisco, CA 94115","Categories":"Korean, Tapas\/Small Plates, Asian Fusion","Latitude":37.78406,"Longitude":-122.43256,"Price":"$$","Reviews":"Inventive dishes that stimulate your palate!! The place was low on staffing due to the Superbowl, but we still received excellent service. \nThey do a good...\nThe service was excellent from the moment we walked in. The food offered a delightful experience, with standout dishes including the miso-marinated pork,...\n\"The Korean word 'Bansang' refers to the style of table setting for the kings and nobles of the Joseon, a Korean dynastic kingdom that prospered for more..."},{"Name":"little shucker","Rating":4.4,"Address":"2016 Fillmore St, San Francisco, CA 94115","Categories":"Seafood","Latitude":37.788292,"Longitude":-122.433458,"Price":"$$","Reviews":"Popped in here briefly on the Friday before Valentines Day (5:30pm) and there was plenty of seating! \nVery cute ambiance \/ decorations. Love the fun...\nCame here with a few friends and was sadly very underwhelmed. We tried most things on the menu and one thing after another - things were just ok. Nothing...\nWe've been wanting to try little shucker for a while, and last week we finally did. \nIt was a Friday night, and while they were plenty of tables, they were..."},{"Name":"Nari","Rating":4.1,"Address":"1625 Post St, San Francisco, CA 94115","Categories":"Thai, Wine Bars, Cocktail Bars","Latitude":37.7854299288,"Longitude":-122.428277,"Price":"$$$","Reviews":"Absolutely fantastic dinner at Nari last night. If you get the chance, go here! Reservations are highly recommended. We arrived just as they were opening...\nPretentious Thai restaurant with sky high prices and mediocre food.  Food is dull and with small portions.  Restaurant is Spartan and 8\/10 loud.  Service...\nThis was my second time at Nari.  I am obsessed!!  My first time, everything was great, except one dish was ridiculously salty - my friends and I were so..."},{"Name":"Mattina","Rating":3.9,"Address":"2232 Bush St, San Francisco, CA 94115","Categories":"Italian, Coffee & Tea, Breakfast & Brunch","Latitude":37.7872233879,"Longitude":-122.4341518,"Price":"$$","Reviews":"My new favorite spot in PAC Heights. The food was superb - really fresh and bright ingredients and very creative and flavorful dishes. Great service and...\nDinner several times and the pasta is outstanding.  Inventive, but delicious. Not your average Italian fare. We get the meatballs, the Brussels sprouts and...\nAfter some shopping, we were in the mood for pasta, so we walked into this place. The first alarm bell should have been that we immediately were asked if we..."},{"Name":"Claws Of Mantis","Rating":5.0,"Address":"1625 Post St, San Francisco, CA 94115","Categories":"Vietnamese, Pop-Up Restaurants","Latitude":37.7854731085,"Longitude":-122.4286309,"Price":"$$","Reviews":"I totally forgot about Lori (https:\/\/www.yelp.com\/user_details?userid=LNEXz0drBNtLHwrb1G-VPA) review, the one and only to date.  \nI went to Louie's Bar on...\nI'm big on entrepreneurship.  It's amazing how many new and really good food-related​ ventures have gained popularity during the pandemic.  They won't do an...\nI absolutely love my meal here.  The entire evening displayed the skill and love the whole staff put into the food and experience. \nEvery dish was amazing..."},{"Name":"Oma San Francisco Station","Rating":4.3,"Address":"1737 Post St, Ste 337, San Francisco, CA 94115","Categories":"Sushi Bars, Japanese","Latitude":37.785103,"Longitude":-122.430974,"Price":"$$$$","Reviews":"This was my first experience with omakase and I'm so glad it was here. I came here with my cousin. 8 seats tucked away in a corner of the shopping plaza....\nMy partner and I had dinner last week at Oma. They have two seatings. We had the 7:15PM seating. The restaurant is basically a sushi bar that seats 8 people...\nThe omakase itself was just alright imo; the hype is all purely aesthetic\/location. \nJust OK omakase for the price, but you're mostly paying for the seat..."},{"Name":"Sasa Japanese restaurant","Rating":4.2,"Address":"22 Peace Plz, Ste 530, San Francisco, CA 94115","Categories":"Japanese, Sushi Bars","Latitude":37.7852958621,"Longitude":-122.4293644672,"Price":"$$$","Reviews":"I really loved my experiences going to Sasa in Japantown. Its conveniently located near the Daiso and it's a type of restaurant that you definitely have to...\nBeing in Japantown, we had pretty high hopes about Sasa.  It is located on the second floor right above Daiso and the interior is beautiful- gives off a...\n4.5 stars really! Lovely spot, lots of variety. Ended up getting the 10 piece nigiri for $60 to try a bunch of different cuts. They were pretty common like..."},{"Name":"Ramen Kobo Waraku","Rating":4.4,"Address":"1638 Post St, San Francisco, CA 94115","Categories":"Ramen","Latitude":37.7858247771,"Longitude":-122.4287742,"Price":"$$","Reviews":"The ramen was amazing and we didn't have to wait to get seated. Will come back here next time I go to San Francisco for sure!!\nRamen Kobo Waraku was across the street from out hotel, so we HAD to check it out. I'm so glad we did!\nThe place isn't huge, but it's very cute. It was...\nWhile at Bon festival on Japantown SF, we dined at Kobo Waraku.  I didn't realize that this place ia rather new.  \nThe place was pretty crowded because of..."},{"Name":"Takoyaki Yamachan","Rating":4.1,"Address":"1737 Post St, Unit 395, San Francisco, CA 94115","Categories":"Japanese","Latitude":37.78517,"Longitude":-122.43055,"Price":"$","Reviews":"Yummm \nI was craving a light bite for a snack and chose this place. I got their regular takoyaki, comes with 5 pieces and total was $7\/$8? Not bad.\nI...\nThis place always has such a long line, and I finally understand why!! This place is so legit, they have the best takoyaki I've had in the states. Went on a...\nSeeing the takoyaki made fresh created a great deal of anticipation on the end results. Unfortunately the takoyaki did not taste as good as the performance...."},{"Name":"Jina Bakes","Rating":4.4,"Address":"1581 Webster St, Ste 150, San Francisco, CA 94115","Categories":"Bakeries, Korean, Coffee & Tea","Latitude":37.78522,"Longitude":-122.43157,"Price":"$$","Reviews":"Always solid spot with good signature pastries. The line was short but moved quickly when we came on Sunday around lunchtime.\nWe got a kalbijjim croissant,...\nWow. This place is sitting in the Japan Town mall for a reason. \nI came on the weekend a storm was driving through San Francisco. I was a bit disappointed...\nGood bakery but I wouldn't purposely go back just for it. \nGalbi croissant flavor was great and had a light spice kick. Croissant part was very flakey. I..."},{"Name":"Woodhouse Fish","Rating":4.1,"Address":"1914 Fillmore St, San Francisco, CA 94115","Categories":"Seafood, New American","Latitude":37.78742,"Longitude":-122.43327,"Price":"$$","Reviews":"A excellent seafood-themed restaurant conveniently located on Fillmore. I'd been meaning to try Woodhouse Fish for a while as I love seafood, and it did not...\nWe loved Woodhouse Fish! It's an affordable seafood place with generous portions for reasonable prices. We're sad to know they're closing one of their...\nI love this place! It's one of my all-time favorite place because the food is so good and the price is reasonable.  I can't believe that I have gotten so..."},{"Name":"Octavia","Rating":4.1,"Address":"1701 Octavia St, San Francisco, CA 94109","Categories":"New American","Latitude":37.7879638672,"Longitude":-122.427192688,"Price":"$$$","Reviews":"We went to Octavia as a large group and had a great time. The food was really creative and tasted great. Our server was also nice and...\n5 stars for ambiance and service. Our waiter was great and the dark cozy vibe of the restaurant is perfect. \n3 stars for food. The menu was full of...\nIdeal For: small groups, intimate dining experience, cozy date night\/atmosphere, curated dishes. \nfaves: heirloom tomatoes, stone fruit salad, picanha,..."},{"Name":"State Bird Provisions","Rating":4.2,"Address":"1529 Fillmore St, San Francisco, CA 94115","Categories":"Tapas\/Small Plates, New American, Desserts","Latitude":37.78374,"Longitude":-122.433005,"Price":"$$$","Reviews":"I have only been waiting 6 years to come to State Bird Provisions. Unfortunately, it has never worked out. Well, fate intervened as I was looking for a...\nCame here with 2 other friends after hearing recommendations from others and seeing it on social media. We learned that it was Michelin-starred, which I was...\nI feel so grateful to have the opportunity to dine here. It was truly such an experience! We had a reservation for 5:30 and arrived around 5:18pm. There was..."},{"Name":"Sikdang Woori","Rating":4.4,"Address":"1506 Fillmore St, San Francisco, CA 94115","Categories":"Korean","Latitude":37.783566,"Longitude":-122.432434,"Price":"$$","Reviews":"Unpretentious and straightforward restaurant serving up delicious Korean classics! My friend used the reservation feature on Google Maps that has the google...\nReally solid find that opened up in the Fillmore! So happy there's a Korean spot nearby- saves me a trip to the Richmond. \nWe came on a Saturday night and...\nThe entrance is not the most exotic spot thus can be easily missed.  The restaurant is located between Popeye and Panda Express. When you walk in there are..."},{"Name":"Pa'ina Lounge & Restaurant","Rating":3.9,"Address":"1865 Post St, San Francisco, CA 94115","Categories":"Hawaiian, Bars, Venues & Event Spaces","Latitude":37.785115,"Longitude":-122.432376,"Price":"$$","Reviews":"We came here to celebrate a dear friend's birthday. It was a great opportunity to try more than a few dishes at the same time since we shared food...\nFood: 3\/5\nService: 4\/5\nAmbiance: 3.5\/5\nOverall: Standard fare.  \nThe extended review...\nFood:\nLoco Moco - 3\/5 - I was pretty disappointed with this dish....\nI had never been to Pa'ina when I was looking at where to host my fiancé's 30th birthday party, but saw it was easy to book a room online. We had our party..."},{"Name":"Ramen Yamadaya","Rating":3.3,"Address":"1728 Buchanan St, San Francisco, CA 94115","Categories":"Ramen","Latitude":37.78606,"Longitude":-122.42968,"Price":"$$","Reviews":"Nowadays, it's almost impossible to get into the best Japantown restaurants on a weekend night without a 2 hour wait - except for Ramen Yamadaya\nIt's not...\nI really wanted to walk through Japantown, to find a cute spot for lunch, to hang out for a bit. My husband - once he saw Ramen Yamadaya's sign - really...\nThe portion sizes go crazy! Saw a movie at the Kabiku theater, and stopped here to have some dinner afterwards. The atmosphere of this place was really..."},{"Name":"Umai Ramen House","Rating":3.9,"Address":"22 Peace Plz, Ste 560, San Francisco, CA 94115","Categories":"Ramen, Japanese Curry, Wine Bars","Latitude":37.785216,"Longitude":-122.429108,"Price":"$$","Reviews":"Friendly staff and decently good food! Recommend for some quick bites! \nFood: 3\/5. I love the big portion sizes they give for ramen and the rice dish. We...\nCame for a casual ramen on a Saturday night, found parking in the area-ish (Japantown is bumping at night!) and got seated for 1 pretty quickly (self-date!)...\nI went here with a friend since it was a cold day and wanted to try a new ramen spot. We went here on a Sunday for lunch around 1:51pm and there was a about..."},{"Name":"Bangkok Street Thai Street Food","Rating":4.2,"Address":"1826 Buchanan St, San Francisco, CA 94115","Categories":"Thai, Salad, Noodles","Latitude":37.786944,"Longitude":-122.429903,"Price":"$$","Reviews":"Came to this lovely Thai place for dinner near Japantown. I ordered the crab meat fried rice and fish cake for appetizer. Other food our table ordered is...\nI've always gotten to go, but even then, this is a hidden gem in SF..\nFinally reviewing bc they're so good. \nThe spices and flavor here are comparable to...\nJitlada is a top-notch Thai spot near Japantown. The Pad See Ew is perfectly seasoned, Thai Iced Tea is refreshing, Mango Sticky Rice is a sweet delight,..."},{"Name":"An Japanese Restaurant","Rating":4.6,"Address":"22 Peace Plz, Ste 510, San Francisco, CA 94115","Categories":"Sushi Bars, Japanese","Latitude":37.7850737296,"Longitude":-122.4289399758,"Price":"$$$$","Reviews":"An extremely rare experience that you really won't find anywhere in the city. It is a small, unpretentious restaurant that is located inside Japan center,...\nIt's hard to put into words how much I loved our meal here this past Saturday. Though they are clear on their website that they do not take modifications...\nI would highly recommend. The food here is brilliant. The server tells you exactly how to eat the sushi. My favorites were the salmon and apples and the..."},{"Name":"Super Mira Market","Rating":4.2,"Address":"1790 Sutter St, San Francisco, CA 94115","Categories":"International Grocery, Fruits & Veggies, Delis","Latitude":37.78673,"Longitude":-122.42978,"Price":"$$","Reviews":"Favorite Japanese market in SF. Great Quality and super clean. Same prices as Nijiya for similar products. Much smaller shop with less variety. Also less...\nShrimp tempura gave my girlfriend food poisoning 30 minutes after eating it. It was the only thing she ate that day. It tasted good though.\nFood:\nChicken cutlet with egg 8\/10: still warm, cutlet was kind of soggy but tbh still good!!\nLots of ready to eat food options like sashimi, onigiri, and..."},{"Name":"Ollei","Rating":4.5,"Address":"2127 Polk St, San Francisco, CA 94109","Categories":"Korean, Comfort Food, Asian Fusion","Latitude":37.796378,"Longitude":-122.422173,"Price":"$$","Reviews":"Mmm tasty yummy mmm a pristine establishment with ideal cocktails. Thank you ollei, thank you ollei\nI like this pleasant, low frills place. One of the most flavorful Korean vegetarian tofu soup options in the city and relatively inexpensive. Maybe...\nWent in on a Friday early evening. Greeted and seated quickly. We were the only ones there. \nOrdered sake and beers. Pretty tasty. \nThe pot stickers were..."},{"Name":"The Tailor's Son","Rating":4.2,"Address":"2049 Fillmore St, San Francisco, CA 94115","Categories":"Italian, Cocktail Bars","Latitude":37.788589,"Longitude":-122.434054,"Price":"$$","Reviews":"Hip, large, cool spot in Pacific Heights, I reserved a table at 7pm Saturday afternoon for the same evening right here on Yelp!\nGreat Italian fare.  The...\nI have been here a few times, and it has always been a good time. The ambiance is really nice, and it's not too loud on the inside. Great location, and...\nThe food was absolutely delightful!\nThe calamari was a unique experience for me, and it was surprisingly delicious without feeling too heavy.\nThe pesto..."},{"Name":"Hikari Sushi & Bar","Rating":3.9,"Address":"1734 Post St, San Francisco, CA 94115","Categories":"Sushi Bars, Conveyor Belt Sushi","Latitude":37.78577,"Longitude":-122.4304,"Price":"$$","Reviews":"Fun experience and pretty good sushi!\nWe came in for the novelty of the bullet train sushi and were pleasantly surprised by the experience. Service was...\nFUN, FANTASTIC and YUMMY....kitchy but who cares, have some fun.\nWE LOVED IT\nand if the sushi standards were up to par as the same type of places in Japan,...\nThis was my first time trying Hikari, but we have eaten at other conveyor belt sushi restaurants.  Hikari is unique in that you order off of a tablet and..."},{"Name":"The Snug","Rating":4.0,"Address":"2301 Fillmore St, San Francisco, CA 94115","Categories":"Cocktail Bars, New American","Latitude":37.79094,"Longitude":-122.43443,"Price":"$$","Reviews":"Some of the best drinks ever, with the quickest and most efficient service. I love a bar that is nice, quiet enough where you can have a conversation, and...\nFood: I got the impossible burger and fries. They were good for bar food, but I would not come back here for dinner as it was not as inventive as I...\nFirst let me start by saying I'm so happy that this special place made it through the pandemic. Second, anyone that has an issue with a 20% added living..."},{"Name":"Izumi Kaiten Sushi","Rating":3.5,"Address":"1737 Post St, San Francisco, CA 94115","Categories":"Conveyor Belt Sushi","Latitude":37.7853018684,"Longitude":-122.4304256117,"Price":"$$","Reviews":"Idk why this place only has 3.5 stars on Yelp. I've been here 3x and we're always impressed by how fresh the fish is! Being Japanese and from Hawaii, I grew...\nBrought kiddos here for lunch. Their first try at sushi belt setting.\nWe came in early around 11:40am and were seated right away. The chefs were busy...\nGood food and service. I especially like the sashimi they have. But you usually need to order them. These on the belt are not sashimi for most of them."},{"Name":"Doobu","Rating":3.5,"Address":"1723 Buchanan St, San Francisco, CA 94115","Categories":"Korean","Latitude":37.78599,"Longitude":-122.43013,"Price":"$$","Reviews":"Still giving this place 4 stars, tho my review is almost opposite of what it was before! I thought the kim chi was delicious, and all the panchan was tasty...\nDoobu Restaurant in San Francisco's Japantown is an interesting spot that I recently checked out on a Tuesday evening at 7 pm. The first thing that caught...\nCame here on a quiet Saturday afternoon, off-hours for meal times. Service was insanely fast. Immediately seated and almost immediately served food after..."},{"Name":"Limoncello","Rating":4.8,"Address":"1400 Sutter St, San Francisco, CA 94109","Categories":"Sandwiches, Delis, Beer, Wine & Spirits","Latitude":37.7873184067,"Longitude":-122.4235913693,"Price":"$$","Reviews":"FANTASTIC! To say the least. This is a beautiful shop with all sorts of Italian goods, however the main event are the sandwiches. They are the bomb you...\nGreat food. Service was fast and ambiance was stellar. Also had an amazing selection of drinks.\nI've been wanting to try Limoncello sandwiches for so long and I'm so glad I finally got one! \nThe Speciale was honestly so good. Perfect amount of..."},{"Name":"Sweet Maple","Rating":4.3,"Address":"2101 Sutter St, San Francisco, CA 94115","Categories":"American, Breakfast & Brunch, Burgers","Latitude":37.78567,"Longitude":-122.435087,"Price":"$$","Reviews":"The best latte I have ever had. The coconut cream was thick and smooth without being overly sweet. I did add two shots of espresso for some caffeine but I'm...\nBig big brunch menu and line moves faster than you would expect. I think very similar to Kitchen Story, you know what you are getting - doesn't disappoint...\nMikko's Yelp Reviews~ \nFood - 9\/10, literally everything here is impressive, I can tell the chefs are really talented. I ordered a limited time omurice..."},{"Name":"a Mano","Rating":4.1,"Address":"450 Hayes St, San Francisco, CA 94102","Categories":"Italian, Cocktail Bars, Pizza","Latitude":37.7769638805,"Longitude":-122.4238684693,"Price":"$$","Reviews":"The food is tasty, it's usually pretty easy to get a table, they have tons of outdoor seating with powerful heat lamps. Service is good. We always get our...\nSitting in the heart of Hayes Valley, a Mano stands out as one of the better Italian places in town. Offering a winning combination of great food, a prime...\nCame here on a Sat and it was fairly busy but we were able to get a seat at the bar (we like bar seating). The bartender was really nice and made us..."},{"Name":"San Wang Restaurant","Rating":3.7,"Address":"1682 Post St, San Francisco, CA 94115","Categories":"Chinese, Korean, Seafood","Latitude":37.785756,"Longitude":-122.429398,"Price":"$$","Reviews":"Over the years, I've been frequenting this unassuming Korean Chinese restaurant in San Francisco's Japantown, when I have a craving for dry-fried chicken,...\nHonestly better than what I was expecting; the owners speak mainly korean and some chinese. The food is not bad but not great, place is clean, big,...\nFood 2.5\nFor me, everything was just a little bland. It didn't taste bad but I expected better. \nFor example, egg flower soup had what appeared to be canned..."},{"Name":"Dumpling Story","Rating":4.6,"Address":"2114 Fillmore St, San Francisco, CA 94115","Categories":"Asian Fusion, Chinese, Noodles","Latitude":37.7893075,"Longitude":-122.4338055691,"Price":"$$","Reviews":"Oh wow upscale ambiance with Chinatown menu. Intestines with noodles. More kinds of soup dumplings than I can list. And lots of small plate combos. \n\nYou...\nWarm fresh dumplings on a cold sf day? Say less. We waited only for about 10 min to get seated after getting on the Yelp waitlist at the kiosk - it's a...\nI've been here a couple of times now and I plan on going back in the future.  The dumplings here are absolutely delicious!\n\nFirst, I'd like to say that..."},{"Name":"The Social Study","Rating":4.2,"Address":"1795 Geary Blvd, San Francisco, CA 94115","Categories":"Wine Bars, Cafes","Latitude":37.7841502802,"Longitude":-122.4324646411,"Price":"$$","Reviews":"The Social Study is one of those special spots I kinda want to gate-keep, but I won't because they deserve the applause. \n\nWe came in on a weekday to crack...\naesthetic: 5\/5\nfood: 4\/5\nservice: 3.5\/5\n\nif you're looking for a spot to do work or grab drinks after hanging out on fillmore st, the social study is where...\nWas in the area and wanted to grab a coffee. A lot of the places nearby were closing so decided to stop by here. \n\nIf I was a local, I would definitely love..."},{"Name":"Noosh","Rating":3.4,"Address":"2001 Fillmore St, San Francisco, CA 94115","Categories":"Mediterranean, Sandwiches, Cocktail Bars","Latitude":37.7880771447,"Longitude":-122.4339577706,"Price":"$$","Reviews":"Went to Noosh tonight with a group of friends for a holiday dinner and I was not disappointed. \nI don't write many reviews these days because I'm not going...\nDon't miss the happy hour prices! \n\nFood: \n- Crispy smashed potatoes: pleasantly crispy! The inside is a bit dry in my opinions, but nothing a dip can't...\nVery very cute ambiance. I want the number of that interior designer. They also have pretty cute outside seating but I recommend inside because of how well..."},{"Name":"Bubu","Rating":4.6,"Address":"2417 California St, San Francisco, CA 94115","Categories":"Sushi Bars","Latitude":37.788694,"Longitude":-122.434195,"Price":"$$","Reviews":"Well, this was a fantastic find. \n\nI was actually heading next door to a cupcake place, and happened to pass by this restaurant. Had no idea what it was,...\nFish was fresh and delicious, the rolls were carefully crafted and had good flavor profiles. They had unique rolls which made them much more enjoyable, as...\nNew sister restaurant to NONO with a menu focused on sushi & nigiri. We really enjoyed NONO and were excited to try Bubu. Best sushi in sf with really fresh..."},{"Name":"On the Bridge","Rating":3.4,"Address":"1581 Webster St, Ste 206, San Francisco, CA 94115","Categories":"Japanese Curry, Noodles, Cocktail Bars","Latitude":37.7850603589,"Longitude":-122.4315849488,"Price":"$$","Reviews":"I have been coming here for almost 20 years. I think it's time to freshen up the menu. Add new locomoco sauces or something. Change it up. \n\nGet the...\nThe service was superb!!  But sadly that was the best thing @ this restaurant. \n\nWe sat @ the bar which was a nice change compared to where we would usually...\nI've been coming to Japan Town for a long time and have seen this spot a million times, but always passed it up. \n\nWell today we tried it out and was..."},{"Name":"Bagatella","Rating":4.4,"Address":"3348 Steiner St, San Francisco, CA 94123","Categories":"New American, Italian, Mediterranean","Latitude":37.80038,"Longitude":-122.43754,"Price":"$$","Reviews":"Loved Bagatella! The decor is beautiful and the service was great.\nWe told them that we would be splitting two entrees and they split them for us no extra...\nWe went on Valentine's day for an early dinner and the only option was a prix fixe meal. I ordered the steak tartare, ribeye and key lime pie. The taste of...\nWent for Valentine's Day and the place was extremely overcrowded. Furthermore the menu was prefixed and was not disclosed upon booking. On top of that a 20%..."},{"Name":"Roma Antica","Rating":4.5,"Address":"3242 Scott St, San Francisco, CA 94123","Categories":"Pizza, Italian, Pasta Shops","Latitude":37.79989,"Longitude":-122.4408,"Price":"$$","Reviews":"Roma Antica has secured its place as my favorite Italian restaurant in the city. It offers an exceptional dining experience characterized by incredible...\nEnjoyed my dinner here! Pasta was perfectly al dente and so delicious. I recommend the Boscaiola (with pink sauce) if you like creamier sauces and Italian...\nWe absolutely loved our dining experience at Roma Antica. Ambiance was lovely. The service was so REFRESHING. I almost forgot what good service from a..."},{"Name":"Mamanoko","Rating":4.3,"Address":"2317 Chestnut St, San Francisco, CA 94123","Categories":"Japanese, Cocktail Bars, Sushi Bars","Latitude":37.7999557,"Longitude":-122.4414378,"Price":"$$","Reviews":"Perfect spot for GNO! Went here with some friends on a Friday night and was seated right away with no reservation. The staff were extremely attentive and...\nOne of our favorite restaurants in all of SF! Food is delicious and great service \/ vibe. Highly recommend the Brussel sprouts, tuna tataki, chicken...\nFood:\nlove love love the food here. Look - I know this is a Japanese spot and you wouldn't think to highlight the brussel sprouts, but they are phenomenal...."},{"Name":"Radhaus","Rating":4.2,"Address":"2 Marina Blvd, Bldg A, San Francisco, CA 94123","Categories":"German, Gastropubs, Breakfast & Brunch","Latitude":37.806758,"Longitude":-122.431458,"Price":"$$","Reviews":"Great food and drinks.. Jesus served us and was super informative of the menu gave great suggestions and service.\nCame here when it was packed at night and the next day during off-peak hours and both times the service was super fast and friendly. Food was good, beers...\nService was 5 star\nBeer was 5 star\nFood was 3 star.  \nWent here with some friends in town that really enjoy german beer.  Went for a late lunch on a..."},{"Name":"MaMo","Rating":4.4,"Address":"3659 Buchanan St, San Francisco, CA 94123","Categories":"Latin American, New American, Beer, Wine & Spirits","Latitude":37.80384,"Longitude":-122.43366,"Price":"$$","Reviews":"Steak chimichurri - The Chimichurri sauce has an herbal, tangy flavor that complements the smokey, savory taste of the steak. The dish is served with a...\nAn absolute must-visit in San Francisco! I'm not entirely sure about its popularity, but I believe this place doesn't receive the recognition it deserves. I...\nI had been wanting to try MaMo for ages, and I was finally able to head over. A friend and I made a meal out of appetizers and it was fantastic. Rating 4..."},{"Name":"Blackwood","Rating":4.2,"Address":"2150 Chestnut St, San Francisco, CA 94123","Categories":"Thai, Breakfast & Brunch, Asian Fusion","Latitude":37.800591,"Longitude":-122.438832,"Price":"$$","Reviews":"Blackwood is a a MUST if you're in the Marina area. My friend and I decided to do brunch nearby before a show at the Palace of Fine Arts which is about a 4...\nChicken and Waffle - 3.5\/5, fried chicken sandwiched between 2 Belgian waffles. The chicken was super crunchy and unfortunately a little on the dry side....\nreally love asian inspired flavors in brunch foods\nloved all the food we got, also the portions were quite big\nreally enjoyed the french kiss french toast..."},{"Name":"Wilder","Rating":3.9,"Address":"3154 Fillmore St, San Francisco, CA 94123","Categories":"New American, Comfort Food, Breakfast & Brunch","Latitude":37.798799,"Longitude":-122.435654,"Price":"$$","Reviews":"Good and fast service!... the food there is amazing while the chef and the waiting staff is very attentive!... I always ask the chef to surprise me with...\nI was only able to visit here for their Winter pop up and the drink menu is a true highlight, it has wide range of nicely crafted drinks that cater to a...\nBrunch:\nThe brunch menu was absolutely delicious. They have a great happy hour for brunch with $5 mimosas (you can only order 2 per person though). The food..."},{"Name":"L'mida","Rating":4.0,"Address":"2359 Chestnut St, San Francisco, CA 94123","Categories":"Mediterranean, Moroccan","Latitude":37.799796,"Longitude":-122.442139,"Price":"$$","Reviews":"Dining at this Moroccan gem was a truly enchanting experience. The moment I stepped in, I was captivated by the rich and inviting ambiance that evoked the...\nL'Mida is a gorgeously elegant restaurant serving a fine dining take on Moroccan cuisine. The spacious, colorful, cozy interior featured lots of decorations...\nHave you ever wanted to throw your hard earned money off a random cliff? Yes? Well, paying for your meal at L'Mida is exactly like that.\nThe food was..."},{"Name":"Casaro Osteria","Rating":4.4,"Address":"2136 Union St, San Francisco, CA 94123","Categories":"Pizza, Cocktail Bars","Latitude":37.797457,"Longitude":-122.434507,"Price":"$$","Reviews":"food was delicious. service impeccable, lovely decor, \nsat indoors and watched food preparation by four chefs. \noffer small plates perfect for sharing...\nI really enjoyed my experience at Casaro Osteria! Everything I ate was a 10\/10 and we had great service. \nMy party of four waited around a hour at 6p on...\nWonderful food! We got take out, so can't speak too much about service, but the hostess and bartenders were friendly upon my arrival for pick up. \nWe got..."},{"Name":"Causwells","Rating":4.2,"Address":"2346 Chestnut St, San Francisco, CA 94123","Categories":"New American, Burgers, Breakfast & Brunch","Latitude":37.8001342714,"Longitude":-122.4419838935,"Price":"$$","Reviews":"Love this restaurant. They have maybe the best drinks in the city \nMaybe best smash burger in sf \nLovely space on marina district\nUnderwhelmed with the American burger we got here. This is just mine and my group of 7 people's opinion and maybe this will de influence the hype around...\nI went here around 3:20pm for lunch on a Saturday and there was no wait!\nWe ordered the Breakfast Sandwich w\/ Fries and the Americana Burger w\/ Crispy..."},{"Name":"Blue Whale Restaurant & Lounge","Rating":4.3,"Address":"2033 Union St, San Francisco, CA 94123","Categories":"Lounges, Pan Asian","Latitude":37.797284,"Longitude":-122.432876,"Price":"$$","Reviews":"This place is a must eat! It is truly a gem in SF. The food is absolutely delicious, cooked to perfection and the presentation is pleasing. My personal...\n\"We recommend you order 10-13 dishes for your party of 5\"\nUs: ok \n actually, we wished we ordered one of everything on the menu because it was THAT good....\nWhat a hidden gem in the Marina!\nThey totally re-did the old Osha Thai restaurant into a cute, cozy, trendy but very comfortable Asian fusion spot.\nWe..."},{"Name":"ILCHA","Rating":4.3,"Address":"2151 Lombard St, San Francisco, CA 94123","Categories":"Korean, Bars","Latitude":37.79948,"Longitude":-122.43681,"Price":"$$","Reviews":"Korean American fusion cuisine. Sexy upbeat ambiance. The service was accommodating and really attentive. Food was obviously the best part! \n \nMarinated raw...\nthe Kim Mari (fried seaweed spring rolls) were served hot and crispy, filled with plenty of glass noodles. they taste great with the gochujang dipping...\nHot take - 2.5 stars, don't understand the hype\nOysters & Bossam - 2\/5, oysters were sweet but the Bossam was just not it, it was just plainly steamed..."},{"Name":"Norcina","Rating":4.3,"Address":"3251 Pierce St, San Francisco, CA 94123","Categories":"Italian, Pasta Shops, Pizza","Latitude":37.80009,"Longitude":-122.43973,"Price":"$$$","Reviews":"This is absolutely one of my favorite place is SF to eat! The ambiance is so warm and welcoming.  The staff is amazing, attentive and friendly, and the chef...\nThis place is a great neighborhood restaurant. Food is amazing (chopped salad, Calabrian wings, liver toast- unreal- rigatoni norcina- don't miss). Kait and...\nI have so many wonderful things to say about Norcina. I've dined here several times. It is my go-to restaurant every time I am in the city and I always have..."},{"Name":"Cracked & Battered - Marina","Rating":4.6,"Address":"2240 Chestnut St, San Francisco, CA 94123","Categories":"Breakfast & Brunch, New American, Halal","Latitude":37.80048,"Longitude":-122.44014,"Price":"$$","Reviews":"Delicious food\nWelcoming environment \nFriendly and Kind staff\nBest brunch in SF! \nThank you\nI came here on a Friday early morning off work to get some brunch and read my book - this is a peaceful place if you come before 10am! \nThe servers were so...\nCracked & Battered is a cute little brunch spot, right in the heart of the Marina District. There was a lot of natural light, which gave this small..."},{"Name":"The Patio","Rating":4.6,"Address":"3232 Scott St, San Francisco, CA 94123","Categories":"Wine Bars, New American, Venues & Event Spaces","Latitude":37.79976,"Longitude":-122.44082,"Price":"$$","Reviews":"The food and drinks are really good. And especially the service, the servers are really nice ! Always attentive at all times ! I recommend the Mac N Cheese...\nReally nice wine bar\/lounge indoors and cozy outdoor patio area with heat lamps and a fire pit. There's a resident cat named Oreo who lounged around with us...\nVisited for friends gathering and we had a good time here. \nThe sever was very friendly and the service was good. \nHowever the height of the table and the..."},{"Name":"Delarosa Marina","Rating":4.0,"Address":"2175 Chestnut St, San Francisco, CA 94123","Categories":"Italian, Cocktail Bars, Pizza","Latitude":37.800287,"Longitude":-122.4391102245,"Price":"$$","Reviews":"Just dined at Delarosa, Will was the best. Got a bunch of apps has a great meal. We had a Caesar salad, herb bread w balsamic, crab Arancini, some of the...\nGreat food, good ambiance and excellent service. We try to eat here at least once a week.\nIve been here several times and each time i am impressed with their food. One could go there and have just apps! \nThe eggplant app is so yummy! Pine nuts,..."},{"Name":"United Dumplings","Rating":4.4,"Address":"2015 Chestnut St, San Francisco, CA 94123","Categories":"Chinese, Noodles, Asian Fusion","Latitude":37.800599,"Longitude":-122.436533,"Price":"$$","Reviews":"On Friday night, I walked in to this Marina location of United Dumplings and was immediately recognized by United Dumplings' staff member, Steven. I was so...\ngot the sichuan dan dan noodles (flavor was good but the texture of the noodles was a bit off imo) \nfood came out extremely fast tho\nSome relatives checked in around 8pm on Xmas evening and normally bustling Lombard was dead.  Everyone had closed ultra early.  We didn't want to drive to..."},{"Name":"Flores San Francisco","Rating":4.1,"Address":"2030 Union St, San Francisco, CA 94123","Categories":"Mexican, Cocktail Bars, Breakfast & Brunch","Latitude":37.7976161049,"Longitude":-122.4325805902,"Price":"$$","Reviews":"Flores totally blew me away! The vibe there is so cozy and inviting, making it the perfect spot for a memorable meal. And let's talk about the food - wow!...\nThis restaurant is exceptional.\nThe food is authentic and decently priced. The decor, lighting, and service are also all amazing. I truly feel like I am on...\nGreat Happy Hour Deals. Friendly Staff. Lively Ambiance. Indoor & Outdoor Seating. Tasty Dishes & Drinks, Meeting My Latina Standards Lol. Paid Meter..."},{"Name":"Cultivar","Rating":4.3,"Address":"2379 Chestnut St, San Francisco, CA 94123","Categories":"New American, Wine Tasting Room, Venues & Event Spaces","Latitude":37.79981,"Longitude":-122.4424,"Price":"$$","Reviews":"Cute place, great wine, delish pork belly tacos and truffle popcorn. We had two waiters who were sweet as could be. Def going to go again!\nAfter walking around the city all day, I felt like having a sit with some drinks, so I dragged my friend over to Cultivar. He didn't have any wine. Instead,...\nthe back patio is a cute spot to enjoy a glass or two. ambiance is nice, especially if the weather allows. we had no trouble making a last minute..."},{"Name":"Popi's Oysterette","Rating":4.3,"Address":"2095 Chestnut St, San Francisco, CA 94123","Categories":"Seafood, Live\/Raw Food","Latitude":37.8005042,"Longitude":-122.4377218339,"Price":"$$","Reviews":"Popi's is great!! My boyfriend and I just moved back to the city a couple months ago and we've already been there 4 or 5 times. Food is great, especially...\nWhat a charming little oyster cove! Popi's was amazing, delivering more than just a fine seafood dinner. We started with two glasses of that delicious...\nI love going to Popi's typically on a sunny weekend day, but found myself there on a weekday lunch as they are one of the only restaurants in the Marina..."},{"Name":"Baan Yaai","Rating":4.4,"Address":"2274 Lombard St, San Francisco, CA 94123","Categories":"Thai, Noodles, Chicken Wings","Latitude":37.799676,"Longitude":-122.438929,"Price":"$$","Reviews":"a cozy little spot just a stone's throw away from the bustling Chestnut St for those who want more peace and some comfort food. the staff are very friendly...\nPopped in for dinner because it was next to our hotel. We were the only ones in the restaurant and I'm not sure why....this place was so so good!! The...\nOne of the best Thai spots in the Marina for sure. My friends came across this spot on Yelp by chance since it was in walking distance-- we were..."},{"Name":"Boho Restaurant","Rating":4.5,"Address":"3321 Steiner St, San Francisco, CA 94123","Categories":"New American, Modern European, Seafood","Latitude":37.800039,"Longitude":-122.438105,"Price":"$$","Reviews":"My friend and I were trying to go to a different restaurant nearby but forgot to make a reservation. We had to walk around for a new place to eat and...\nSuper disappointed to have to leave a poor Yelp review on an establishment that I gave a second chance to. I was really hopeful, especially because this...\nA recent but appreciated addition to San Francisco's dining scene. I stopped in for dinner for the first time after previously enjoying their delightful..."},{"Name":"Komeya No Bento","Rating":4.8,"Address":"3137 Laguna St, San Francisco, CA 94123","Categories":"Japanese","Latitude":37.80007,"Longitude":-122.43134,"Price":"$$","Reviews":"Came here 30 mins before closing and the restaurant was popping off! Unfortunately, I didn't get to try the food this time as they were sold out for the day...\nSolid bentos and good portions! Primarily for to go bentos as there is limited indoor seating\nDelicious bento! We got the duck breast with dashi and truffle soy salmon bento, and matcha lattes (complimentary with Yelp Checkin for a limited time) -..."},{"Name":"Cote Ouest Bistro","Rating":4.7,"Address":"2953 Baker St, San Francisco, CA 94123","Categories":"French","Latitude":37.798332,"Longitude":-122.446101,"Price":"$$","Reviews":"What a fantastic place. \nFood: low key. Great tried and true dishes. No hype. Just fantastic food. Every plate was good. My god the mussels... i can eat...\nI had $75 a day to expense for my company work trip, so you already know I was looking to BODY some Steak Frites.\nMy two big bros and I came here for our...\nThe service was 10\/10\nThe food was 6.5\/10. Good but not life changing. Highlights were crème brûlée and escargot. Would have expected a longer wine list...."},{"Name":"Home Plate","Rating":3.9,"Address":"2150 Lombard St, San Francisco, CA 94123","Categories":"Breakfast & Brunch","Latitude":37.7999050609,"Longitude":-122.4371697,"Price":"$$","Reviews":"Great food, service and atmosphere. The chicken and waffles Benedict is delicious! Definitely recommended if you're in the areas.\nI'd give 10 stars if I could. Came in on Christmas and got A1 service. Treated like royalty the entire time. Server was very kind and our cups were refilled...\nGood solid spot for brunch in the Marina. Be ready for a long wait specially on the weekends.\nI like the vibe of this place, it's spacious and modern. The..."},{"Name":"Napizza","Rating":4.6,"Address":"3258 Scott St, San Francisco, CA 94123","Categories":"Pizza, Pasta Shops, Salad","Latitude":37.80003,"Longitude":-122.44083,"Price":"$$","Reviews":"Everything was fabulous. From the pizza to the French Fries everything was fire! The pizza was perfectly cooked and is probably one of the best pizza places...\nCame with a group of 7 and were seated promptly with a reservation.\nWe ordered 2 Truffle Waffle Fries, Fettucine Alfredo, Fettucine al Samone, Pizza...\n===TL;DR===\n- Truffle waffle fries\n- Mozzareila in Carrozza\n- Lasagna Bianca\n- Salsiccia Pizza \n- Capricciosa Pizza \n- Pesto pizza \n- Aperol Spritz..."},{"Name":"Nippon Curry featuring Hinoya Curry","Rating":4.5,"Address":"3347 Fillmore St, San Francisco, CA 94123","Categories":"Japanese Curry","Latitude":37.8005067062,"Longitude":-122.4364719,"Price":"$$","Reviews":"This place always impresses and their curry is phenomenal. I drive from San Jose just for their karaage which is absolutely perfect. Crunchy, tender, moist...\nIt was a really long day at work. Something about it just left me devastatingly tired and all I could want to do is stay at home and do absolutely nothing....\nThis place is a MUST TRY!! I was pleasantly surprised at how spacious the restaurant is. You order at the front counter and bring your tray of food to a..."},{"Name":"Souvla","Rating":3.9,"Address":"2272 Chestnut St, San Francisco, CA 94123","Categories":"Greek, Mediterranean","Latitude":37.80038,"Longitude":-122.44092,"Price":"$$","Reviews":"We've been coming to Souvla for a long time now, both before and after my wife and i visited Greece together (if that's any context...). The gyros (remember...\nSo so good! I'm always skeptical ordering salads from restaurants but the chicken salad SLAPPED like no other. \nThe chicken was warm, the sauce was perfect...\nA SF staple, with multiple locations throughout the city. \nMy go to is the chicken salad. You must always get a side of fries, they are always super fresh,..."},{"Name":"Ly's Vietnamese Cuisine","Rating":4.3,"Address":"1779 Lombard St, San Francisco, CA 94123","Categories":"Vietnamese","Latitude":37.80029,"Longitude":-122.43063,"Price":"$$","Reviews":"Very good noodle soups try the sate beef spicy but very tasty. Service is fine, place is plain but, clean.\nGreat service. And great food! Looks like a hole in the wall spot but definitely worth trying out if you are in the mood for a Vietnamese food!\nLove this place! We called 15 minutes before closing on a Sunday to place a pickup order and we were pleasantly surprised that they took our order and let..."},{"Name":"Greens Restaurant","Rating":3.8,"Address":"2 Marina Blvd, Bldg A, Fort Mason, San Francisco, CA 94123","Categories":"Vegetarian, Vegan, Gluten-Free","Latitude":37.8066580336,"Longitude":-122.4321003274,"Price":"$$$","Reviews":"We ordered their potato cauliflower pizza, butternut squash soup, Japanese pancake, and beet salad. Food was delicious, I would highly recommend the early...\nI visited Greens for the first time a few weeks ago, and I thought it was a pretty solid restaurant! The location is quite nice, next to the water and I...\nI've visited Greens Restaurant multiple times with my partner and in smaller groups and have absolutely loved every moment of it.\nBeing a vegetarian, I'd..."},{"Name":"Palm House","Rating":3.9,"Address":"2032 Union St, San Francisco, CA 94123","Categories":"Breakfast & Brunch, Hawaiian, Cocktail Bars","Latitude":37.797676,"Longitude":-122.432988,"Price":"$$","Reviews":"I hosted an event here for 40 people and everyone absolutely loved this location. The vibe was island chill, which was great because it had been so cold all...\nThird time here on a Saturday morning. Got here about 8 minutes before kitchen opened and they said we were free to hang out and do whatever. They do have a...\nLovely decor! Everything about this place is so aesthetic. \nThe food was not as good as the ambiance imo. The food looked beautiful; the flavor just didn't..."},{"Name":"The Italian Homemade Company","Rating":4.3,"Address":"1919 Union St, San Francisco, CA 94123","Categories":"Italian, Pasta Shops, Desserts","Latitude":37.79742,"Longitude":-122.43097,"Price":"$$","Reviews":"Fresh pasta was so delicious!\nWe got sage and butter. Simple and fresh. Savory and healthy. \nCassone (?) Stuffed sandwich was also great. The bread...\nI heard of this place through Tiktok and thought I'd give it a try. The Italian Homemade Company is known for make your own pasta plates, where you can...\nMy wife and I are in town on a business trip and found this place as we were wanting Italian. She ordered the lasagna.  She said it tasted 'okay' but missed..."},{"Name":"Las Mestizas","Rating":4.6,"Address":"2280 Chestnut St, San Francisco, CA 94123","Categories":"Breakfast & Brunch, Mexican","Latitude":37.80038,"Longitude":-122.44092,"Price":"$$","Reviews":"This is a little \"hole in the wall\" but clean and well lit.  You walk in and order at the counter.  Our order taker was very friendly and she helped us to...\nExcellent Mexican restaurant in the Marina. I stopped in spontaneously on a Sunday afternoon after my workout class. I got a chicken soup. My partner got a...\nFive stars for the homemade tortillas in the tacos here! I actually don't believe I've ever had homemade tortillas in SF so this was awesome! I ordered the..."},{"Name":"Montesacro Marina","Rating":4.2,"Address":"3317 Steiner St, San Francisco, CA 94123","Categories":"Italian, Wine Bars, Cocktail Bars","Latitude":37.79991,"Longitude":-122.43804,"Price":"$$","Reviews":"My sisters were at Montesacro last week to celebrate a birthday and agreed with me that it's the best food with superior service. Hope to return soon!\nphenomenal!\nWe've been to Montesacro for Dinner and brunch. The cocktails and wine list is excellent. The service is impeccable and the staff is so...\nReally adorable Italian restaurant in the Marina! \nI think the biggest reason I liked this place was because of the ambiance. The restaurant is on the..."},{"Name":"Twisted St. Cafe","Rating":4.6,"Address":"2320 Lombard St, San Francisco, CA 94123","Categories":"Breakfast & Brunch, Coffee & Tea, Bagels","Latitude":37.79965,"Longitude":-122.43984,"Price":"$$","Reviews":"One of my new favorite cafes in the Marina!\nDiscovered this hidden gem earlier this morning and was very impressed. First, upon walking in, I notice that...\nWe stumbled upon this adorable coffee shop on our way to Sonoma! It was pretty busy at about 2pm on a Saturday.\nWe ordered:\n+ Bagels with bacon, cream...\nDon't miss this hidden gem in San Francisco \nThe best avocado toast with the most bang for your buck. 4 years ago I stumbled upon this place thru yelp, and..."},{"Name":"Roaming Goat","Rating":4.6,"Address":"1830 Union St, San Francisco, CA 94123","Categories":"Wine Bars, Mediterranean, Armenian","Latitude":37.79798,"Longitude":-122.42952,"Price":"$$","Reviews":"I've been here 3-4 times before, but last night I got\npictures of all my favorite dishes so I thought I'd finally write my review for Roaming Goat. \nWords...\nGreat late night classy vibes - service was excellent in helping us navigate the extensive wine menu and provided ample small plate\/spread recommendations....\nReally enjoyed my dinner at Roaming Goat with my friend. We ordered two glasses of wine  and ask the serve recommendations. I can't quite remember which..."},{"Name":"Pacific Catch","Rating":4.1,"Address":"2027 Chestnut St, San Francisco, CA 94123","Categories":"Seafood, Sushi Bars, Tacos","Latitude":37.80057,"Longitude":-122.43652,"Price":"$$","Reviews":"My first time at a Pacific Catch, even though I'm from SoCal and we have these everywhere down there. I think it's a pretty solid offering for a...\nPacific Catch is a solid seafood chain restaurant. It has several locations around the Bay Area. It's a solid choice as they have super fresh fish, sizeable...\nEveryone should visit Pacific Catch. I really enjoyed the environment and ambiance of the restaurant and the staff is really friendly."},{"Name":"The Interval At Long Now","Rating":4.3,"Address":"2 Marina Blvd, Bldg A, Fort Mason Centre, San Francisco, CA 94123","Categories":"Museums, Cafes, Cocktail Bars","Latitude":37.806587736,"Longitude":-122.4320808693,"Price":"$$","Reviews":"I love this hidden gem. Everything from the bartender, small plates and drinks were fantastic and had a great vibe!\nLove this bar, especially the cocktail Sunlight on a Foggy Afternoon. Such a great cocktail. I opted for Rye and it was a great choice. It's well balanced...\nDrinks were very good! I love the location and we studied at the room in the back and it was def a great study spot. I totally love the views out the window..."},{"Name":"Tacolicious","Rating":3.7,"Address":"2250 Chestnut St, San Francisco, CA 94123","Categories":"Cocktail Bars, Tacos","Latitude":37.8004125,"Longitude":-122.4404725,"Price":"$$","Reviews":"Ambiance: Lively and fun!\nService: Wonderful, but one of our item never came out, but the waiter comp us a taco.\nFood: Good overall. Drinks are fairly good...\n2 of us ate dinner here on Tuesday. 1 Guacamole appetizer. 1 house wine. A Coke. 4 tacos each. ~$120 with tip.\nThe food and service were good. Bottom line:...\nI'm not sure why you would put two seats at the bar right next to the register and then later tell us we can't sit there because \"we will be in and out [at..."},{"Name":"Nick's Crispy Tacos","Rating":3.8,"Address":"3200 Fillmore St, San Francisco, CA 94123","Categories":"Mexican","Latitude":37.79915,"Longitude":-122.43569,"Price":"$$","Reviews":"The reviews on Yelp were accurate! Nick's Crispy Tacos was tasty, delicious and absolutely filling! \nTheir tacos include golden pinto beans! They fill...\nWas let down and definitely confused how they have such high ratings\nEven though I was not a fan of service, this review is focused on the reviews. Not...\nWorth the visit on Tuesday and Fridays for the deals, since it's a pretty good value. The tacos are HUGE, if you got 2 tacos and got them Nick's way (cheese..."},{"Name":"Wildseed","Rating":4.5,"Address":"2000 Union St, San Francisco, CA 94123","Categories":"Vegan, Cocktail Bars","Latitude":37.79768,"Longitude":-122.43245,"Price":"$$","Reviews":"What a wonderful time at Wildseed!\nWe got there just in time for their Happy Hour and with so many great choices, we were surprised there was seating...\nCausal swanky vibes. Reservation required on a Friday eve\nI'm primarily a plant-based eater and my bf took us here for our anniversary and I thought the...\nNot to give any praise to the marina but this place was amazing. We stumbled in after getting our eardrums blown out at blue light when we accidentally went..."},{"Name":"Howells","Rating":4.6,"Address":"2373 Chestnut St, San Francisco, CA 94123","Categories":"Wine Bars, American","Latitude":37.79979,"Longitude":-122.44231,"Price":"$$","Reviews":"Fun wine bar with a screen so you can catch the game if you'd like. There's an upstairs seating area too. Dog friendly if you have a well behaved pooch....\nI met a friend here on a Friday around 6:30pm and it was very crowded but we ended up being able to snag two seats at the bar. I think it was more crowded...\nA long overdue review.. .. \nHowells is a neighborhood gem and the owner Nate is amazing!!  I love Howells!! I've known Nate for several years & always try..."},{"Name":"Westwood","Rating":3.8,"Address":"2036 Lombard St, San Francisco, CA 94123","Categories":"New American, Barbeque, Cocktail Bars","Latitude":37.800134,"Longitude":-122.435478,"Price":"$$","Reviews":"This review is only for their Christmas pop-up \"Naughty not Nice\" bar located downstairs from the main bar. \nTickets are required via sfbucketlist but...\nEven if you aren't a Christmas fan, the Westwood holiday pop up will make you change your mind. \nFun little Christmas decor, Christmas themed (and...\nCame here for the Naughty or Nice holiday pop up and was blown away!!! I absolutely loved it! The drinks were so festive and creative! And the decor was SO..."},{"Name":"Sacred Taco","Rating":4.2,"Address":"1875 Union St, San Francisco, CA 94123","Categories":"Tacos, Cocktail Bars","Latitude":37.7977972059,"Longitude":-122.4301132752,"Price":"$$","Reviews":"What a great find!  We had a reservation at Colibri, but due to the storms, they lost power and closed before our reservation.  I quickly pulled out my...\nOne of the worst restaurant experiences I have had in years. We ordered a pitcher which is supposed to have 4 drinks and 2 of our glasses were half full and...\nThis was incredibly disappointing. The place was clean enough but at immediate glance, food storage guidelines were not good as the tomatillos were in a box..."},{"Name":"Ristobar","Rating":3.8,"Address":"2300 Chestnut St, San Francisco, CA 94123","Categories":"Bars, Italian, Pizza","Latitude":37.80035,"Longitude":-122.441487,"Price":"$$","Reviews":"Food ordered was burrata, arancini, insalata and the Cavatelli pasta. In total be aware this is a small portion kind of place - especially for the apps. The...\nExcellent Bronzino and salmon dishes . Authentic northern Italian fair ( roasted potatoes are outstanding) \n\nFair prices with excellent caring service....\nRistobar, an Italian restaurant located in San Francisco's Marina will make your dining experience truly memorable with their attention to service, nice..."},{"Name":"Lucca Delicatessen","Rating":4.2,"Address":"2120 Chestnut St, San Francisco, CA 94123","Categories":"Delis, Sandwiches, Cheese Shops","Latitude":37.80065,"Longitude":-122.43836,"Price":"$$","Reviews":"One of my favorite sandwich places in the city! It's delicious and the service is always good.\n\nI wish the place had a sitting area  but it's great if...\nSometimes I watch a PBS cooking show with local chef Joanne Weir. In one episode, she visited her favorite deli, and it looked like the type of popular spot...\nI've long heard about this deli but this has not been a neighborhood that I frequent very often.  When I do, it's mainly at night for dinner.  \n\nIn helping..."},{"Name":"Ollei","Rating":4.5,"Address":"2127 Polk St, San Francisco, CA 94109","Categories":"Korean, Comfort Food, Asian Fusion","Latitude":37.796378,"Longitude":-122.422173,"Price":"$$","Reviews":"Mmm tasty yummy mmm a pristine establishment with ideal cocktails. Thank you ollei, thank you ollei\nI like this pleasant, low frills place. One of the most flavorful Korean vegetarian tofu soup options in the city and relatively inexpensive. Maybe...\nWent in on a Friday early evening. Greeted and seated quickly. We were the only ones there. \n\nOrdered sake and beers. Pretty tasty. \n\nThe pot stickers were..."},{"Name":"Brazen Head","Rating":4.1,"Address":"3166 Buchanan St, San Francisco, CA 94123","Categories":"Steakhouses, Gastropubs, American","Latitude":37.7993037,"Longitude":-122.4322957,"Price":"$$$","Reviews":"Amazing hidden gem in the marina! Came here on date night and really enjoyed the moody ambiance + local feel. There are no reservations and the place was...\nBrazen head is one of those IYKYK spots in the marina. It's very unassuming while it sits on the corner of a residential block without much street appeal....\nMy 1st visit was so exceptional, I have been back 1 more time since.\nMy friend introduced me, otherwise I don't think I would know anything about it. It's..."},{"Name":"Bluestone Lane","Rating":4.0,"Address":"3352 Steiner St, San Francisco, CA 94123","Categories":"Coffee & Tea, Gluten-Free, Breakfast & Brunch","Latitude":37.80044,"Longitude":-122.43756,"Price":"$$","Reviews":"Healthy and fresh food and very cute vibe inside! Great coffees and pretty big menu. They post all the allergies and nutritional information which is very...\nI didn't think cooking eggs was so hard yet here we're are. \n\nThe inside is fairly nice and the staff are cordial, but this place fell well short of my...\nCute little (new?) spot in the marina.  The process of getting seated for brekky vs just ordering from the cafe is a little unclear but the staff is really..."},{"Name":"Terzo","Rating":4.2,"Address":"3011 Steiner St, San Francisco, CA 94123","Categories":"Mediterranean, Tapas\/Small Plates","Latitude":37.7971,"Longitude":-122.43744,"Price":"$$$","Reviews":"Overall, it extremely yummy. The steak was phenomenal. And it had these potatoes with it that were soooooo good. I was sharing them with a group and I so...\nWhat a phenomenal SF Restaurant Week! The menu is creative with fresh ingredients (seasonal highlights too). Would certainly recommend on food alone...\nWe are fairly new to Terzo, We've been coming since they reopened during the pandemic. We have had absolutely fantastic experiences with service in the past..."},{"Name":"Rise Over Run","Rating":4.1,"Address":"33 Turk St, San Francisco, CA 94102","Categories":"New American, Cocktail Bars","Latitude":37.78325,"Longitude":-122.40965,"Price":"$$","Reviews":"Fancy rooftop dining at the top of the LINE hotel. Can be difficult to find, had to ask the lobby front deck how to navigate. Gets busy, so helps to book a...\nThe food on brunch menu was just not a hit with me. Just seemed like a strange mix of brunch food options.\nThe ambiance with pano view of SF was beautiful....\nCame for brunch on a Sunday. It wasn't too busy but we made a reservation just in case. Great ambience outside and inside. Definitely recommend sitting..."},{"Name":"Bodega","Rating":4.4,"Address":"138 Mason St, San Francisco, CA 94102","Categories":"Vietnamese, Noodles","Latitude":37.7848378589,"Longitude":-122.4093022,"Price":"$$","Reviews":"Amazing food. It's really wonderful to see how good Vietnamese food can be with a good budget. I really enjoyed every dish and the drinks.\nFood service and...\nHidden gem for Vietnamese food tucked away by the TL. Initially walked passed the front trying to find the restaurant at first. It kind of looks like a hole...\nI mean... Bodega might be one of my favorite Vietnamese restaurants in SF. \nSERVICE:\n- Disclaimer: I've only eaten at Bodega for lunch\n- The service is..."},{"Name":"Delarosa Downtown","Rating":3.9,"Address":"37 Yerba Buena Ln, San Francisco, CA 94103","Categories":"Pizza, Italian, Cocktail Bars","Latitude":37.7856622557,"Longitude":-122.4042726199,"Price":"$$","Reviews":"Food is always amazing here! The pappardelle is delicious! And I love their Brussel sprouts. The carbonara was interesting, it was like a breakfast pizza....\nWhat truly stands out is the attention to detail in both presentation and taste. The pizzas, with their perfectly thin and crispy crusts, are adorned with...\nJust a block away from the SOMO museum and Yerba Buena Gardens, Delarosa is a \"somewhat hidden\" gem. \nThere is plenty of pizza and pasta and modern Italian..."},{"Name":"Corzetti","Rating":4.2,"Address":"398 Geary St, San Francisco, CA 94012","Categories":"Wine Bars, Italian, Cocktail Bars","Latitude":37.7873265386,"Longitude":-122.4097414,"Price":"$$$","Reviews":"Went for drinks, should have stayed for dinner. \nAmazing ambience and delicious drinks! Really can't wait to come back for round 2\nOverall, this is one of my favorite restaurants. \nTip: come here with people who like conversation because there is a lot of down time from start to...\nCame here for a late lunch and I would recommend for drinks and appetizers and perhaps waiting for dinner when they have a more extensive menu. I was most..."},{"Name":"Kin Khao","Rating":3.8,"Address":"55 Cyril Magnin St, San Francisco, CA 94102","Categories":"Thai","Latitude":37.78524,"Longitude":-122.40933,"Price":"$$$","Reviews":"During our long layover in San Francisco, our group of 4 ate dinner at Kin Khao. It was a rainy Saturday evening, and the restaurant was fully booked....\nKin Khao has been on my list for ages and it didn't disappoint! I snagged a reservation earlier this week to celebrate my birthday and was delighted by all...\n- caramelized pork belly was the best I've ever had \n- the roasted delicata squash was perfect in texture, sweetness and spice\n- the namprik long rua was..."},{"Name":"Mariposas ","Rating":4.6,"Address":"825 Mission St, San Francisco, CA 94103","Categories":"Peruvian","Latitude":37.783854731,"Longitude":-122.4047721,"Price":"$$","Reviews":"My family and I (plus family friends, total of 8) had gone to Mariposas for a last minute dinner. Made a reservation 2 hours before. We got there and were...\nExcellent place for lunch close to the Metreon. Authentic flavors, great staff, high quality food and a good price. Great place for kids as well.\nWe had the ceviche carretillero and chicken empanadas and both were excellent. The empanadas may well be the best ones I ever had"},{"Name":"The Rotunda","Rating":3.9,"Address":"150 Stockton St, San Francisco, CA 94108","Categories":"New American, Cocktail Bars, Beer Bar","Latitude":37.7874117371,"Longitude":-122.4063564516,"Price":"$$$","Reviews":"My friend was visiting from Hawaii & made reservations at The Rotunda for high tea. It's a beautiful setting with a stained glass ceiling. We were seated...\nThe rotunda has been a staple in my life for AWHILE; that being said.. \nservice: impeccable\nFavorite: high tea service\nAdded feature: bar service. The bar...\nThe food was nothing special. You get a savory and sweet scone. Croissant with chicken, salmon, and cucumber flat toast. And you get five desserts. Keep in..."},{"Name":"Tad’s Steak House","Rating":4.0,"Address":"38 Ellis St, San Francisco, CA 94102","Categories":"American, Steakhouses, Breakfast & Brunch","Latitude":37.785729,"Longitude":-122.406891,"Price":"$$","Reviews":"Beau and I decided to make a trip out to downtown on a Friday afternoon for a small shopping and dining venture. We dined at Tad's Steak House, and the...\nMy Dad started coming here in the 1950's and always loved this place for a good steak dinner for a reasonable price.\nHe would eventually bring our family...\n11\/22\/2023\n*DOOR DASH DELIVERY REVIEW*\nWe were too lazy to leave the hotel and hubby wanted steak, so we ordered via DoorDash.  The food was delicious and..."},{"Name":"PLS on Post","Rating":4.4,"Address":"545 Post St, Hotel Zeppelin, San Francisco, CA 94102","Categories":"American, Bars","Latitude":37.787878673,"Longitude":-122.4107985153,"Price":"$$","Reviews":"Food was amazing !\nDrink menu is great!\nShakes are a must!\nHidden gem next to the JW Marriott Hotel.\nPLS on Post is actually located inside\/outside of the...\nSmall bar \/ burger joint attached to fun looking hotel.  Being a local, I've never actually stayed at the hotel, but seems to have a lot more rocking...\nI came in on a Monday evening with two friends around 8:30PM. Not too many people were in when we first came in but slowly started to fill up as we went on..."},{"Name":"The Harlequin","Rating":4.1,"Address":"68 4th St, San Francisco, CA 94103","Categories":"Cocktail Bars, Venues & Event Spaces, New American","Latitude":37.784896,"Longitude":-122.405047,"Price":"$$$","Reviews":"First time at The Harlequin, we were a walking party of two  & our eyes got catch for the decoration... we got seated for Laste and she checked on our table...\nWe went here with a group of 5 friends, and we had a blast. The selection of drinks is wide so you pretty much have enough options for different preferences...\nMy experience at The Harlequin on Valentine's Day was a mix of highs and lows. The Black Pink Margarita was a visually appealing and well-balanced cocktail...."},{"Name":"Burma Love - Downtown","Rating":4.2,"Address":"8 Mint Plz, San Francisco, CA 94103","Categories":"Burmese, Cocktail Bars, Seafood","Latitude":37.782909,"Longitude":-122.40786,"Price":"$$","Reviews":"I've come to realize that this is THE best Tea Leaf Salad that I've found on planet earth. Plus the rest of the dishes are fantastic. It is a...\nFood: \nTea leaf salad\nShan noodles (tofu)\nDrinks: \nFresh young coconut\nEye of the Tiger \nService: took some time for a waiter to get to us after being...\nAfter visiting the sister location in Berkeley and having a good experience there, I was expecting something similar at this location. Overall, the food is..."},{"Name":"HINODEYA Ramen Bar","Rating":4.2,"Address":"219 O'Farrell St, San Francisco, CA 94102","Categories":"Ramen, Noodles, Breakfast & Brunch","Latitude":37.786204,"Longitude":-122.408475,"Price":"$$","Reviews":"The people here are very considerate and so sweet! The broth was AMAZZZING. I had the Spicy Miso Ramen and it didn't disappoint. Ramen is a hit or miss....\nHad a wonderful creamy vegan ramen! Loved this dish and the vibes here. \nIt came with tofu skin, kabocha, wheat noodles, fried spinach, bell peppers,...\nI absolutely adore this Ramen spot every time I visit the city! One of the main reasons is their convenient closing time at 1:30am, perfect for satisfying..."},{"Name":"The View Lounge","Rating":4.1,"Address":"780 Mission St, San Francisco, CA 94103","Categories":"Lounges, Cocktail Bars, Tapas\/Small Plates","Latitude":37.785343,"Longitude":-122.404401,"Price":"$$","Reviews":"Great view \nNice service \nGreat appetizers \nI had a lovely time here and all in all the view is the  best experience\nThe views and aesthetics of this bar are astonishingly beautiful, featuring a full skyline view set behind extremely dramatic arched windows that rise...\nMy teammates and I visited the view for drinks after work. It was a decent walk from our office: they were no window seats available for our party of 6 so..."},{"Name":"The Thonglor","Rating":4.3,"Address":"420 Geary St, San Francisco, CA 94102","Categories":"Thai, Desserts, Soup","Latitude":37.78726,"Longitude":-122.41038,"Price":"$$","Reviews":"Great food, have eaten here many times, never disappoints.\nUsually order the seafood noodle soup.\nThe food was pretty good. I got tomyum noodle. The restaurant is pretty small and busy during lunch time.  I believe that why i got pretty bad service. No...\nFast service and good fresh food for my family after a day at the Exploratorium. Not a fancy place, but a small simple place."},{"Name":"Tropisueño","Rating":3.9,"Address":"75 Yerba Buena Ln, San Francisco, CA 94103","Categories":"Cocktail Bars, Tacos","Latitude":37.7853008468,"Longitude":-122.4039186537,"Price":"$$","Reviews":"Really nice Mexican spot adjacent to the Marriott Marquis and near Moscone center.\nA group of four were in for dinner and really enjoyed the...\nTropisueno in Yerba Buena lured me in with its vibrant atmosphere and promises of Latin American flavors. However, it fell short of my expectations. \nI...\nDismissive service. food is way too salty and somewhat overpriced also they only have such good reviews because they are bribing customers to review them..."},{"Name":"Matador","Rating":3.9,"Address":"679 Sutter St, San Francisco, CA 94102","Categories":"Mexican, Cocktail Bars","Latitude":37.78873,"Longitude":-122.41149,"Price":"$$","Reviews":"Now I love Mexican food. The flavors are always so...complex with spices and tenderness and of course, you can't always eat just one thing.\nMatador is...\nThe husband and I have been here too many times to count! He found this gem during the pandemic and fell in love with all of the tacos and the outdoor...\nGood place to grab a bite before a show at the Masonic. Food was mostly tasty.The tacos, quesadillas and plates were delicious. They have a huge Mexican..."},{"Name":"Johnny Foley's","Rating":3.9,"Address":"243 O'Farrell St, San Francisco, CA 94102","Categories":"Irish, Irish Pub","Latitude":37.7862083207,"Longitude":-122.4087536651,"Price":"$$","Reviews":"Great spot near union square. The Irish pub atmosphere is fantastic. Food,  especially the \"pub favorites\" are awesome and beautifully executed and...\nCame here on my bike hoping to see my partner play in the Santa con marching band. Instead of offering advice on where to put my bike, the greeter just...\nGreat bangers and mash, along with a solid beer selection. \nDon't forget to check out the piano bar while having a few whips"},{"Name":"The Post Room","Rating":3.9,"Address":"450 Powell St, San Francisco, CA 94102","Categories":"Cocktail Bars, Mediterranean, Seafood","Latitude":37.788994,"Longitude":-122.408354,"Price":"$$","Reviews":"It was a wonderful experience at Post Room, their service is superb and their food is top-notch while the ambiance have never see it in any place\nIt's new so I'll cut then slack by giving 4 stars. The service was fine but not great.\nThe maple butter that came with the buns was scrumptious.\nI enjoyed...\nAmbiance: 5\/5. Live music, dim lit room, and beautiful architecture. Really enjoyed dinner here\nService: 2\/5. This place is new, so things have to be..."},{"Name":"ONE65 Bistro","Rating":4.5,"Address":"165 O'Farrell St, Fl 3, San Francisco, CA 94102","Categories":"New American, French, Bars","Latitude":37.78638,"Longitude":-122.40736,"Price":"$$$","Reviews":"We had my wife's birthday dinner here on 12\/28\/23. Overall we had a flawless experience, and I feel like this place is a real hidden gem. Some...\nI'm glad to see The Bistro at ONE65 reopen after a long break! I'm a fan of their amazing Patisserie on the ground floor but had never ventured upstairs til...\nRounding out our tour of all of ONE65's unique restaurants was the trip to the newly renovated Bistro. Layout and decor here is similar to both Elements and..."},{"Name":"E&O Kitchen and Bar","Rating":3.8,"Address":"314 Sutter St, San Francisco, CA 94108","Categories":"Asian Fusion, Venues & Event Spaces, Noodles","Latitude":37.78983,"Longitude":-122.40586,"Price":"$$","Reviews":"Overall good experience.\nLocated downtown, large space with a terrific interior ambiance.\nModern asian-food style joint; the food wasn't anything...\nQuick overview: \nFood 4.5\/5\nService 3.5\/5\nDrinks 4.5\/5\nThis food is absolutely phenomenal. Some serious \"kudos\" to the chefs. Some of the highlights...\nIt was a cool spot in downtown San Francisco. The food was good although the fritter burger was impossible to eat as a burger. It was much too tall. I ended..."},{"Name":"54 Mint - Ristorante Italiano","Rating":3.8,"Address":"16 Mint Plz, San Francisco, CA 94103","Categories":"Italian, Cocktail Bars","Latitude":37.7827747,"Longitude":-122.4079449,"Price":"$$","Reviews":"Random Monday night, no reservation. Immediately seated at the bar. \nTo be honest, this isn't the type of restaurant I normally go to. I'm normally a $...\nFriendly service. We were planning on eating dinner elsewhere, but that place had a long wait, so we decided to come here. They were able to seat us...\nThis place is kinda hidden in a nice alley-like way by the mall (what's left of the mall anyway). The food & drinks were great; however, the service was..."},{"Name":"Ippudo San Francisco","Rating":3.8,"Address":"18 Yerba Buena Ln, San Francisco, CA 94103","Categories":"Ramen, Noodles, Soup","Latitude":37.7860991905,"Longitude":-122.4044835035,"Price":"$$","Reviews":"The food was great, not too salty but still had lots of flavor. It didn't take long to get a table, so the wait was not too long. Overall, the place is...\narrived during dinner time and was seated right away \ntruffle fries: were crispy and delicious \nkaraka spicy ramen: we subbed the thin noodles for the thick...\nThe food was quite disappointing actually. We ordered this special ramen of the day, To Do Karaage rice bowl and  To Go Ebi Mayo. It wasn't as good as we..."},{"Name":"Miller & Lux Provisions","Rating":3.8,"Address":"350 Powell St, San Francisco, CA 94108","Categories":"Desserts, Breakfast & Brunch, Cafes","Latitude":37.7878026004,"Longitude":-122.408035474,"Price":"$$","Reviews":"I've been seeing the Instagram-famous Miller and Lux soft serve croissant cones all over my Instagram feed and decided to check out the bakery for myself....\nThe prices are a bit steep, but the quality is solid. The desserts are beautiful and the pastries good. The interior is well designed and classy. The staff...\nMiller and Lux lives up to the hype. I visited the little shop based on an Instagram recommendation to try their soft serve ice cream in a croissant. To my..."},{"Name":"Hogwash","Rating":4.4,"Address":"582 Sutter St, San Francisco, CA 94102","Categories":"Gastropubs, Beer Bar","Latitude":37.78922,"Longitude":-122.40996,"Price":"$$","Reviews":"We got to Hogwash at 11 am and were so happy to be the first ones here! What a flavorful journey...fried avocado what??? Amaze balls!!! \nFrom the beet and...\nLove this place - especially mid week when it's not as crowded. Good food and tons of beer options. Super clean inside and I've never had bad service. \nFor...\nGood place to stop in for a cold one.  We wanted a couple of things on the menu, but they were out of them, so we stuck to the beer.  Nothing to complain..."},{"Name":"Bouche","Rating":4.3,"Address":"603 Bush St, San Francisco, CA 94108","Categories":"French","Latitude":37.790254,"Longitude":-122.407361269,"Price":"$$$","Reviews":"During the Focus on the Future conference (Marriott Marquis) in October, we hosted an executive business development dinner at Bouche on their...\nI came here with a group of friends and we had booked a large table on the second floor and expected a really fine dining experience with their French...\nA fancy meal without the intimidation of fancy restaurant etiquette! Felt like I was stepping into my aunt's intimate country cottage. We started off with..."},{"Name":"Aliment","Rating":4.0,"Address":"786 Bush St, San Francisco, CA 94108","Categories":"New American, American, Cocktail Bars","Latitude":37.79012,"Longitude":-122.41019,"Price":"$$","Reviews":"Trying to figure out why anyone wrote less than 5 stars at this place. The staff was absolutely amazing, and the food was ON POINT (hats off to the Chef)!...\nService is leaves a lot to be desired!  Bring me the cocktail and then bring me my food order. It's not usually brought out at the same time. We ordered...\nI thoroughly enjoyed the Grilled Pork Chop at Aliment. The pork chop, with its substantial thickness, was wonderfully juicy on the inside and perfectly..."},{"Name":"Mastro's Steakhouse","Rating":3.8,"Address":"399 Geary St, San Francisco, CA 94102","Categories":"Steakhouses","Latitude":37.7869427,"Longitude":-122.4095967,"Price":"$$$$","Reviews":"Came to the SF location with my girlfriend, and the entire experience was fantastic. Beautiful space, amazing food. Had the Oysters Rockefeller and the...\nFlew into San Fran for a weekend getaway and decided to have an intimate birthday party here for my daughter and was pleasantly surprised. Mastro's is very...\nThe service and food were absolutely amazing! What did I order? Please see below.\nDrinks - raspberry lemon drop.\nI've ordered many raspberry lemon drops in..."},{"Name":"Zevi Cafe and Bistro","Rating":4.7,"Address":"67 5th St, San Francisco, CA 94103","Categories":"Breakfast & Brunch, Mediterranean, Turkish","Latitude":37.7832609887,"Longitude":-122.4067612727,"Price":"$$","Reviews":"Zevi Cafe and Bistro proved to be a delightful oasis in the culinary landscape of San Francisco, offering an incredible and interesting take on...\nPretty nice restaurant interior for fast casual \/ counter service.  Reminds me a bit of Souvla.  The two spits of gyro meat, the stacked kind not the weird...\nWe stopped here for lunch when visiting Union Square in San Francisco. They have plenty of seating and on a Saturday afternoon there were not many people..."},{"Name":"O' by Claude Le Tohic","Rating":4.6,"Address":"165 O'Farrell St, San Francisco, CA 94102","Categories":"French, New American","Latitude":37.78638,"Longitude":-122.40736,"Price":"$$$$","Reviews":"This was such an incredible and creative dinner. \nI'm surprised that it only has one michelin star. \nFrom start to finish, every bite was cooked to...\nWhat an amazing experience! The first floor is a fabulous patisserie that rivals the best in all of France. A feast for your eyes and your palette! \nThe...\nI came on a date and didn't want to upset my date as he is not one into social media postings so I did not take pictures of any of the courses.   Only took..."},{"Name":"Happy Lamb Hot Pot","Rating":4.1,"Address":"405 Mason St, San Francisco, CA 94102","Categories":"Hot Pot, Chinese","Latitude":37.787367,"Longitude":-122.410103,"Price":"$$$","Reviews":"It's absolutely phenomenal! I thought it was going to be ridiculously expensive, especially because it was my first time in a hot pot restaurant that served...\nReasonably priced hotpot for the SF area; everything from the meat to the toppings was presented neatly and in a great way! All the meat and seafood I had...\nStandard, reasonably priced hot pot in SF. The outside looks like it's perpetually under construction but the inside is nice. There's a ton of seating; I..."},{"Name":"Tonton Restaurant","Rating":4.2,"Address":"422 Geary St, San Francisco, CA 94102","Categories":"Ramen, Japanese Curry","Latitude":37.7871590427,"Longitude":-122.4103549495,"Price":"$$","Reviews":"Quick Summary:\n- Close to Powell, advice is to walk from Union Square\n- Great portions; entered hungry, left full and content\nThis was marked as one of the...\nWe popped in for lunch on a Sunday afternoon after going to a daytime children's concert at nearby August Hall.  The food was tasty, the service was prompt...\nIs this place called Tonton, or as one sign says Katana-Ya? Or as the sign next door says Amami? Either way, after all these years, this place continues to..."},{"Name":"Bartlett Hall","Rating":3.6,"Address":"242 O'Farrell St, San Francisco, CA 94102","Categories":"Breweries, Sports Bars, Gastropubs","Latitude":37.7863779183,"Longitude":-122.4087231606,"Price":"$$","Reviews":"Great spot to take a break from union square or shopping! There were plenty of TVs to watch a game or two. \nWe really enjoyed their house beer. Nice & tasty.\nThis is a solid happy hour place in downtown SF! Great value, great beers and wines, great bar bites, and great service! \nBartlett Hall is conveniently...\nThis is an update to my previous review which I provided last year. \nI've brought several friends and everyone has enjoyed the experience. On our last..."},{"Name":"John's Grill","Rating":3.7,"Address":"63 Ellis St, San Francisco, CA 94102","Categories":"Steakhouses, Seafood","Latitude":37.7854539486,"Longitude":-122.4072000843,"Price":"$$$","Reviews":"Our first dinner in San Francisco when we were in town for the GI ASCO conference. Several of us are stomachless  and they took great care of us. Fellow...\nIt was our Christmas dinner with a big party. The restaurant was fully booked and crowded when we arrived. The decor was festive and everyone looked happy...\nWe thought we'd try this place out as we saw a line of people trying f to get in. We were able to get Christmas Eve reservations and when we arrived, we..."},{"Name":"Nomu Skewers","Rating":4.3,"Address":"580 Bush St, Ste 101, San Francisco, CA 94108","Categories":"Izakaya, Sushi Bars","Latitude":37.79061,"Longitude":-122.40672,"Price":"$$","Reviews":"Thank you so much for taking care of us and giving good service . They also provided us with such a great dish which they were about to put it on the menu ,...\nSuper delicious!!!  We were so very pleasantly surprised to have found this place so close to where we were staying (literally next door). Everything was...\nI had my delicious Japanese food there. \nTruly like the location and atmosphere\nClean and beautiful great staff, and of course my favorite wine was there"},{"Name":"Chotto Matte","Rating":3.6,"Address":"50 O'Farrell St, San Francisco, CA 94108","Categories":"Sushi Bars, Seafood, Cocktail Bars","Latitude":37.7869335503,"Longitude":-122.4057784,"Price":"$$$$","Reviews":"The roll that I got had shrimp which I don't normally do but I didn't mind it at all, it was delicious. I loved the way it was presented by Ana, she made me...\nWhat an amazing experience. Joseph the guy with cool white glasses - gotta mention that - took such great care of us. He picked up some of our dishes and...\nChotto Matte exceeded my expectations with its exceptional service and ambiance. One thing that I absolutely loved, was how great our server, Joseph, was...."},{"Name":"Bocado","Rating":4.4,"Address":"701 Folsom St, San Francisco, CA 94107","Categories":"Peruvian, Desserts, Cocktail Bars","Latitude":37.7835036,"Longitude":-122.3990620884,"Price":"$$","Reviews":"If there's something valuable to me, it's good treatment and, of course, the exquisite taste of a great dish, accompanied by a lovely place like Bocado. \nI...\nI'm surprised this place isn't that busy . The vibes gives off a casual dining place where you can hang out with your homies to catch up. With its location...\nPeruvian underwater-themed fine dining. Has cool lighting with a glowing counter and shiny fish decor. Would recommend reserving a table ahead of time. Came..."},{"Name":"The European","Rating":3.9,"Address":"490 Geary St, San Francisco, CA 94102","Categories":"Cocktail Bars, Lounges, Tapas Bars","Latitude":37.78714,"Longitude":-122.41133,"Price":"$$","Reviews":"I visited with a friend for a quick happy hour get together. We each sliders, patatas bravas, truffle garlic fries & cocktails (I had a mojito & my friend...\nIt was so nice to have a functioning bar and food options in a hotel, again. The food served here comes from the tapas restaurant and is good. The churros...\nBartenders are top notch, they make you feel welcome and can make any drink. Offered a blackberry mojito and the espresso martini were delicious. They have..."},{"Name":"Lapisara Eatery","Rating":4.6,"Address":"698 Post St, San Francisco, CA 94109","Categories":"Breakfast & Brunch, Burgers, Thai","Latitude":37.7878512917,"Longitude":-122.4132306035,"Price":"$$","Reviews":"I had this place bookmarked for awhile because the pictures looked cute, but put it off because of the location (I don't go to this area very much\/prefer...\nMy guy and I went to this establishment for my birthday brunch on my birthday. This has been on my list for brunch for a bit but have chosen other spots....\nOverall would rate food 3.5\/5. Presentation of the food was amazing and beautiful.\nTom Yum burrito had a light Tom Yum flavor. I thought the texture was a..."},{"Name":"The Cavalier","Rating":3.9,"Address":"360 Jessie St, San Francisco, CA 94103","Categories":"New American, British, Cocktail Bars","Latitude":37.7833197673,"Longitude":-122.4069733336,"Price":"$$$","Reviews":"I never forget to write about how good Cavalier was, their humble staff members and hostess, the holiday decor, and of course, the presentation and quality...\nReally unimpressed by their menu. I attended a private function and the menu was just weird. There were 3 entree options offered, one was fried mushrooms,...\nA nice warm ambiance place especially during the holidays.  Staff was friendly and attentive.\nCocktails were slightly above average but the dessert was a..."},{"Name":"King Of Thai Noodle House","Rating":3.3,"Address":"184 O'Farrell St, San Francisco, CA 94102","Categories":"Thai, Noodles","Latitude":37.7865994887,"Longitude":-122.4077435829,"Price":"$$","Reviews":"I enjoy this spot! \nI love the yellow curry it is spicy! Filling and soulful! All lot of tables. Service is friend and quick! \nI will continue to come...\nIt's a late Friday night there's not too many places to get a decent meal with a large event in town.  King of Thai Noodle House was within...\nI didn't go to the restaurant so i can't attest to the ambiance. I did however doordash the food during the christmas season, and it came perfectly on time...."},{"Name":"Ryoko's","Rating":3.9,"Address":"619 Taylor St, San Francisco, CA 94102","Categories":"Sushi Bars, Japanese, Bars","Latitude":37.7881987776,"Longitude":-122.4120591581,"Price":"$$","Reviews":"Love Ryoko! It's such a vibe~ $5 sake and fair priced sushi! Grab a more intimate table, or sit at the bar and strike a convo with the chef\/seat neighbor;...\n3.5 stars\nI have stopped by this spot a couple of times, and it's pretty decent sushi. I deducted 1.5 stars for finding a hair in my sushi :( so I was...\nThis place is SO GOOD! Decent prices and live music on the weekends. It's a great time especially if you want to come after a night out. \nThe sushi is also..."},{"Name":"Sisterita","Rating":4.7,"Address":"669 Commercial St, San Francisco, CA 94111","Categories":"Breakfast & Brunch, New American, Thai","Latitude":37.793966,"Longitude":-122.404206,"Price":"$$","Reviews":"Food was wonderful and service was amazing. Definitely unsuspecting from the outside but the ambiance and decor were so pleasing. The Alcatraz escape was...\nMy favorite brunch spot in the city! My choice of menu items, #1 being my favorite\n1. The alcatraz escape is a unique blend of cohesive flavors that is so...\nWhile I enjoy frequent dining out in The City, either solo, or with hubby and\/or friends, it's been some time since I've been moved to write a..."},{"Name":"Jasmin's","Rating":4.9,"Address":"809 Bush St, San Francisco, CA 94108","Categories":"Breakfast & Brunch, Burgers, Fast Food","Latitude":37.789781,"Longitude":-122.410629,"Price":"$$","Reviews":"My boyfriend came here on a trip to SF and had a wonderful time. The food is delicious, the staff are incredibly friendly, and it's such a warm environment....\nThis place has been here for 6 months - within walking distance and I barely tried it. \nSuch a classic taste - but thicker patties \n($12 for a double...\nTiny little burger joint near Union Square, but just up the hill enough to avoid all the touristy stuff.  Limited menu that seems to straddle both burgers..."},{"Name":"Pinecrest Diner","Rating":3.6,"Address":"401 Geary St, San Francisco, CA 94102","Categories":"Diners, New American, Breakfast & Brunch","Latitude":37.787,"Longitude":-122.41001,"Price":"$$","Reviews":"I have made it a point come here for breakfast whenever I'm in San Francisco. The first time I can in they were warm and hospitable and over the course of...\nCame here on a Monday early lunch and our wait time was only about five minutes for four of us. We were quickly seated and the menu was a good selection to...\nAccessibility: the front door is a difficult to get into as there is literally a column in the way, and the bathroom is NOT wheelchair accessible because..."},{"Name":"Big Apple Pizza N Grill","Rating":4.0,"Address":"127 Eddy St, San Francisco, CA 94102","Categories":"Pizza","Latitude":37.7842202687,"Longitude":-122.4097689,"Price":"$$","Reviews":"This was within walking distance to our hotel (Hilton Parc 55) and it was open late (until 3am?) so it was perfect for that late night meal after Outside...\nIs this place going to change your life? No. Is this place somewhere I'd go when I'm sober? Probably not. But is this place perfect for when you're getting...\nI had a chopped cheese sandwich and a slice of pepperoni pizza and I must say it wasn't too bad! The sandwich was well constructed and had a good amount of..."},{"Name":"The Public Izakaya","Rating":4.4,"Address":"700 Post St, San Francisco, CA 94109","Categories":"Izakaya, Sushi Bars, Ramen","Latitude":37.7878364625,"Longitude":-122.413599,"Price":"$$","Reviews":"This place is a 10\/10 (service, food, ambiance)! \n\nMy friends and I went at around 1 AM to finish celebrating my birthday. Immediately I was given the happy...\n===TL;DR===\n- Classic skewer sampler\n- Spicy miso ramen \n- Millionaire tonkotsu\n- Lion king remix roll \n- Fresh soju mango cocktail \n===TMI===\nPop into this...\nFood:\nI ordered the tempura udon, hotate nigiri, and kaarage and gyoza. The tempura that came with the udon didn't taste that fresh to be honest. The shrimp..."},{"Name":"Tratto","Rating":3.9,"Address":"501 Geary St, San Francisco, CA 94102","Categories":"Italian, Wine Bars, Cocktail Bars","Latitude":37.786624,"Longitude":-122.411815,"Price":"$$","Reviews":"Meh. That was my husbands response after eating here. It's a hotel restaurant which I generally avoid, but had higher hopes given then reviews,...\nI've been here before, back when Harry Potter was running at the theater, but that was years ago and all I remembered was the great proximity to the...\nThis restaurant was down the street from our hotel and as I was walking by it caught my eye so we stopped in for some dessert and a night cap. We decided to..."},{"Name":"Cocobang","Rating":3.8,"Address":"550 Taylor St, San Francisco, CA 94102","Categories":"Korean","Latitude":37.78771,"Longitude":-122.41139,"Price":"$$","Reviews":"Cocobang, I am so glad you exist! After midnight, this is my fav spot for real food (and a soju nightcap) after a night out anywhere in\/near SOMA or the...\nThis was a solid Korean spot, in an okay location.\nOur personal favorite was the bbq short ribs! So so so flavorful. The chicken wings were large and...\nWhat is better than a warm army soup after a night out? Literally nothing. \n\nCocobang is my favorite spot for late night eats. The wait time could be a hit..."},{"Name":"The Melt","Rating":4.0,"Address":"925 Market St, San Francisco, CA 94103","Categories":"Burgers, Sandwiches, American","Latitude":37.78329,"Longitude":-122.40843,"Price":"$$","Reviews":"The best place to eat when you aren't sure , what you want they have it and it's all delicious\nFive stars...what can I say. It's top notch!!! Killer food, killer staff, I would recommend everyone give it a go. A++\nIn the city for a movie. Found this gem on our walk to the theater! So good!!! Place was clean and the staff very friendly.\n\nThe food was excellent!!!! I..."},{"Name":"Bin 480","Rating":4.1,"Address":"480 Sutter St, San Francisco, CA 94108","Categories":"New American, Wine Bars","Latitude":37.7894504719,"Longitude":-122.4084135693,"Price":"$$","Reviews":"After day of traveling arrived at Bin just needing simple meal. Club sandwich is excellent and service was very good.\nThis restaurant is located on the main floor of the San Francisco Marriott Union Square where I stayed for a week, so I dined here a few times out of...\nConveniently located in Marriott lobby, laid back atmosphere easy to eat alone or with group. Also lots of TVs for viewing. Kind and prompt wait staff. Also..."},{"Name":"Hidden Spot - South San Francisco","Rating":4.7,"Address":"303 Grand Ave, South San Francisco, CA 94080","Categories":"Sandwiches, Burgers, Sports Bars","Latitude":37.65509,"Longitude":-122.41039,"Price":"$$","Reviews":"I was driving around looking for this place and then realized it's a kitchen spot inside the Hometown Hero's bar. These are without a doubt the best wings...\nLocated inside Hometown Heroes (sports bar). Parking is pretty easy! You order at their counter inside the bar, and are able to sit at a table or at the bar...\nI decided to give this place another try because I wanted to know if my last experience was just an \"off\" day. \nIt was not.\nI brought my brother, and he..."},{"Name":"Rockoto Peruvian cuisine","Rating":4.5,"Address":"207 Linden Ave, South San Francisco, CA 94080","Categories":"Peruvian","Latitude":37.6545022,"Longitude":-122.410557,"Price":"$$","Reviews":"Ceviche Costeno this along with the taro chips is delicious. Chicken Empanadas are light crispy and delicious as well.  The light green sauce served...\nThis strip of restaurants has some of the tastiest food I've had here in South San Francisco. Rockoto was no different. We came here on cold Tuesday night...\nFairly new place in SSF to enjoy some\nPisco sours and ceviche. We enjoyed the original and maracuyá sours, both were perfectly frothy. We  shared the..."},{"Name":"Mazra","Rating":4.7,"Address":"504 San Bruno Ave W, San Bruno, CA 94066","Categories":"Mediterranean, Barbeque, Tapas\/Small Plates","Latitude":37.62957,"Longitude":-122.41554,"Price":"$$","Reviews":"I showed up Sunday afternoon and the place is packed with limited parking. I was excited. Food must be amazing for this kind of crowd.... It was mid at...\nMazra is my #1 favorite Mediterranean place in the bay! Came during non-peak time and I felt like my food portions were bigger and juicer than last time....\nHow can I describe in a few words. \n\"Fun, Fun, Fun, a must to come to\"\nFamily friendly, bring a date and even a business meeting as well as big groups..."},{"Name":"Hula Hoops","Rating":4.2,"Address":"2278 Westborough Blvd, Ste 203, South San Francisco, CA 94080","Categories":"Tiki Bars, Asian Fusion, Venues & Event Spaces","Latitude":37.644909,"Longitude":-122.452615,"Price":"$$","Reviews":"Family Style Fun\nHad my husband's birthday dinner here for 27 people and Hula Hoops did an excellent job! From my initial request up to my event, Hula...\nThe food was very delicious and the drinks were amazing. The service provided by the staff was excellent.\nWonderful food & great service in a very busy restaurant. Beautiful presentation & delicious!"},{"Name":"Brothers Cafe","Rating":4.3,"Address":"382 Grand Ave, South San Francisco, CA 94080","Categories":"New American, Cafes, Breakfast & Brunch","Latitude":37.6556733955,"Longitude":-122.4119172565,"Price":"$$","Reviews":"Yelp came through for me once again. The food and service were great. \nI was amazed at how fast our food came out. Will definitely be back.\nI placed a phone order for pickup, but there seemed to be an issue with their phone system. The employee had difficulty hearing me and even got my name...\nHad breakfast here this past Sunday.\nFood was good with a large menu and friendly service.  Casual atmosphere.\nOrder and pay at counter and food delivered..."},{"Name":"Shabu Shack","Rating":4.5,"Address":"200 Grand Ave, South San Francisco, CA 94080","Categories":"Japanese, Hot Pot","Latitude":37.6550767748,"Longitude":-122.4086362329,"Price":"$$","Reviews":"Came for AYCE on a Monday night because there was no time like the present! AYCE is $44 and only offered Monday through Thursday. \nThe American wagyu, lamb...\nCame here for dinner last night with my bf after seeing this pop up on our radar a while ago. My sister also said she tried this spot and liked it so we...\nFood is good but I think it's a bit overpriced. +$2 if you want your entrée to come with udon and $7 for a side of 6 fish ball with roe is crazy. \nUnless..."},{"Name":"Minari","Rating":4.4,"Address":"449 San Mateo Ave, San Bruno, CA 94066","Categories":"Korean","Latitude":37.6229,"Longitude":-122.41156,"Price":"$$","Reviews":"Came here on a Wednesday for dinner and was craving some good Korean food! \nGood: \n- Fast service - our army stews came out in less than 10 min \n- Really...\nCame here on a Thursday evening at 6:30 with a couple of good friends. The place was full of patrons enjoying their food. Shortly after we were seated a...\nMinari is a welcomed addition to San Bruno. It provides the perfect bookend to K Grill and Tofu House who has been a long classic on San Mateo Ave.\nWe..."},{"Name":"A One Kitchen & Bar","Rating":4.4,"Address":"677 San Mateo Ave, San Bruno, CA 94066","Categories":"Bars, Seafood, Asian Fusion","Latitude":37.627862,"Longitude":-122.411562,"Price":"$$","Reviews":"The noodle soups are delicious! \nI saw other reviews recommending their thai\/malaysian food, so I followed their advice and it paid off. They have some...\nMaking a reservation in advance through Yelp was a seamless process, setting the stage for a culinary journey that exceeded expectations.\nFrom the Thai...\nYou need to check out this amazing restaurant. Been here three times so far and the food and service have been consistently great. Tried the garlic crab..."},{"Name":"Mom’s Tofu","Rating":4.5,"Address":"415 Grand Ave, South San Francisco, CA 94080","Categories":"Korean, Barbeque, Soup","Latitude":37.6556710726,"Longitude":-122.4131455022,"Price":"$$","Reviews":"A restaurant in the downstairs of a building, it's easy to miss but definitely come by because this is some of the best food in the area. \n*Their signature...\nThe service is a little slow. You definitely need to ring the little bell on your table if you need anything at all because they're not coming to your table...\nWas craving korean food and decided to try this and ended up being impressed! We ordered bibimbap, seafood pancake, and chicken soup. \nBibimbap and the..."},{"Name":"Cochinita","Rating":4.5,"Address":"334 Grand Ave, South San Francisco, CA 94080","Categories":"Mexican","Latitude":37.6555364175,"Longitude":-122.4108673706,"Price":"$$","Reviews":"Loved the vibes, service was great, and the food was chef's kiss! I can't wait to come back! I also had a mocktail, \"un domingo en merida\", it was...\nWe first had Cochinita at their food truck in SF, loved it and then a few weeks later, saw they were opening up on Grand Ave! The food has ALWAYS been...\nMy friend treated to dinner as a birthday gift!  The food was delicious!!!!!\nThe service was fantastic they made us feel at home, they surprised me with a..."},{"Name":"Sky Cafe","Rating":4.6,"Address":"223 Grand Ave, South San Francisco, CA 94134","Categories":"Vegan, New American, Asian Fusion","Latitude":37.6548187,"Longitude":-122.4092408,"Price":"$$","Reviews":"Immaculate vibes in here. Cutest French terrier named Jack greeted us along with the server. The food was mainly comfort style with great flavors. \nThe...\nI came here to meet up with my husband and his colleagues for a late lunch. The first thing I noticed when I walked in was the tables of empty plates that...\nI've ordered food from Sky Cafe twice now and both times I have been pleasantly surprised with how much I like the food.  The concept is certainly unique...."},{"Name":"Dumpling and Cajun Seafood","Rating":3.9,"Address":"320 Grand Ave, South San Francisco, CA 94080","Categories":"Cajun\/Creole, Seafood, Chinese","Latitude":37.65559,"Longitude":-122.41057,"Price":"$$","Reviews":"How many cajun - chinese places have you been to? I havent been to many, hence this review.\nCame here about an hour before closing.\nAmbience and...\nSo I have tried this restaurant about four times and won't go back anymore. \nWe did lunch buffet and ordered 7dishes but 4 of them are same dishes and one...\nWe usually go to the Chinese restaurant across the street, but decided to look at other options.  While looking at the menu from outside, the lady from..."},{"Name":"Sofra Grill","Rating":4.8,"Address":"132 Hazelwood Dr, South San Francisco, CA 94080","Categories":"Turkish, Middle Eastern, Barbeque","Latitude":37.64226,"Longitude":-122.42648,"Price":"$$","Reviews":"Perfection. Everything we had was delicious. That lamb shank! Just the best. I guess I need more words to post. Great experience.\nVery delicious, well prepared, fresh food! Great presentation \nWill definitely be back\nThe pomegranate sesame glazed chicken wings are bomb! It's a must order if you are here!\nCame here on a Tuesday night for dinner. The place was empty when..."},{"Name":"The Anecdote","Rating":4.3,"Address":"348 Oyster Point Blvd, South San Francisco, CA 94080","Categories":"New American","Latitude":37.6619327788,"Longitude":-122.3842532896,"Price":"$$","Reviews":"Food was abundant and delicious \nHad the chicken sausage, eggs,potatoes and pancakes \nCoffee was exempliary\nNice environment and pleasant service team. \nWait for food was longer than expected. \nLobster bisque was watery and didn't have much flavor and serving size...\nIt's a bit confusing finding this restaurant. \nGo to the end of Oyster Point and turn right into garage. Park on P3 West spaces take elevator to 1st floor..."},{"Name":"Local Kitchens","Rating":3.8,"Address":"851 Cherry Ave, Ste 2, San Bruno, CA 94066","Categories":"Food Court","Latitude":37.6268136112,"Longitude":-122.425534,"Price":"$$","Reviews":"Came by twice now, for dinner takeout.\nWas excited that a local kitchens opened up.\nParked in the parking lot. \nstaff is friendly.\nInside looks...\nSo stoked this place is finally open! \nHad the pleasure of first trying Local Kitchens for a Yelp Event in January of 2021. We loved the idea of one...\nLocal Kitchens is a gift to the San Bruno community!\nMy family and I went to their Grand Opening party on February 3 and loved it, however, I stopped..."},{"Name":"Amoura Restaurant","Rating":4.4,"Address":"713 Linden Ave, South San Francisco, CA 94080","Categories":"Mediterranean, Middle Eastern, Salad","Latitude":37.659551,"Longitude":-122.4089618411,"Price":"$$","Reviews":"Oh gosh. I was in the mood for an elevated dining experience and we found it 5 minutes from our hotel.\nWe had the roasted carrot\/avocado\/cuke veg, the...\nThis is definitely a more upscale restaurant, and the food is excellent! \nMezze platter - loved everything on here. Falafel had a great crunch, hummus was...\nI was recently in SF on business and we went to Amoura for dinner after a looong meeting.  Service was pleasant as we arrived, everyone ordering drinks at..."},{"Name":"White Elephant Restaurant","Rating":3.8,"Address":"146 Hazelwood Dr, South San Francisco, CA 94080","Categories":"Thai, Noodles, Vegetarian","Latitude":37.6420863,"Longitude":-122.4266505,"Price":"$$","Reviews":"Five Star Service!\nIn the era where tips is expected despite of sub par to no intention to do a good job, White Elephant Restaurant staffs were above and...\nWe enjoyed everything we ordered! Definitely going to get more spicy on the curry.\nService was good. Our order came before 7 when we ordered around 6:15....\nAll tables full on a Sunday evening so we knew it was going to be good. But it was better than we even expected!\nPerfect flavors on the creamy chicken red..."},{"Name":"Naan Point","Rating":4.7,"Address":"851 Cherry Ave, Ste 6, San Bruno, CA 94066","Categories":"Indian","Latitude":37.62575,"Longitude":-122.426,"Price":"$$","Reviews":"Best Indian food in san bruno!!!!! (We have tried other Indian places around SB but this is the best!) We always order to-go from Naan Point but never had a...\nThe food was amazing as well as portions. You can't go wrong with the free Chai either. This place was perfectly balanced not too spicy and the flavor was...\nExcellent food and service. Large menu items including vegetarian and vegan options. Yum!"},{"Name":"Ben Tre Vietnamese Homestyle Cuisine","Rating":3.9,"Address":"398 Grand Ave, South San Francisco, CA 94080","Categories":"Vietnamese, Noodles, Soup","Latitude":37.6557878294,"Longitude":-122.4122281373,"Price":"$$","Reviews":"Everything about this place is perfect. You walk in and it's slammed and loud like it should be! And you're instantly ushered to a nice booth with hot tea....\nHello everyone I just wanted to say How good this restaurant is from the sops on a cold day to their shakkin beef to die for with garlic noodles O M G...\nTHEY HAVE THE BEST BUN RIEU IVE HAD IN THE BAY. \nI ate other things here like the Garlic Noodles, 5- Spice Chicken, Bun Bo Hue but i think i fell in love..."},{"Name":"Cafe De Casa","Rating":4.4,"Address":"1165 Airport Blvd, South San Francisco, CA 94080","Categories":"Brazilian, Acai Bowls, Cafes","Latitude":37.6640655,"Longitude":-122.3998725,"Price":"$$","Reviews":"The employees here are so sweet.  Especially the girl with the red hair on the register today.  She was super patient with me and very sweet.   There is...\nI was looking forward to eating here specially because of the vegan options advertisement. So first thing is that I parked kind of in a not so perfect spot...\nThe pastries here are amazing!  Light and fluffy.  I can't believe they have gluten free items.  So delicious. \nVery friendly staff helped me pick out the..."},{"Name":"Hip Hop Bbq Shack","Rating":4.6,"Address":"223 El Camino Real, San Bruno, CA 94066","Categories":"Barbeque, Desserts, Soul Food","Latitude":37.618473,"Longitude":-122.409758,"Price":"$$","Reviews":"Had a catering order from here for my son's birthday party! Setting up the order was easy and convenient and the food was outstanding!.\nWe got the baby...\nSo this place gets 5 just on the strength of the chef who is present, personable, and just a sweet lady. Lovely big smile, anytime you see something like in...\nThis place used to be Rib Shack but now it's called Hip Hop Bbq Shack. The big sign above still has the old name and the owner, May doesn't intend to change..."},{"Name":"Keith's Chicken N Waffles","Rating":4.3,"Address":"665 El Camino Real, South San Francisco, CA 94080","Categories":"Southern, Soul Food, Chicken Wings","Latitude":37.6495716604,"Longitude":-122.4304779,"Price":"$$","Reviews":"Keith's Chicken and Waffle is the BOMB.COM!!! The chicken is favorable and incredibly delicious. The sides are also good. The yams aren't too sweet, and the...\nYum! My boyfriend and I come here whenever we crave chicken and waffles. This was our first time at the SSF location since we usually go to the Daly City...\nI was so excited to see that they opened a location in SSF. This location has seafood on the menu. My husband and I shared an order of catfish and grits and..."},{"Name":"The Night Market","Rating":3.4,"Address":"230B S Spruce Ave, South San Francisco, CA 94080","Categories":"Hong Kong Style Cafe, Dim Sum","Latitude":37.647744,"Longitude":-122.420514,"Price":"$$","Reviews":"Place is a lot smaller than expected for its namesake. A large menu showcases a plethora of Cantonese fare that you order at the kiosk that is then...\nThis place was my go-to for duck meat. Now, they have removed it in the menu.... I'm quite sad and disappointed. I really hope that they can bring duck...\nI'm surprised at the other reviews, this place is a great casual spot!\nDon't let the name fool you. This spot in indoors but decorated to look like a night..."},{"Name":"Taqueria San Bruno","Rating":4.5,"Address":"1045 San Mateo Ave, San Bruno, CA 94066","Categories":"Mexican","Latitude":37.63532,"Longitude":-122.41174,"Price":"$$","Reviews":"Went here last Saturday and back tonight. Burritos, tacos, guacamole, salsas were excellent both times. When I was sitting in the chairs by the counter,...\nSolid super burrito. It's been challenging to find good Mexican joints around our area, so I was excited to try Taqueria San Bruno, thanks to our lovely...\nTaqueria San Bruno is HANDS DOWN the best taqueria I have ever been to. Many locals will say the best taquerias are in the city, but this place is the..."},{"Name":"Han Sang","Rating":4.3,"Address":"420 Broadway, Millbrae, CA 94030","Categories":"Korean","Latitude":37.602032,"Longitude":-122.392738,"Price":"$$$","Reviews":"Came here for lunch with 5 other friends who recommended the place. We ordered the Gal Bi Jjim Combo and if you like cheese, be sure to add the cheese...\nHan Sang is one of those restaurants where I'm not sure if I like it or not because it's different from when I came during their grand opening in some ways....\nI am in love with this place! Their food is super authentic and like a warm hug to your insides on a chilly day. If you had a Korean mom or grandma, this is..."},{"Name":"Saap Thai Kitchen","Rating":4.2,"Address":"427 Linden Ave, South San Francisco, CA 94080","Categories":"Thai, Noodles, Vegetarian","Latitude":37.656856,"Longitude":-122.409723,"Price":"$$","Reviews":"I meet my girlfriend here for lunch and it is a cosy place with super sweet staff. I ordered the mixed vegetables and was given complementary portion of...\nLoved the decorations, it was very cute inside! It was small, but it wasn't busy. I will say, the service was a bit slow and lacking. The server was so nice...\nGreat time at a new restaurant. We were in the mood for Thai and decided on this restaurant. The space was a bit tight, BUT there was room for us since we..."},{"Name":"Cajun Bowl - San Bruno","Rating":4.2,"Address":"1230 El Camino Real, D, San Bruno, CA 94066","Categories":"Seafood, Cajun\/Creole, Juice Bars & Smoothies","Latitude":37.639357,"Longitude":-122.420921,"Price":"$$","Reviews":"===TL;DR===\n- Build my own: \n    - 1 lbs shrimp (head on), 1 lbs clam, sausage and potato, the ultimate sauce, medium\n    - 3 lbs shrimp (head on), 1 lbs...\nNot bad, but not the best! \nService: very nice and attentive \nCleanliness: hmm, I saw a medium size bug on the floor. \nFood: average \nGrilled Oysters:...\nThis place gets the job done when you don't want to travel all the way to San Jose for Boiling Crab. I've done both dine-in and takeout from here multiple..."},{"Name":"New England Lobster Market & Eatery","Rating":4.4,"Address":"824 Cowan Rd, Burlingame, CA 94010","Categories":"Seafood Markets, Seafood, Tapas\/Small Plates","Latitude":37.602687,"Longitude":-122.374733,"Price":"$$","Reviews":"This place is fantastic. In addition to lobster they have dungeoness crab when it's in season. Fresh from half moon Bay. $19.99 steamed and cracked....\nThe New England Lobster Market was the perfect place for my wife and I to get some seafood for dinner.  They are located in Burlingame by Marriott hotel,...\nThe naked lobster rolls ( with drawn butter) are delicious  ( a treat for me). My adult kids also order the shrimp bucket and oysters ( many choices and..."},{"Name":"Ichika Sushi House","Rating":4.4,"Address":"118 Old County Rd, Brisbane, CA 94005","Categories":"Japanese, Sushi Bars, Seafood","Latitude":37.6859172384,"Longitude":-122.399517133,"Price":"$$","Reviews":"Ichika is a true gem in the area. The presentation, quality and overall service is 5 stars. Not to mention that the prices are rather reasonable!\nThings...\n10\/10 - Soft shell crab ramen: For $19, the ramen was delicious with plenty of crab. I definitely recommend it! \n9\/10 - Shrimp tempura roll: Loved that...\nCame here with a friend of mine on a cold day. Ordered a chicken katsu curry for myself. My friend ordered some sashimi and a steak entree.\nThey offered..."},{"Name":"JC Bruno Restaurant","Rating":4.1,"Address":"741 San Mateo Ave, San Bruno, CA 94066","Categories":"New American, Pizza, Seafood","Latitude":37.62928,"Longitude":-122.4115768519,"Price":"$$","Reviews":"Treated myself to a delicious tasty dinner at JC Bruno! \nChef JC always deliver amazing tasty delicious food! \nJazzy classy modern ambiance! \nHidden gem...\nNice and clean place, decent but a little hasty service. The quality of the dishes and ingredients is typical of all-you-can-eat. Pricier but nothing...\nThis place is definitely a hidden gem! Honestly driving by it, you wouldn't know it's a restaurant from the outside. It's such a cute place inside,..."},{"Name":"Chico Marx","Rating":4.3,"Address":"2 Tower Pl, South San Francisco, CA 94080","Categories":"Latin American, Tapas\/Small Plates, Cocktail Bars","Latitude":37.6667949,"Longitude":-122.3972332213,"Price":"$$","Reviews":"I was in this restaurant with my parents,  we really liked everything, the atmosphere was super, the music was pleasant and not loud.  We got there in the...\nOverall 5\/5: this place is a hidden gem. I went on a Thursday around 6 and was dead. Not sure why, because this place slaps!! Do not go to the hotel...\nThis place is fairly new, it's been open for 6 months. The interior is super nice. Clean and chic. \nWhen I arrived I was greeted my Cortney, who is..."},{"Name":"Andiamo In Banca","Rating":4.2,"Address":"301 Linden Ave, South San Francisco, CA 94080","Categories":"Italian, Desserts","Latitude":37.6553519692,"Longitude":-122.41020705,"Price":"$$$","Reviews":"It doesn't look like much from the outside (well, it looks like a bank), but this restaurant has a lot to offer. It was easy to make a reservation online...\nFirst, although it doesn't look like much from outside,  the restaurant is beautiful on the inside. The tables are nicely spaced out and comfortable...\n2 mins from closing time, some lights were turned off YET the gentleman opened the door when I requested to be let in with my friend for a late night gelato..."},{"Name":"Flavas Jamaican Grill","Rating":4.2,"Address":"314 Linden Ave, South San Francisco, CA 94080","Categories":"Caribbean","Latitude":37.6557135964,"Longitude":-122.4097828136,"Price":"$$","Reviews":"I love the flavors here, everything is good.  Have had it catered for work and have had it dine-in. \nThe pork, chicken are great but defiantly try the...\nA very small place with huge flavor!  I love Caribbean Jerk and love whole fried fish which is very hard to find done dry without breading. \nI started with...\nI've passed by this place a handful of times without even realizing, but Flavas is serving some phenomenal Jamaican food that should not be passed by. \nI..."},{"Name":"Ristorante Buon Gusto","Rating":4.1,"Address":"224 Grand Ave, South San Francisco, CA 94080","Categories":"Italian, Bars","Latitude":37.655244,"Longitude":-122.409062,"Price":"$$","Reviews":"Went here for my boyfriend's parents' anniversary and we had an awesome experience! \nFood: authentic Italian food. The pasta was swimming in seafood. The...\nNice ambiance - it wasn't too loud either. Plentiful menu! Nice service.\nHouse Bread\nTheir house bread is delicious and so fresh!!\nLinguine Tutto Mare...\nHappy. Holidays \nI had the pleasure to have Dinner at Buon. Gusto and we had a GREAT DINNER \nThe place has been remodel and it looks very appealing with a..."},{"Name":"Tiny Sushi - Oh Baby","Rating":4.8,"Address":"32 Park Plaza Dr, Daly City, CA 94015","Categories":"Sushi Bars, Japanese, Vegetarian","Latitude":37.7012836,"Longitude":-122.4820049822,"Price":"$$","Reviews":"Probably the best quality sushi in Daly City. Cozy environment with very friendly staff. Would highly recommend coming here\nNice place, delicious food and kind staffs. Very small restaurant, but big on the flavor! Everything tasted amazing. Parking is on the street, as I'm not...\nOH BABY! Tiny Sushi has become a neighborhood staple and a go-to restaurant for us. We usually order on DoorDash, then pick up the food after grocery..."},{"Name":"Traverse","Rating":4.1,"Address":"800 Gateway Blvd, South San Francisco, CA 94080","Categories":"Bars, Coffee & Tea, New American","Latitude":37.660914839,"Longitude":-122.3944986251,"Price":"$$","Reviews":"In the corporate SSF land where many think of a corporate lunch as \"Foundry & Lux\" comes your best replacement option - Traverse! \nCame here on a work team...\nFor food being served as a workplace cafeteria, I give this 3.5 stars. I visited Traverse as park of an interview so my meal was comped. But, I would be...\nHidden gem in corporate america!\nIt feels like being in the office but way less crowded. Pretty empty on a Wed lunch. Most people get it to-go. Tons of..."},{"Name":"The Lighthouse","Rating":4.1,"Address":"685 Gateway Blvd, South San Francisco, CA 94080","Categories":"Breakfast & Brunch, New American, Coffee & Tea","Latitude":37.6583166,"Longitude":-122.3983421,"Price":"$$","Reviews":"The Lighthouse is one of the best study cafes I've been to!\nSEATING - very easy to find a good seat. I went on a Thursday afternoon from 2-5pm and there...\nParking is very limited, arrived around 11 am and the lot was already filled so I parked in one of the other lots across the street (not sure if that's...\nThe Lighthouse in South San Francisco offers a charming atmosphere that caters perfectly to both productivity and relaxation. Upon stepping in, I was..."},{"Name":"Kuma Nori","Rating":3.9,"Address":"1861 El Camino Real, Burlingame, CA 94010","Categories":"Japanese, Hawaiian, Tapas\/Small Plates","Latitude":37.59516,"Longitude":-122.385993,"Price":"$$","Reviews":"I've been seeing so many reels about this place and begged my friends + husband to come here, but to no avail. Thankfully my work bestie wanted to try too...\nFirst and foremost the flavors are good! We ordered the stupid tuna roll, crab pasta, hamburger steak, Katsudon and wagyu. \nWe waited an hour and half to...\nWas super excited to try this place since it's a couple blocks from our place, is from the same owners as Diamond Head General Store, and have seen multiple..."},{"Name":"E Plus Restaurant","Rating":3.8,"Address":"490 A S Airport Blvd, Ste A, South San Francisco, CA 94080","Categories":"Hong Kong Style Cafe, Asian Fusion, Chinese","Latitude":37.6401150461,"Longitude":-122.4023185,"Price":"$$","Reviews":"The price is worth the food here，and taste really good. i will keep ordering food togo from here.\nOrdered food but no food.\nPlaced my online order with confirmation. When I arrived, the door was locked with a sign indicating no dine-in but call for order...\nThis is the first time I've ordered from them and it's a great experience. \nI ordered the baked pork chop with rice. The pork chop is very soft and tender,..."},{"Name":"K. Grill & Tofu House","Rating":4.1,"Address":"617 San Mateo Ave, San Bruno, CA 94066","Categories":"Korean","Latitude":37.62681,"Longitude":-122.41148,"Price":"$$","Reviews":"K Grill and Tofu House in San Bruno truly delivered an exceptional dining experience. My recent takeout order of bibimbap exceeded expectations, not just...\nThis place feels like home. Both my husband and I live far away from our families. Whenever we want home food, we come here. Whenever we have something to...\nThis place is one of my spots for delicious bibimbap and soondubu! The soondubu hits the spot on a cold winter's night and warms your soul. However, my..."},{"Name":"Dumpling Empire","Rating":3.8,"Address":"216 Cypress Ave, South San Francisco, CA 94080","Categories":"Chinese","Latitude":37.65451,"Longitude":-122.4085747,"Price":"$$","Reviews":"Such a hidden gem. You know the food is going to be good when they serve you with take out boxes and lids. \n\nCame here countless times last year. My default...\nI can't believe I have not rated or reviewed this place yet! As my absolute regular go to whether it's for a hot meal or frozen dumplings to go, Dumpling...\nThis place is amazing ! The dumplings are incredibly delicious and diverse.\n\nA huge surprise is their fried rice and chow mein for those wanting something..."},{"Name":"7 Mile House","Rating":4.2,"Address":"2800 Bayshore Blvd, Brisbane, CA 94005","Categories":"Sports Bars, American, Filipino","Latitude":37.704305,"Longitude":-122.407456,"Price":"$$","Reviews":"Fantastic burgers filipino dishes sports bar great service to go foods lots of parking\n7 Mile House has traditional Filipino dishes. On Sundays, they serve brunch items. It's a great place for Bay Area sports lovers since they have a spacious...\nHell yah I love this spot! I enjoy eating here when I come by. It's usually after a friend hits me up or a team dinner. Love the Filipino food, the drinks..."},{"Name":"Viet Time","Rating":3.9,"Address":"1212 El Camino Real, Unit F, San Bruno, CA 94066","Categories":"Vietnamese, Noodles, Sandwiches","Latitude":37.63891,"Longitude":-122.420733,"Price":"$$","Reviews":"Came by on a Saturday afternoon for a snack! Cute indoor space, not a ton of seating but cozy. Super nice staff. \n\n+ grilled pork bahn mi: opted for...\nNew place across from Tanforan-nice clean and friendly service! I loved how it doesn't smell like dirty dish rags! Tried the cold cuts and chicken banh mi,...\nFairly new place, 3-months open, Vietnamese eatery in the mall by Lowe's in San Bruno. Clean, modern, bright spacious welcoming interior with a nicely..."},{"Name":"Pho de Nguyen","Rating":4.3,"Address":"586-A San Mateo Ave, San Bruno, CA 94066","Categories":"Vietnamese","Latitude":37.6261563,"Longitude":-122.4111054,"Price":"$$","Reviews":"The best pho in the Peninsula. The portions are huge and the broth is so tasteful, and not too salty. The menu is extensive. The service is great. Everyone...\nFrom my very first encounter with Pho de Nguyen's catering at a workplace lunch, I knew I had stumbled upon something special. Chef Phong, the heart and...\nI came in on a Saturday night, and luckily there was no wait. The waiter directed us to a table in the front, but it was dirty. The previous diner's chili..."},{"Name":"Boiling BeiJing","Rating":4.1,"Address":"649 San Mateo Ave, San Bruno, CA 94066","Categories":"Chinese, Hot Pot","Latitude":37.627416,"Longitude":-122.411551,"Price":"$$","Reviews":"I am so glad to have finally tried their famous Peking duck, as it was definitely the best Peking duck I have ever tasted.  I never liked Peking duck skin...\nI ALWAYS come here for peking duck. Birthdays, chinese new year, anniversary, you call it. I'm surprised I haven't left reviewed yet! \nBeing here so many...\nYou must scan the QR code on the table to see the menu.  (There is no hard copy menu - If you don't have a phone to scan the code or unable to scan and see..."},{"Name":"Burma Silver Star","Rating":4.6,"Address":"6318 Mission St, Daly City, CA 94014","Categories":"Burmese","Latitude":37.7057503551,"Longitude":-122.4621623105,"Price":"$$","Reviews":"Wow, I've been to a lot of Burmese restaurants in the bay area already (including some with the most numbers of reviews in the area), but this turned out to...\nI found this restaurant on yelp.  Thank you, Yelp!  I would never have gone here but I happened to be near Westlake and needed some food.  The service was...\nOk went back Sunday to get my curry chicken with potatoes. This time was perfect tasted better than most Burmese restaurants I go to. Was greeted with the..."},{"Name":"Ichika Izakaya","Rating":4.4,"Address":"851 Cherry Ave, Ste 34, San Bruno , CA 94066","Categories":"Sushi Bars, Izakaya","Latitude":37.6256980611,"Longitude":-122.4265950021,"Price":"$$$","Reviews":"Two omakase dinners in 2 weeks...  Lucky me!  We were originally planning to mix skewer orders with sushi\/sashimi, but with my son visiting for the...\nGreat service and quality food!\n\nI appreciate that there's plenty of parking. Highly recommend, our new favorite spot.\nWe just found this place and wished we had known about it sooner. This is the best Izakaya in the area hands down. We stopped in for a quick meal during a..."},{"Name":"Love Burn","Rating":4.3,"Address":"130 Northwood Dr, Hometown Bowl, South San Francisco, CA 94080","Categories":"Chicken Shop, Sandwiches","Latitude":37.643,"Longitude":-122.426178,"Price":"$$","Reviews":"Got the hot chicken sandwich at a spice level of zero. Absolutely delicious. First impression was that the chicken was massive; it stuck so far out of the...\nI got the hot chicken quarters with seasoned fries and my dining partner got the hot chicken sandwich. \n\nWhat a great place! The feeling is really casual...\nOrdered food from Love Burn wow bowling with some friends. Love Burn is located inside Hometown Bowl And can be ordered a couple different different ways,..."},{"Name":"Foundry & Lux","Rating":3.7,"Address":"151 Oyster Point Blvd, South San Francisco, CA 94080","Categories":"New American, Lounges, Venues & Event Spaces","Latitude":37.6636533571,"Longitude":-122.3944006611,"Price":"$$","Reviews":"Fun venue with exceptional food, attentive staff, and abundant free parking at The Cove's parking structure, all while being centrally located to...\nWe ordered a few items from the Happy Hour menu! I can't wait to go back and try the pizza!! The service was amazing and the atmosphere was esthetically...\nObsessed with the cafe's almond croissant! That's all I really wanted to write about lol. The ambiance of the cafe is also very cozy and relaxing. The food..."},{"Name":"Cocina Milonga","Rating":4.8,"Address":"308 Alida Way, South San Francisco, CA 94080","Categories":"Argentine, Food Stands, Empanadas","Latitude":37.6431947,"Longitude":-122.4264521,"Price":"$","Reviews":"This cafe is a fantastic spot to grab a meal. \n\nThe cashier provides excellent service, the place is spotless, and the food is delicious. If you're in the...\nThe empanadas way too good\nService it's really great they treat you like family and always give good tips about the best empanadas \nI enjoy goin there  to...\nBest chicken empanadas to bring home! Love to buy them frozen. They make  great last minute dinner or lunch, just pop them in the oven with an egg wash, and..."}]